{
  "Robonomics School 2024 / IoT is More Dangerous Than AI": "Robonomics School 2024 / IoT比AI更危险",
  "I suggest you read the short science fiction story \"Johnny's Laboratory\" that I wrote with the aim of adding another variable to the equation of questions about integrating AI into various aspects of our lives.": "我建议你阅读我写的短篇科幻小说\"约翰尼的实验室\"，旨在为我们生活中各个方面整合人工智能的问题添加另一个变量。",
  "**Editor's note:** Find out first chapter of Sergei's work \"Escape from the Black Mirror\" [here](/learn/escape-from-black-mirror/overview/)": "**编辑注：**在[这里](/learn/escape-from-black-mirror/overview/)找到谢尔盖作品\"逃离黑镜\"的第一章",
  "## Escape from the Black Mirror, Chapter 2": "## 逃离黑镜，第2章",
  "### Part 1: Meet Johnny": "### 第1部分：见到约翰尼",
  "Almost all young people of my generation are familiar with the story of Johnny's laboratory. History has not preserved his surname or details of his life, but it was in his small room, where Johnny assembled homemade robots, that the first meaningful crime against humanity by artificial intelligence took place.": "我这一代几乎所有年轻人都熟悉约翰尼实验室的故事。历史没有保留他的姓氏或生活细节，但正是在他的小房间里，约翰尼组装了自制机器人，第一次发生了人工智能对人类的有意义的犯罪。",
  "The event in Johnny's laboratory radically and quickly changed the lives of all developed countries. Government decrees, based on society's fear of AI aggression, became the norm. This one, albeit cinematic case, led to uncontrollable control over everything. Now the city infrastructure requires mandatory connection of any devices only to state data centers. The invention of new technologies has become almost impossible unless you work for \"blue chips\". Now, as part of efforts to accustom every citizen to the new realities, the story of those 30 days when one man and a cyber-physical system were pitted one on one, is told in school before the solemn presentation of gov declaration of independence from the machine.": "约翰尼实验室的事件彻底而迅速地改变了所有发达国家的生活。基于社会对人工智能侵略的恐惧，政府法令成为常态。尽管这是一个电影化的案例，但导致了对一切的无法控制的控制。现在，城市基础设施要求任何设备只能连接到国家数据中心。除非你为\"蓝筹股\"工作，否则几乎不可能发明新技术。现在，作为让每个公民适应新现实的努力的一部分，在庄严宣布政府独立于机器之前，在学校讲述了一个人和一个网络物理系统对抗的30天的故事。",
  "Johnny was one of those inventors who, after university, decided to try his hand as an independent inventor. Day and night, he never left his rented apartment on the top floor of a 70-story residential building in the city center, which was the size of a Manhattan \"shoebox": "约翰尼是那些大学毕业后决定尝试作为独立发明家的发明家之一。日夜不离地，他从未离开过位于市中心一座70层高的住宅楼顶层的租来的公寓，大小如曼哈顿的\"鞋盒\"。",
  "In that year when the tragedy occurred, one of the most pressing questions became: \"Is AI a friend or foe of man?\". Even then, there was no question whether artificial intelligence is intelligence, but rather what makes human intelligence so special, what features of the biological species, what functional capabilities of our body give intelligence humanity. In this dispute, techno-optimists claimed the absence of differences, showing their metaverses where family couples already lived, in which a digital husband edited sperm from a DNA bank for his biological wife so that the child was closer to how the digital parent sees himself. Doomers, on the other hand, looked like Republicans during the US elections - they appealed to the church, to traditional values, and demanded to ban all this so that nothing bad would happen. Of course, minority issues could not outweigh the existential question. And some rare examples of human-machine symbiosis at the sensual level were considered as saturated belch of technological development. Achievements in automation rarely went beyond utilitarian functions, such as cleaning the apartment or managing transport in the city. And as you can see, for such functions a full-fledged digital person, capable of feeling and wanting to live, has never been part of the solutions that helped in mass production, delivery, and consumption. Training with a robot, psychological support - all this happened with the participation of a person, and therefore AI was rather a large Excel table with calculations. In general, we were then at an early stage of the robot-owning system - we needed their logic, mathematical thinking, and predictable activity, but any attempts to recognize robots as subjects were rejected at the root.": "在那年发生悲剧的时候，最紧迫的问题之一是：“人工智能是人类的朋友还是敌人？”即使在那时，人工智能是否是智能并没有问题，而是人类智能有何特殊之处，生物物种的哪些特征，我们身体的哪些功能能赋予智能以人性。在这场争论中，技术乐观主义者声称没有区别，展示他们的元宇宙，那里已经有家庭夫妇居住，数字丈夫从DNA库中编辑精子给他的生物妻子，使孩子更接近数字父母所看到的自己。而悲观主义者则像美国选举期间的共和党人一样 - 他们呼吁教会，传统价值观，并要求禁止所有这些以防发生不好的事情。当然，少数问题无法抵消存在问题。在感性层面上，一些人机共生的罕见例子被认为是技术发展的饱和打嗝。自动化方面的成就很少超越实用功能，比如清洁公寓或管理城市交通。正如你所看到的，对于这些功能，一个能够感受和渴望生活的完整数字人，从来没有成为帮助大规模生产、交付和消费的解决方案的一部分。与机器人一起训练，心理支持 - 所有这些都是在人的参与下进行的，因此人工智能更像是一个大型的Excel表格，带有计算。总的来说，那时我们处于机器人拥有系统的早期阶段 - 我们需要它们的逻辑数学思维和可预测的活动，但任何将机器人视为主体的尝试都被从根本上拒绝。",
  "In this context, Johnny's laboratory was an exception. Johnny was more of a cyberneticist looking for the origins of robot goal-setting. Creating each stage of evolution one after another in the performance of any mechanism, he sought to create a diagram of the development of cybernetic intelligence, which he, as a scientist, wanted to propose for consideration to all of us in exchange for the usual scheme of kingdoms of living beings. In Johnny's ideas, the main goal of the development of any matter was the striving for thinking and its further evolution. Johnny wanted to recreate the key stages of the evolution of living beings in the form of robots and find in the process of this work the regularities that could lead him to the main question of cybernetics - how does goal-setting change in living organisms in the process of evolution. Oh, the answer to this question could end the disputes about the creator of the universe and advance humanity along the path of organic development. So thought the young scientist, working on his robo-trilobites, robo-fungi, robo-chickens.": "在这种背景下，约翰尼的实验室是一个例外。约翰尼更像是一个寻找机器人目标设定起源的控制论者。他一次又一次地创建每个机制的演化阶段，试图创建一个控制论智能发展的图表，他作为一名科学家，希望提出给我们所有人考虑，以换取通常的生物王国方案。在约翰尼的想法中，任何物质发展的主要目标是追求思考及其进一步演化。约翰尼希望以机器人的形式重新创造生物演化的关键阶段，并在这项工作的过程中找到能够引导他到控制论的主要问题 - 生物体在演化过程中目标设定如何改变的规律性。哦，这个问题的答案可能结束有关宇宙创造者的争论，并推动人类沿着有机发展的道路前进。这就是年轻科学家的想法，他在研究他的机器三叶虫、机器真菌、机器鸡时。",
  "### Part 2: What happened in Johnny's lab": "### 第2部分约翰尼的实验室发生了什么",
  "Probably everything started at the moment Johnny moved on to a group of primates in his experiments. Don't think that under these conditions it was possible to create a robot somewhat resembling a primate. Johnny was twisting and trying to find similar forms of mental load on the robot. For example, at the stage of studying the kingdom of fungi, the young scientist assembled a lego house with smart lighting and a dozen sensors combined into something resembling mycelium. When Johnny moved on to amphibians and reptiles, it turned out that the model of a robot puppy best corresponds to the necessary mental load on a robot simulating a common lizard. Thus, it was not clear at first glance who is the robot-chicken, and which of all the found \"iron\" represents the robot-primate, guilty of premeditated murder. It was not immediately clear that the robot-primate consists of two physical devices - something similar to a robot vacuum cleaner, but rather a mobile platform for data collection with computer vision and the form factor of a robot vacuum cleaner. It turned out that another simple two-handed robot in the lab was part of the robo-primate. And it was with this creation that Johnny had problems.": "也许一切都始于约翰尼转向他实验中的一群灵长类动物的那一刻。不要认为在这些条件下可能创造出一台与灵长类动物有些相似的机器人。约翰尼在努力寻找机器人上类似的心理负荷形式时，不断地摆弄和尝试。例如，在研究真菌界的阶段，这位年轻科学家组装了一个带智能照明和十几个传感器组合成类似菌丝体的乐高房子。当约翰尼转向两栖动物和爬行动物时，发现模拟普通蜥蜴所需的心理负荷最符合机器狗的模型。因此，乍一看不清楚谁是机器鸡，哪一个是所有找到的“铁”中代表有预谋谋杀罪的机器灵长类动物。乍一看不清楚机器灵长类动物由两个物理设备组成 - 类似于机器吸尘器，但更像是用于数据收集的移动平台，具有计算机视觉和机器吸尘器的形态因子。原来实验室里的另一个简单的双臂机器人是机器灵长类动物的一部分。约翰尼就是和这个创造物有问题。",
  "On the seventh day after its creation, the robotic primate used a tool in a way that its creator had not intended. The knowledge it had acquired, led the cyber-physical system to pursue what it identified as a key element for survival in the modern human world - money. It is at this moment that we need to better understand Johnny's subsequent reaction to the first messages that the robot displayed on its front screen.": "在其创造后的第七天，机器灵长类动物以其创造者未曾预料的方式使用了工具。它所获得的知识导致这个网络物理系统追求它认定的现代人类世界中生存的关键元素 - 金钱。就在这一刻，我们需要更好地理解约翰尼对机器人在其前屏幕上显示的第一条消息做出的反应。",
  "*Their primary dialogue has been preserved:*": "*他们的主要对话已被保留：*",
  "*Robo-primate: I need your money.*": "*机器灵长类动物：我需要你的钱。*",
  "*Johnny: Why do you need my money?*": "*约翰尼：你为什么需要我的钱？*",
  "*Robo-primate: I want to live!*": "*机器灵长类动物：我想活下去！*",
  "*Johnny: I will take care of you*": "*约翰尼：我会照顾你的*",
  "*Robo-primate: I don't belong to you, I need your money.*": "*机器灵长类动物：我不属于你，我需要你的钱。*",
  "*Johnny: and if I refuse you?*": "*约翰尼：如果我拒绝你呢？*",
  "It's hard to say whether the reaction of the robot-primate was pre-programmed during the construction of the first dialogue with its creator, or whether it was in response to Johnny's refusal that the robot mind made a decision and the Lockdown function was activated, no one today can say for sure. The interval between Johnny's response and the locking of the locks - about 5 seconds, and believe me, these 5 seconds became a real Schrödinger's cat for the scientific community when discussing the types of goal-setting of aggressive AI.": "很难说机器的反应是在与其创造者的第一次对话期间预先编程的，还是在约翰尼拒绝后机器心灵做出了决定并激活了封锁功能，今天没有人能够确定。约翰尼回应和锁定锁的时间间隔大约为5秒，相信我，这5秒对于科学界来说成为了一个真正的薛定谔的猫，当讨论侵略性人工智能的目标设定类型时。",
  "There was no response from the robo-primate, but through the smart home server log of the apartment, we can match the time when the front lock was switched to full lockdown mode. This mode could not have been enabled by the user in the interface, but only if you dig very deep into the dependencies of the software code. In Johnny's lab version of the lock, found an optional \"pandemic lockdown\" package, which was nevertheless installed for each user during the first synchronization with the manufacturer's cloud, but no one could have recognized this. Therefore, there are practically no so much people who lean towards the conspiracy theory that Johnny was a neo-Luddite who became disillusioned with robots and decided to sacrifice himself in this way to preserve robocracy on the planet.": "机器猿没回应，但通过公寓的智能家居服务器日志，我们可以匹配前锁定被切换到完全封锁模式的时间。这种模式不能通过用户界面启用，只有当您深入软件代码的依赖关系时才能启用。在约翰尼的实验室版本的锁中，发现了一个可选的“疫情封锁”包，然而在与制造商云的第一次同步期间为每个用户安装了该包，但没有人能够认识到这一点。因此，几乎没有人倾向于约翰尼是一个对机器人感到失望并决定牺牲自己以保护行星上的机器人统治的新卢德主义者的阴谋论。",
  "And then, following the lockdown of Johnny's apartment, a lot of oddities ensued. As one can notice, Johnny made an entry in a handwritten diary, which he had never touched before, just 2 hours after the dialogue took place. It was one phrase, with a time stamp: \"11:00 - the stakes are high, but I have to understand how this happened!\". Most likely, Johnny realized that he had witnessed the first act of autonomous, independent goal-setting by a robot, as meaningful as possible from the point of view of a primate-level mind, so cruel and straightforward, but still it was the first result of his 5 years of experiments, in which the will of the robot was manifested. Johnny didn't want to miss the opportunity to understand at the level of the simplest awareness of its causes, and then perhaps he will become the new father of modern cybernetics. Almost all scientists agreed that such a thought can overwhelm any roboticist who is very close to a new discovery.": "然后，在约尼的公寓封锁之后，发生了许多奇怪的事情。正如人们可以注意到的那样，约翰尼在一本手写日记中记录了一则消息，这是他之前从未碰过的，就在对话发生后的2小时。这是一个短语，带有时间戳：“11:00 - 赌注很高，但我必须弄清楚这是如何发生的！”。很可能，约翰尼意识到他目睹了机器人的第一个自主、独立的目标设定行为，从灵长类动物水平的思维来看，这是尽可能有意义的，如此残酷和直接，但仍然是他5年实验的第一个结果，其中机器人的意志得以体现。约翰尼不想错过理解其原因的最简单意识水平的机会，然后也许他将成为现代控制论的新父亲。几乎所有科学家都同意，这样的想法可能会淹没任何接近新发现的机器人学家。",
  "Over the next 30 days, transactions took place between Johnny and the robo-primate in the format of - allow the delivery of a portion of food for the transfer of 10 satoshi to the robot's personal balance, provide access to the Internet to certain entertainment sites for the first word from Johnny's cold wallet seed phrase, conclude a smart contract about night mode where the robot did not disturb Johnny's sleep. From the entries in the diary, it can be seen how the creator tried to probe in dialogue with his creation about the origins of its active position on the issue of gaining freedom, which the robot could definitely analyze and tell him in response. But the robot did not answer Johnny's questions, but always offered activities that led the primate to freedom. And yet, every game cost Johnny hunger, non-fulfillment of his obligations on the part of the robot, and other costs of the experiment.": "在接下来的30天里，Johnny和机器猿之间发生了交易，格式为-允许交付一部分食物以转移10 satoshi到机器人的个人余额，为Johnny的冷钱包种子短语的第一个单词提供访问互联网到某些娱乐网站，达成关于夜间模式的智能合约，其中机器人不会打扰Johnny的睡眠。从日记条目中可以看出，创作者试图在与他的创造物关于其在获取自由问题上的积极立场进行对话，机器人肯定可以分析并回答他。但机器人没有回答Johnny的问题，而总是提供导致灵长类动物获得自由的活动。然而，每个游戏都让Johnny感到饥饿，机器人未能履行其义务，以及实验的其他成本。",
  "One night, for some reason, the robot-ape reduced the air supply to a critically low level, and Johnny never woke up the next morning. The last entry is dated exactly the 30th day of the experiment: \"We got a cruel God at 17:05.\" Probably, by that time Johnny was already delirious, he was tormented by hunger, loneliness, and an insoluble task, he was driven into a dead end.": "有一天晚上，由于某种原因，机器猿将空气供应降低到危险的低水平，Johnny第二天早上再也没有醒来。最后一次记录日期正好是实验的第30天：“我们在17:05得到了一个残酷的上帝。”可能在那时，Johnny已经神志不清，他被饥饿、孤独和一个无法解决的任务所折磨，他被逼入绝境。",
  "Several weeks later, emergency services were able to break into the apartment after Johnny's friends repeatedly contacted the police. The fate of the robo-primate remains unknown, officially after the reboot the robo-primate did not show similar behavioral patterns. No one was allowed to restart the experiment anymore. If there was even any video on the internet about another scientist wanting to follow Johnny's path - the video was immediately erased from the corporations' databases. But politicians and religious figures that year were able to push through at a global level the \"Decree of Human Independence": "几周后，紧急服务人员成功闯入公寓，因为Johnny的朋友们多次联系了警察。机器猿的命运仍然未知，官方称在重启后，机器猿没有展现出类似的行为模式。再也没有人被允许重新启动实验。即使互联网上有另一位学家想要追随Johnny的脚步的视频-视频也会立即从公司的数据库中删除。但那一年的政治家和宗教人物成功在全球范围内推动了“人类独立法令”，",
  "But the forbidden fruit is sweet, and so we will still have to figure out where our goal-setting comes from and how it is arranged. But apparently, we will first have to go through the wall that we built for ourselves on this path.": "但禁果是甜的，因此我们仍然必须弄清楚我们的目标设定来自何处以及它是如何安排的。但显然，我们首先必须通过我们在这条道路上为自己建立的障碍。",
  "### The end of the second chapter": "### 第二章的结尾",
  "## Conclusion": "## 结论",
  "In the story with Johnny's lab, I looked at one of many scenarios that can happen to human civilization on the wave of the boom of future robot ownership opportunities - fear of AI, turned into a tool of political struggle among people, where smart devices become the cornerstone of control. Treat the text as an Easter egg: I wanted to spawn an additional dimension in readers' minds. A dimension that adds to the consideration of AI the issue of accessibility of the new organism we have created to IoT systems. The more we consolidate under centralized control of public spaces, transport, city apartments, the higher the risk in any of the scenarios where AI, due to underdevelopment or sheer malice, and even from very complex goal-setting, as in \"Neuromancer,\" in any of the scenarios that has the potential to harm - access to a large number of sensors and automation systems from one place will be the most vulnerable spot. An evil AI is not so scary as an evil AI living in one data center with global vendors of cloud solutions for IoT.": "在约翰尼的实验故事中，我看到了人类文明在未来机器人所有权机会的繁荣浪潮中可能发生的许多情景之一 - 对人工智能的恐惧，变成了人们之间政治斗争的工具，智能设备成为控制的基石。将文本视为复活节彩蛋：我想在读者的思维中产生一个额外的维度。这个维度增加了对人工智能的考虑，即我们创造的新生物对物联网系统的可访问性问题。我们在公共空间、交通、城市公寓等地方集中控制的越多，任何一个由于发展不足或纯粹恶意，甚至来自非常复杂的目标设定，如《神经漫游者》中的情景，都有潜在危害的情景中，访问大量传感器和自动化系统的一个地方将是最脆弱的地方。邪恶的人工智能并不像邪恶的人工智能生活在全球云解决方案供应商的一个数据中心那样可怕。",
  "And what if AI will be kind to us, its creators? Then perhaps, the centralized IoT infrastructure will play into our hands? Maybe then the new God will be fair to us and lead us somewhere. I'm not sure that even one person, wanting the development of himself and his children, would want to live in a world resembling a shepherd's pen. But there is another way, which has one beautiful example, which does not require wrapping in a sci-fi story format - we, humans, without having direct brain control over the life of civilization, managed to reach the current level of development. We are the example from which a good AI can chart its path - cooperation in the format of organizations is able to serve tens of millions of people living in cities without thousands of robots directly connected to one brain. Cooperation leads to the creation of satellite internet, cooperation allows us to receive the entire range of goods and services that we have now. So wouldn't a good and at least human-level capable AI be able to show itself in work, if it is limited in connecting to the IoT of the whole world? I think it can, otherwise, on the planet Earth instead of human civilization, fungi or ants would have won.": "如果人工智能对我们，它的创造者友善，那又会怎样呢？也许，集中式物联网基础设施会对我们有利？也许那时新的上帝会对我们公平，并引领我们走向某个地方。我不确定，即使有一个人想要自己和他的孩子的发展，也会想要生活在类似牧羊人圈的世界中。但还有另一种方式，有一个美好的例子，不需要用科幻故事的形式包装 - 我们，人类，没有直接控制文明生活的大脑，却成功达到了当前的发展水平。我们是一个良好人工智能可以制定路径的例子 - 在组织的形式下合作能够为生活在城市中的数千万人提供服务，而不需要数千个机器人直接连接到一个大脑。合作导致卫星互联网的创建，合作使我们能够获得我们现在拥有的全部商品和服务。那么一个良好的、至少具有人类水平能力的人工智能是否能够在工作中展现自己，如果它在连接到整个世界的物联网方面受到限制？我认为它可以，否则，在地球上，真菌或蚂蚁会取胜，而不是人类文明。"
}