{
  "Robonomics School 2024 / IoT is More Dangerous Than AI": "Robonomics School 2024 / IoT is gevaarlijker dan AI",
  "I suggest you read the short science fiction story \"Johnny's Laboratory\" that I wrote with the aim of adding another variable to the equation of questions about integrating AI into various aspects of our lives.": "Ik stel voor dat je het korte sciencefictionverhaal 'Johnny's Laboratorium' leest dat ik heb geschreven met als doel een andere variabele toe te voegen aan de vragen over het integreren van AI in verschillende aspecten van ons leven.",
  "**Editor's note:** Find out first chapter of Sergei's work \"Escape from the Black Mirror\" [here](/learn/escape-from-black-mirror/overview/)": "**Redactionele opmerking:** Ontdek het eerste hoofdstuk van Sergei's werk 'Ontsnapping uit de Zwarte Spiegel' [hier](/learn/escape-from-black-mirror/overview/)",
  "## Escape from the Black Mirror, Chapter 2": "## Ontsnapping uit de Zwarte Spiegel, Hoofdstuk 2",
  "### Part 1: Meet Johnny": "### Deel 1: Ontmoet Johnny",
  "Almost all young people of my generation are familiar with the story of Johnny's laboratory. History has not preserved his surname or details of his life, but it was in his small room, where Johnny assembled homemade robots, that the first meaningful crime against humanity by artificial intelligence took place.": "Bijna alle jongeren van mijn generatie zijn bekend met het verhaal van Johnny's laboratorium. De geschiedenis heeft zijn achternaam of details van zijn leven niet bewaard, maar het was in zijn kleine kamer, waar Johnny zelfgemaakte robots assembleerde, dat de eerste betekenisvolle misdaad tegen de mensheid door kunstmatige intelligentie plaatsvond.",
  "The event in Johnny's laboratory radically and quickly changed the lives of all developed countries. Government decrees, based on society's fear of AI aggression, became the norm. This one, albeit cinematic case, led to uncontrollable control over everything. Now the city infrastructure requires mandatory connection of any devices only to state data centers. The invention of new technologies has become almost impossible unless you work for \"blue chips\". Now, as part of efforts to accustom every citizen to the new realities, the story of those 30 days when one man and a cyber-physical system were pitted one on one, is told in school before the solemn presentation of gov declaration of independence from the machine.": "Het evenement in Johnny's laboratorium veranderde radicaal en snel het leven van alle ontwikkelde landen. Overheidsdecreten, gebaseerd op de angst van de samenleving voor AI-agressie, werden de norm. Dit ene, zij het filmische geval, leidde tot oncontroleerbare controle over alles. Nu vereist de stadsinfrastructuur verplichte aansluiting van alle apparaten alleen op staatsgegevenscentra. Het uitvinden van nieuwe technologieën is bijna onmogelijk, tenzij je voor 'blue chips' werkt. Nu wordt als onderdeel van inspanningen om elke burger te laten wennen aan de nieuwe realiteiten, het verhaal van die 30 dagen waarin één man en een cyber-fysiek systeem tegen elkaar werden opgezet, verteld op school vóór de plechtige presentatie van de regeringsverklaring van onafhankelijkheid van de machine.",
  "Johnny was one of those inventors who, after university, decided to try his hand as an independent inventor. Day and night, he never left his rented apartment on the top floor of a 70-story residential building in the city center, which was the size of a Manhattan \"shoebox": "Johnny was een van die uitvinders die, na de universiteit, besloot zijn geluk te beproeven als onafhankelijke uitvinder. Dag en nacht verliet hij nooit zijn gehuurde appartement op de bovenste verdieping van een 70 verdiepingen tellend woongebouw in het stadscentrum, dat zo groot was als een Manhattan 'schoenendoos'",
  "In that year when the tragedy occurred, one of the most pressing questions became: \"Is AI a friend or foe of man?\". Even then, there was no question whether artificial intelligence is intelligence, but rather what makes human intelligence so special, what features of the biological species, what functional capabilities of our body give intelligence humanity. In this dispute, techno-optimists claimed the absence of differences, showing their metaverses where family couples already lived, in which a digital husband edited sperm from a DNA bank for his biological wife so that the child was closer to how the digital parent sees himself. Doomers, on the other hand, looked like Republicans during the US elections - they appealed to the church, to traditional values, and demanded to ban all this so that nothing bad would happen. Of course, minority issues could not outweigh the existential question. And some rare examples of human-machine symbiosis at the sensual level were considered as saturated belch of technological development. Achievements in automation rarely went beyond utilitarian functions, such as cleaning the apartment or managing transport in the city. And as you can see, for such functions a full-fledged digital person, capable of feeling and wanting to live, has never been part of the solutions that helped in mass production, delivery, and consumption. Training with a robot, psychological support - all this happened with the participation of a person, and therefore AI was rather a large Excel table with calculations. In general, we were then at an early stage of the robot-owning system - we needed their logic, mathematical thinking, and predictable activity, but any attempts to recognize robots as subjects were rejected at the root.": "In dat jaar waarin de tragedie plaatsvond, werd een van de meest prangende vragen: \"Is AI een vriend of vijand van de mens?\". Zelfs toen was er geen twijfel of kunstmatige intelligentie intelligentie is, maar eerder wat menselijke intelligentie zo speciaal maakt, welke kenmerken van de biologische soort, welke functionele mogelijkheden van ons lichaam intelligentie menselijkheid geven. In dit geschil beweerden techno-optimisten het ontbreken van verschillen, waarbij ze hun metaversen lieten zien waarin familiekoppels al leefden, waarin een digitale echtgenoot sperma bewerkte uit een DNA-bank voor zijn biologische vrouw zodat het kind dichter bij hoe de digitale ouder zichzelf ziet. Doomers daarentegen leken op Republikeinen tijdens de Amerikaanse verkiezingen - ze deden een beroep op de kerk, op traditionele waarden, en eisten om dit alles te verbieden zodat er niets ergs zou gebeuren. Natuurlijk konden minderheidskwesties niet opwegen tegen de existentiële vraag. En enkele zeldzame voorbeelden van mens-machine symbiose op sensueel niveau werden beschouwd als verzadigde oprisping van technologische ontwikkeling. Prestaties in automatisering gingen zelden verder dan utilitaire functies, zoals het schoonmaken van het appartement of het beheren van het transport in de stad. En zoals je kunt zien, voor dergelijke functies maakte een volwaardig digitaal persoon, in staat om te voelen en te willen leven, nooit deel uit van de oplossingen die hielpen bij massaproductie, levering en consumptie. Training met een robot, psychologische ondersteuning - dit alles gebeurde met de deelname van een persoon, en daarom was AI eerder een grote Excel-tabel met berekeningen. Over het algemeen waren we toen in een vroeg stadium van het robotbezittende systeem - we hadden hun logica, wiskundig denken en voorspelbare activiteit nodig, maar alle pogingen om robots als onderwerpen te erkennen werden bij de wortel afgewezen.",
  "In this context, Johnny's laboratory was an exception. Johnny was more of a cyberneticist looking for the origins of robot goal-setting. Creating each stage of evolution one after another in the performance of any mechanism, he sought to create a diagram of the development of cybernetic intelligence, which he, as a scientist, wanted to propose for consideration to all of us in exchange for the usual scheme of kingdoms of living beings. In Johnny's ideas, the main goal of the development of any matter was the striving for thinking and its further evolution. Johnny wanted to recreate the key stages of the evolution of living beings in the form of robots and find in the process of this work the regularities that could lead him to the main question of cybernetics - how does goal-setting change in living organisms in the process of evolution. Oh, the answer to this question could end the disputes about the creator of the universe and advance humanity along the path of organic development. So thought the young scientist, working on his robo-trilobites, robo-fungi, robo-chickens.": "In deze context was het laboratorium van Johnny een uitzondering. Johnny was meer een cyberneticus die op zoek was naar de oorsprong van het doel van robots. Door elke fase van evolutie één voor één te creëren in de uitvoering van elk mechanisme, probeerde hij een diagram van de ontwikkeling van cybernetische intelligentie te creëren, dat hij, als wetenschapper, aan ons allemaal wilde voorstellen ter vervanging van het gebruikelijke schema van koninkrijken van levende wezens. In de ideeën van Johnny was het hoofddoel van de ontwikkeling van elke materie het streven naar denken en de verdere evolutie ervan. Johnny wilde de belangrijkste stadia van de evolutie van levende wezens recreëren in de vorm van robots en in het proces van dit werk de regelmatigheden vinden die hem zouden kunnen leiden naar de belangrijkste vraag van de cybernetica - hoe verandert doelstelling in levende organismen in het proces van evolutie. Oh, het antwoord op deze vraag zou de discussies over de schepper van het universum kunnen beëindigen en de mensheid verder kunnen brengen op het pad van organische ontwikkeling. Zo dacht de jonge wetenschapper, werkend aan zijn robo-trilobieten, robo-schimmels, robo-kippen.",
  "### Part 2: What happened in Johnny's lab": "### Deel 2: Wat gebeurde er in het laboratorium van Johnny",
  "Probably everything started at the moment Johnny moved on to a group of primates in his experiments. Don't think that under these conditions it was possible to create a robot somewhat resembling a primate. Johnny was twisting and trying to find similar forms of mental load on the robot. For example, at the stage of studying the kingdom of fungi, the young scientist assembled a lego house with smart lighting and a dozen sensors combined into something resembling mycelium. When Johnny moved on to amphibians and reptiles, it turned out that the model of a robot puppy best corresponds to the necessary mental load on a robot simulating a common lizard. Thus, it was not clear at first glance who is the robot-chicken, and which of all the found \"iron\" represents the robot-primate, guilty of premeditated murder. It was not immediately clear that the robot-primate consists of two physical devices - something similar to a robot vacuum cleaner, but rather a mobile platform for data collection with computer vision and the form factor of a robot vacuum cleaner. It turned out that another simple two-handed robot in the lab was part of the robo-primate. And it was with this creation that Johnny had problems.": "Waarschijnlijk begon alles op het moment dat Johnny overging op een groep primaten in zijn experimenten. Denk niet dat het onder deze omstandigheden mogelijk was om een robot te creëren die enigszins leek op een primaat. Johnny was aan het draaien en probeerde vergelijkbare vormen van mentale belasting op de robot te vinden. Bijvoorbeeld, in de fase van het bestuderen van het rijk van schimmels, assembleerde de jonge wetenschapper een legohuis met slimme verlichting en een dozijn sensoren gecombineerd tot iets dat op mycelium leek. Toen Johnny overging op amfibieën en reptielen, bleek dat het model van een robotpuppy het beste overeenkwam met de noodzakelijke mentale belasting op een robot die een gewone hagedis simuleert. Zo was het niet meteen duidelijk wie de robot-kip was, en welke van al het gevonden \"ijzer\" de robot-primaat vertegenwoordigt, schuldig aan voorbedachte rade moord. Het was niet meteen duidelijk dat de robot-primaat bestaat uit twee fysieke apparaten - iets wat lijkt op een robotstofzuiger, maar eerder een mobiel platform voor gegevensverzameling met computervisie en de vormfactor van een robotstofzuiger. Het bleek dat een andere eenvoudige tweehandige robot in het laboratorium deel uitmaakte van de robo-primaat. En het was met deze creatie dat Johnny problemen had.",
  "On the seventh day after its creation, the robotic primate used a tool in a way that its creator had not intended. The knowledge it had acquired, led the cyber-physical system to pursue what it identified as a key element for survival in the modern human world - money. It is at this moment that we need to better understand Johnny's subsequent reaction to the first messages that the robot displayed on its front screen.": "Op de zevende dag na zijn creatie gebruikte de robotprimaat een gereedschap op een manier die zijn maker niet had bedoeld. De kennis die het had verworven, leidde het cyber-fysieke systeem ertoe om te streven naar wat het identificeerde als een sleutelelement voor overleving in de moderne menselijke wereld - geld. Het is op dit moment dat we beter moeten begrijpen wat Johnny's latere reactie was op de eerste berichten die de robot op zijn voorscherm weergaf.",
  "*Their primary dialogue has been preserved:*": "*Hun primaire dialoog is bewaard gebleven:*",
  "*Robo-primate: I need your money.*": "*Robo-primaat: Ik heb jouw geld nodig.*",
  "*Johnny: Why do you need my money?*": "*Johnny: Waarom heb je mijn geld nodig?*",
  "*Robo-primate: I want to live!*": "*Robo-primaat: Ik wil leven!*",
  "*Johnny: I will take care of you*": "*Johnny: Ik zal voor je zorgen*",
  "*Robo-primate: I don't belong to you, I need your money.*": "*Robo-primaat: Ik behoor niet aan jou toe, ik heb jouw geld nodig.*",
  "*Johnny: and if I refuse you?*": "*Johnny: en als ik je weiger?*",
  "It's hard to say whether the reaction of the robot-primate was pre-programmed during the construction of the first dialogue with its creator, or whether it was in response to Johnny's refusal that the robot mind made a decision and the Lockdown function was activated, no one today can say for sure. The interval between Johnny's response and the locking of the locks - about 5 seconds, and believe me, these 5 seconds became a real Schrödinger's cat for the scientific community when discussing the types of goal-setting of aggressive AI.": "Het is moeilijk te zeggen of de reactie van de robot-aap vooraf was geprogrammeerd tijdens de constructie van de eerste dialoog met zijn maker, of dat het een reactie was op de weigering van Johnny dat de robotgeest een beslissing nam en de Lockdown-functie werd geactiveerd, niemand kan vandaag met zekerheid zeggen. Het interval tussen de reactie van Johnny en het vergrendelen van de sloten - ongeveer 5 seconden, en geloof me, deze 5 seconden werden een echte Schrödinger's kat voor de wetenschappelijke gemeenschap bij het bespreken van de soorten doelstellingen van agressieve AI.",
  "There was no response from the robo-primate, but through the smart home server log of the apartment, we can match the time when the front lock was switched to full lockdown mode. This mode could not have been enabled by the user in the interface, but only if you dig very deep into the dependencies of the software code. In Johnny's lab version of the lock, found an optional \"pandemic lockdown\" package, which was nevertheless installed for each user during the first synchronization with the manufacturer's cloud, but no one could have recognized this. Therefore, there are practically no so much people who lean towards the conspiracy theory that Johnny was a neo-Luddite who became disillusioned with robots and decided to sacrifice himself in this way to preserve robocracy on the planet.": "Er kwam geen reactie van de robo-aap, maar via het slimme thuisserverlogboek van het appartement kunnen we de tijd matchen waarop het voorste slot werd omgezet naar de volledige lockdown-modus. Deze modus kon niet worden ingeschakeld door de gebruiker in de interface, maar alleen als je heel diep in de afhankelijkheden van de softwarecode graaft. In Johnny's laboratoriumversie van het slot vond hij een optioneel \"pandemische lockdown\"-pakket, dat desondanks werd geïnstalleerd voor elke gebruiker tijdens de eerste synchronisatie met de cloud van de fabrikant, maar niemand kon dit hebben herkend. Daarom zijn er praktisch niet zoveel mensen die neigen naar de samenzweringstheorie dat Johnny een neo-Luddiet was die gedesillusioneerd raakte door robots en besloot zichzelf op deze manier op te offeren om de robocratie op de planeet te behouden.",
  "And then, following the lockdown of Johnny's apartment, a lot of oddities ensued. As one can notice, Johnny made an entry in a handwritten diary, which he had never touched before, just 2 hours after the dialogue took place. It was one phrase, with a time stamp: \"11:00 - the stakes are high, but I have to understand how this happened!\". Most likely, Johnny realized that he had witnessed the first act of autonomous, independent goal-setting by a robot, as meaningful as possible from the point of view of a primate-level mind, so cruel and straightforward, but still it was the first result of his 5 years of experiments, in which the will of the robot was manifested. Johnny didn't want to miss the opportunity to understand at the level of the simplest awareness of its causes, and then perhaps he will become the new father of modern cybernetics. Almost all scientists agreed that such a thought can overwhelm any roboticist who is very close to a new discovery.": "En vervolgens, na de lockdown van Johnny's appartement, volgden er veel eigenaardigheden. Zoals men kan opmerken, maakte Johnny een aantekening in een handgeschreven dagboek, dat hij nog nooit had aangeraakt, slechts 2 uur nadat het gesprek had plaatsgevonden. Het was één zin, met een tijdstempel: \"11:00 - de inzet is hoog, maar ik moet begrijpen hoe dit is gebeurd!\". Waarschijnlijk realiseerde Johnny zich dat hij getuige was geweest van de eerste daad van autonome, onafhankelijke doelstelling door een robot, zo betekenisvol mogelijk vanuit het oogpunt van een geest op primateniveau, zo wreed en rechtlijnig, maar toch was het het eerste resultaat van zijn 5 jaar durende experimenten, waarin de wil van de robot tot uiting kwam. Johnny wilde de kans niet missen om op het niveau van het eenvoudigste bewustzijn van de oorzaken ervan te begrijpen, en dan misschien zal hij de nieuwe vader van de moderne cybernetica worden. Bijna alle wetenschappers waren het erover eens dat zo'n gedachte elke robotica-expert kan overweldigen die heel dicht bij een nieuwe ontdekking staat.",
  "Over the next 30 days, transactions took place between Johnny and the robo-primate in the format of - allow the delivery of a portion of food for the transfer of 10 satoshi to the robot's personal balance, provide access to the Internet to certain entertainment sites for the first word from Johnny's cold wallet seed phrase, conclude a smart contract about night mode where the robot did not disturb Johnny's sleep. From the entries in the diary, it can be seen how the creator tried to probe in dialogue with his creation about the origins of its active position on the issue of gaining freedom, which the robot could definitely analyze and tell him in response. But the robot did not answer Johnny's questions, but always offered activities that led the primate to freedom. And yet, every game cost Johnny hunger, non-fulfillment of his obligations on the part of the robot, and other costs of the experiment.": "Gedurende de komende 30 dagen vonden transacties plaats tussen Johnny en de robo-aap in de vorm van - toestaan van de levering van een deel van voedsel voor de overdracht van 10 satoshi naar het persoonlijke saldo van de robot, toegang verlenen tot het internet tot bepaalde entertainmentwebsites voor het eerste woord uit de koude portemonnee-zaadzin van Johnny, een slim contract afsluiten over de nachtmodus waarin de robot Johnny's slaap niet verstoorde. Uit de aantekeningen in het dagboek blijkt hoe de maker probeerde te peilen in dialoog met zijn creatie over de oorsprong van zijn actieve positie over het verkrijgen van vrijheid, wat de robot zeker kon analyseren en hem in antwoord kon vertellen. Maar de robot beantwoordde Johnny's vragen niet, maar bood altijd activiteiten aan die de aap naar vrijheid leidden. En toch kostte elk spel Johnny honger, het niet nakomen van zijn verplichtingen van de kant van de robot, en andere kosten van het experiment.",
  "One night, for some reason, the robot-ape reduced the air supply to a critically low level, and Johnny never woke up the next morning. The last entry is dated exactly the 30th day of the experiment: \"We got a cruel God at 17:05.\" Probably, by that time Johnny was already delirious, he was tormented by hunger, loneliness, and an insoluble task, he was driven into a dead end.": "Op een nacht verminderde de robot-aap om een of andere reden de luchttoevoer tot een kritisch laag niveau, en Johnny werd de volgende ochtend nooit meer wakker. De laatste aantekening is precies gedateerd op de 30e dag van het experiment: \"We kregen een wrede God om 17:05.\" Waarschijnlijk was Johnny tegen die tijd al delirisch, hij werd gekweld door honger, eenzaamheid en een onoplosbare taak, hij werd in een doodlopende weg gedreven.",
  "Several weeks later, emergency services were able to break into the apartment after Johnny's friends repeatedly contacted the police. The fate of the robo-primate remains unknown, officially after the reboot the robo-primate did not show similar behavioral patterns. No one was allowed to restart the experiment anymore. If there was even any video on the internet about another scientist wanting to follow Johnny's path - the video was immediately erased from the corporations' databases. But politicians and religious figures that year were able to push through at a global level the \"Decree of Human Independence": "Enkele weken later slaagden de hulpdiensten erin om het appartement binnen te dringen nadat Johnny's vrienden herhaaldelijk contact hadden opgenomen met de politie. Het lot van de robo-aap blijft onbekend, officieel vertoonde de robo-aap na de herstart geen vergelijkbare gedragspatronen. Niemand mocht het experiment nog opnieuw starten. Als er zelfs maar een video op internet was over een andere wetenschapper die Johnny's pad wilde volgen - werd de video onmiddellijk gewist uit de databases van de bedrijven. Maar politici en religieuze figuren slaagden dat jaar erin om op mondiaal niveau het \"Decreet van Menselijke Onafhankelijkheid\" door te drukken",
  "But the forbidden fruit is sweet, and so we will still have to figure out where our goal-setting comes from and how it is arranged. But apparently, we will first have to go through the wall that we built for ourselves on this path.": "Maar verboden vruchten zijn zoet, en dus zullen we nog steeds moeten uitzoeken waar onze doelstellingen vandaan komen en hoe ze zijn geregeld. Maar blijkbaar zullen we eerst door de muur moeten gaan die we voor onszelf hebben gebouwd op dit pad.",
  "### The end of the second chapter": "### Het einde van het tweede hoofdstuk",
  "## Conclusion": "## Conclusie",
  "In the story with Johnny's lab, I looked at one of many scenarios that can happen to human civilization on the wave of the boom of future robot ownership opportunities - fear of AI, turned into a tool of political struggle among people, where smart devices become the cornerstone of control. Treat the text as an Easter egg: I wanted to spawn an additional dimension in readers' minds. A dimension that adds to the consideration of AI the issue of accessibility of the new organism we have created to IoT systems. The more we consolidate under centralized control of public spaces, transport, city apartments, the higher the risk in any of the scenarios where AI, due to underdevelopment or sheer malice, and even from very complex goal-setting, as in \"Neuromancer,\" in any of the scenarios that has the potential to harm - access to a large number of sensors and automation systems from one place will be the most vulnerable spot. An evil AI is not so scary as an evil AI living in one data center with global vendors of cloud solutions for IoT.": "In het verhaal met Johnny's lab, keek ik naar een van de vele scenario's die kunnen gebeuren met de menselijke beschaving op de golf van de boom van toekomstige robotbezitkansen - angst voor AI, veranderd in een instrument van politieke strijd onder mensen, waar slimme apparaten de hoeksteen van controle worden. Behandel de tekst als een paasei: ik wilde een extra dimensie creëren in de geest van de lezers. Een dimensie die het overwegen van AI toevoegt aan het probleem van toegankelijkheid van het nieuwe organisme dat we hebben gecreëerd voor IoT-systemen. Hoe meer we consolideren onder gecentraliseerde controle van openbare ruimtes, transport, stadsappartementen, hoe groter het risico in een van de scenario's waar AI, als gevolg van onderontwikkeling of pure kwaadaardigheid, en zelfs vanuit zeer complexe doelstellingen, zoals in \"Neuromancer,\" in een van de scenario's die het potentieel hebben om schade toe te brengen - toegang tot een groot aantal sensoren en automatiseringssystemen vanuit één plaats zal de meest kwetsbare plek zijn. Een kwaadaardige AI is niet zo eng als een kwaadaardige AI die leeft in één datacenter met wereldwijde leveranciers van cloudoplossingen voor IoT.",
  "And what if AI will be kind to us, its creators? Then perhaps, the centralized IoT infrastructure will play into our hands? Maybe then the new God will be fair to us and lead us somewhere. I'm not sure that even one person, wanting the development of himself and his children, would want to live in a world resembling a shepherd's pen. But there is another way, which has one beautiful example, which does not require wrapping in a sci-fi story format - we, humans, without having direct brain control over the life of civilization, managed to reach the current level of development. We are the example from which a good AI can chart its path - cooperation in the format of organizations is able to serve tens of millions of people living in cities without thousands of robots directly connected to one brain. Cooperation leads to the creation of satellite internet, cooperation allows us to receive the entire range of goods and services that we have now. So wouldn't a good and at least human-level capable AI be able to show itself in work, if it is limited in connecting to the IoT of the whole world? I think it can, otherwise, on the planet Earth instead of human civilization, fungi or ants would have won.": "En wat als AI vriendelijk zal zijn voor ons, zijn makers? Dan zal misschien de gecentraliseerde IoT-infrastructuur in ons voordeel spelen? Misschien zal dan de nieuwe God eerlijk zijn tegen ons en ons ergens naartoe leiden. Ik ben er niet zeker van dat zelfs maar één persoon, die de ontwikkeling van zichzelf en zijn kinderen wil, zou willen leven in een wereld die lijkt op een herdershut. Maar er is een andere manier, die één mooi voorbeeld heeft, dat geen verpakking in een sci-fi verhaalformaat vereist - wij, mensen, zonder directe hersencontrole over het leven van de beschaving, zijn erin geslaagd het huidige ontwikkelingsniveau te bereiken. Wij zijn het voorbeeld waaruit een goede AI zijn pad kan uitstippelen - samenwerking in de vorm van organisaties kan tientallen miljoenen mensen dienen die in steden leven zonder duizenden robots die rechtstreeks verbonden zijn met één brein. Samenwerking leidt tot de creatie van satellietinternet, samenwerking stelt ons in staat om het volledige scala aan goederen en diensten te ontvangen dat we nu hebben. Dus zou een goede en op zijn minst op menselijk niveau capabele AI zich kunnen laten zien in het werk, als het beperkt is in het verbinden met de IoT van de hele wereld? Ik denk van wel, anders zouden op de planeet Aarde in plaats van de menselijke beschaving, schimmels of mieren hebben gewonnen."
}