{
  "\"Robonomics School 2024 / Cyprus Relocant Manual: Smart Home\"": "\"Robonomics School 2024 / Manuel de relocalisation à Chypre : Maison intelligente\"",
  "Cyprus Relocant Manual: Smart Home": "Manuel de relocalisation à Chypre : Maison intelligente",
  "[Learn, \"Robonomics School 2024 / Cyprus Relocant Manual: Smart Home\"]": "[Apprendre, \"Robonomics School 2024 / Manuel de relocalisation à Chypre : Maison intelligente\"]",
  "Changing your country of residence always brings not only new opportunities, but also challenges. It so happened that in my case, the new country was Cyprus, where I came to build a company. For the last 10 years before moving, I lived in a big city, where I get used to certain benefits in the form of central heating from the city, hot water supply, and cheap electricity. In Cyprus, each house and each apartment is much more autonomous in terms of life support, but concerns about maintaining a comfortable life fall on the owner. Take hot water, for example. In the cold months, you have to turn on the boiler yourself to heat it up. The apartment also needs to be heated by yourself. In winter we turn on/off the thermal blanket and boiler, and in summer the air conditioner and mosquito repellent. This requires not only time and energy, but also money.": "Changer de pays de résidence apporte toujours non seulement de nouvelles opportunités, mais aussi des défis. Il se trouve que dans mon cas, le nouveau pays était Chypre, où je suis venu pour construire une entreprise. Au cours des 10 dernières années avant de déménager, j'ai vécu dans une grande ville, où j'avais l'habitude de certains avantages sous forme de chauffage central de la ville, d'approvisionnement en eau chaude et d'électricité bon marché. À Chypre, chaque maison et chaque appartement sont beaucoup plus autonomes en termes de support de vie, mais les préoccupations concernant le maintien d'une vie confortable incombent au propriétaire. Prenez l'eau chaude, par exemple. Pendant les mois froids, vous devez allumer le chauffe-eau vous-même pour le chauffer. L'appartement doit également être chauffé par vous-même. En hiver, nous allumons/éteignons la couverture thermique et le chauffe-eau, et en été, le climatiseur et le répulsif contre les moustiques. Cela nécessite non seulement du temps et de l'énergie, mais aussi de l'argent.",
  "My first winter in Cyprus resulted in astronomical electricity bills. This was a serious blow to my budget. One possible solution: change your habits and adapt to new conditions. But after moving, you will already have enough worries. As an engineer, I started looking for solutions that would help me control costs and make my life more comfortable, and I want to share my experience with you.": "Mon premier hiver à Chypre s'est soldé par des factures d'électricité astronomiques. Cela a été un sérieux coup pour mon budget. Une solution possible : changer vos habitudes et vous adapter aux nouvelles conditions. Mais après le déménagement, vous aurez déjà assez de soucis. En tant qu'ingénieur, j'ai commencé à chercher des solutions qui m'aideraient à contrôler les coûts et à rendre ma vie plus confortable, et je veux partager mon expérience avec vous.",
  "## Hardware Choosing": "## Choix du matériel",
  "The first thing I want to start with is choosing an ecosystem. Wired systems are immediately eliminated, as they require large budgets and serious intervention in the infrastructure of the apartment/house. Of the wireless devices, there are a huge number of devices under the Sonoff and Tyua brands, but they all work via the Internet, which does not always work reliably on the island. This is not to mention the issue of privacy and safety of your personal data on other company’s servers. I recommend building your smart home with [Home Assistant](https://www.home-assistant.io) as a main home server. Pros: can work without access to the external Internet; it is possible to take it with you when moving and deploy it in a new place without losing the settings; supports a huge number of devices, including smart TVs, vacuum cleaners, and much more.": "La première chose avec laquelle je veux commencer est le choix d'un écosystème. Les systèmes câblés sont immédiatement éliminés, car ils nécessitent des budgets importants et une intervention sérieuse dans l'infrastructure de l'appartement/maison. Parmi les appareils sans fil, il existe un grand nombre d'appareils des marques Sonoff et Tyua, mais ils fonctionnent tous via Internet, ce qui ne fonctionne pas toujours de manière fiable sur l'île. Sans parler de la question de la confidentialité et de la sécurité de vos données personnelles sur les serveurs d'autres entreprises. Je recommande de construire votre maison intelligente avec [Home Assistant](https://www.home-assistant.io) comme serveur domestique principal. Avantages : peut fonctionner sans accès à Internet externe ; il est possible de l'emporter avec vous lors d'un déménagement et de le déployer dans un nouvel endroit sans perdre les paramètres ; prend en charge un grand nombre d'appareils, y compris les téléviseurs intelligents, les aspirateurs, et bien plus encore.",
  "The most popular protocols for wireless connection of devices are Wi-Fi, Zigbee, Bluetooth. In one apartment, all three types of connections can be found at once, but as for devices that make smart things out of ordinary things, it is more convenient to work with the Zigbee protocol. In this case, we do not need to worry about their addresses and coverage area, plus they can be battery operated. Wi-Fi devices require a constant connection to power and are dependent on the strength of the Wi-Fi signal. Even in a small apartment, where there are a couple of walls between the router and your bedroom, sometimes you have to install a Wi-Fi Extender. In the case of Zigbee, the devices themselves act as repeaters.": "Les protocoles les plus populaires pour la connexion sans fil des appareils sont le Wi-Fi, le Zigbee, le Bluetooth. Dans un appartement, les trois types de connexions peuvent être trouvés en même temps, mais en ce qui concerne les appareils qui transforment des choses ordinaires en choses intelligentes, il est plus pratique de travailler avec le protocole Zigbee. Dans ce cas, nous n'avons pas besoin de nous soucier de leurs adresses et de leur zone de couverture, en plus ils peuvent fonctionner sur batterie. Les appareils Wi-Fi nécessitent une connexion constante à l'alimentation et dépendent de la force du signal Wi-Fi. Même dans un petit appartement, où il y a quelques murs entre le routeur et votre chambre à coucher, parfois vous devez installer un répéteur Wi-Fi. Dans le cas du Zigbee, les appareils eux-mêmes agissent comme des répéteurs.",
  "Returning to Cyprus, my required minimum of devices turned out to be as follows:": "En revenant à Chypre, mon minimum requis de dispositifs s'est avéré être le suivant:",
  "## Computer - Home Server": "## Ordinateur - Serveur domestique",
  "The ultimate task for the server is to serve a smart home controlled by Home Assistant. The easiest way is to take the already preconfigured [Home Assistant Green](https://www.home-assistant.io/green/). Cost [€70 excluding tax](https://thepihut.com/products/home-assistant-green).": "La tâche ultime du serveur est de servir une maison intelligente contrôlée par Home Assistant. Le moyen le plus simple est de prendre le [Home Assistant Green](https://www.home-assistant.io/green/) déjà préconfiguré. Coût [70 € hors taxes](https://thepihut.com/products/home-assistant-green).",
  "The option is a little more advanced, but you can even have control over the operating system, this is to find/buy [Raspberry Pi](https://www.raspberrypi.com). Cost [€90 excluding tax](https://https://thepihut.com/products/raspberry-pi-5-starter-kit). The [Installation](https://www.home-assistant.io/installation/) page has many options to suit all tastes.": "L'option est un peu plus avancée, mais vous pouvez même avoir le contrôle sur le système d'exploitation, il suffit de trouver/acheter un [Raspberry Pi](https://www.raspberrypi.com). Coût [90 € hors taxes](https://https://thepihut.com/products/raspberry-pi-5-starter-kit). La page [Installation](https://www.home-assistant.io/installation/) propose de nombreuses options pour tous les goûts.",
  "As a Zigbee Coordinator we take [Sonoff Zigbee Dongle P or E](https://sonoff.tech/product/gateway-and-sensors/sonoff-zigbee-3-0-usb-dongle-plus-p/), they are practically always available on the island. Cost about [€35](https://www.amazon.de/-/en/dp/B09KXTCMSC/). You can also choose a stick from [this list](https://www.zigbee2mqtt.io/guide/adapters/).": "En tant que Coordinateur Zigbee, nous prenons le [Sonoff Zigbee Dongle P ou E](https://sonoff.tech/product/gateway-and-sensors/sonoff-zigbee-3-0-usb-dongle-plus-p/), ils sont pratiquement toujours disponibles sur l'île. Coût environ [35 €](https://www.amazon.de/-/en/dp/B09KXTCMSC/). Vous pouvez également choisir un stick dans [cette liste](https://www.zigbee2mqtt.io/guide/adapters/).",
  "I highly recommend assigning a static local IP address for your home server. If it is not possible to get into the router settings, then you can additionally install a second router (I have [MikroTik](https://mikrotik.com/product/hap_ax2), approximately [€80](https://www.mstronics.com/c/337_1345_485/networking-devices-routers.html?filter_id=154)), and configure the Internet on it. And in general, it is better for all smart Wi-Fi devices to assign a static IP. This is often important for Home Assistant integrations to work properly.": "Je recommande vivement d'attribuer une adresse IP locale statique à votre serveur domestique. Si vous ne pouvez pas accéder aux paramètres du routeur, vous pouvez également installer un deuxième routeur (j'ai un [MikroTik](https://mikrotik.com/product/hap_ax2), environ [80 €](https://www.mstronics.com/c/337_1345_485/networking-devices-routers.html?filter_id=154)), et configurer Internet dessus. Et en général, il est préférable d'attribuer une IP statique à tous les appareils Wi-Fi intelligents. C'est souvent important pour que les intégrations de Home Assistant fonctionnent correctement.",
  "## Boiler Switch": "## Commutateur de chaudière",
  "The boiler consumes 3-3.5 kWh and a regular smart switch will not work. When choosing, be sure to pay attention to the permissible current; it should be at least 16A, and preferably 20A. It’s difficult to quickly find a Zigbee switch on the island itself, I ordered from [China](https://vi.aliexpress.com/item/1005006833309900.html), it cost about €20.": "La chaudière consomme 3-3,5 kWh et un commutateur intelligent ordinaire ne fonctionnera pas. Lors du choix, veillez à prêter attention au courant admissible ; il doit être d'au moins 16A, et de préférence 20A. Il est difficile de trouver rapidement un commutateur Zigbee sur l'île elle-même, j'ai commandé depuis [Chine](https://vi.aliexpress.com/item/1005006833309900.html), cela a coûté environ 20 €.",
  "The first and most important automation is to turn off the button N minutes after any activation. We set it up and no longer think about whether you forgot to turn off the button or whether it has been working for the third day. An example of automation for Home Assistant, you need to replace it with your `device_id` and `entity_id`:": "La première et la plus importante automatisation consiste à éteindre le bouton N minutes après toute activation. Nous le configurons et ne pensons plus à savoir si vous avez oublié d'éteindre le bouton ou s'il fonctionne depuis le troisième jour. Un exemple d'automatisation pour Home Assistant, vous devez le remplacer par votre `device_id` et `entity_id` :",
  "You can change the time throughout the year. For example, in February I need to heat the water for an hour, and in April 30 minutes is enough. Something useful is to add sending a notification to your phone when the water is heated.": "Vous pouvez changer l'heure tout au long de l'année. Par exemple, en février, j'ai besoin de chauffer l'eau pendant une heure, et en avril, 30 minutes suffisent. Il est utile d'ajouter l'envoi d'une notification sur votre téléphone lorsque l'eau est chauffée.",
  "## IR Remote Controls for Air Conditioners and TV": "## Télécommandes IR pour climatiseurs et téléviseurs",
  "Remote controls come with Wi-Fi connection (require constant power) and Zigbee connection (battery operated).": "Les télécommandes sont livrées avec une connexion Wi-Fi (nécessitent une alimentation constante) et une connexion Zigbee (fonctionnent sur batterie).",
  "The Wi-Fi option I tried was from the manufacturer [Broadlink](https://www.ibroadlink.com/productinfo/762674.html), bought on [Amazon](https://www.amazon.de/-/en/dp/B07ZSG9Y67/), about €30. For the initial setup, you will have to install their application on your phone and create an account, but after that the IR remote control will work on the local network, connecting to HA is done using [integration](https://www.home-assistant.io/integrations/broadlink/). To further customize the remote control to suit your needs, I recommend looking at the [SmartIR](https://github.com/smartHomeHub/SmartIR) repository - this is a large library of ready-made commands for different air conditioners and TVs.": "L'option Wi-Fi que j'ai essayée était du fabricant [Broadlink](https://www.ibroadlink.com/productinfo/762674.html), achetée sur [Amazon](https://www.amazon.de/-/en/dp/B07ZSG9Y67/), environ 30 €. Pour la configuration initiale, vous devrez installer leur application sur votre téléphone et créer un compte, mais après cela, la télécommande IR fonctionnera sur le réseau local, la connexion à HA se fait en utilisant [l'intégration](https://www.home-assistant.io/integrations/broadlink/). Pour personnaliser davantage la télécommande pour répondre à vos besoins, je recommande de consulter le référentiel [SmartIR](https://github.com/smartHomeHub/SmartIR) - il s'agit d'une grande bibliothèque de commandes prêtes à l'emploi pour différents climatiseurs et téléviseurs.",
  "Tip": "Conseil",
  "If your specific A/C model is not found, try other models from the same manufacturer. The commands will probably be the same and you will be able to connect your A/C.": "Si votre modèle de climatiseur spécifique n'est pas trouvé, essayez d'autres modèles du même fabricant. Les commandes seront probablement les mêmes et vous pourrez connecter votre climatiseur.",
  "Remote controls running on Zigbee do not require a constant connection to power, but run on batteries. On the one hand, this is a plus, because you can place the device in any convenient place in the room. On the other hand, the batteries will need to be changed as needed. The setup process for such remote controls may also differ from Broadlink. If you can’t use the SmartIR library, the remote control will need to be trained for each command separately and saved in the Home Assistant configuration.": "Les télécommandes fonctionnant sur Zigbee n'ont pas besoin d'une connexion constante à l'alimentation, mais fonctionnent sur des piles. D'une part, c'est un avantage, car vous pouvez placer l'appareil à n'importe quel endroit pratique dans la pièce. D'autre part, les piles devront être changées au besoin. Le processus de configuration de telles télécommandes peut également différer de Broadlink. Si vous ne pouvez pas utiliser la bibliothèque SmartIR, la télécommande devra être entraînée pour chaque commande séparément et enregistrée dans la configuration de Home Assistant.",
  "Programmable remote controls are very easy to install and configure; they do not require wall mounting or connection to an air conditioner bus. However, there is a slight limitation due to the lack of feedback between devices. We cannot verify that the A/C has turned on and is executing exactly the command that we sent. However, we do it quickly and without damage to the apartment. To give a little more information to the remote control, you can install any Zigbee temperature and humidity sensor, for example [this one](https://vi.aliexpress.com/item/1005005595631552.html) for €10, and link the readings to the remote control. This way we have simple feedback, and the number of interesting scenarios increases.": "Les télécommandes programmables sont très faciles à installer et à configurer; elles ne nécessitent pas de montage mural ni de connexion à un bus de climatisation. Cependant, il y a une légère limitation due au manque de retour d'information entre les appareils. Nous ne pouvons pas vérifier que la climatisation s'est allumée et exécute exactement la commande que nous avons envoyée. Cependant, nous le faisons rapidement et sans endommager l'appartement. Pour donner un peu plus d'informations à la télécommande, vous pouvez installer n'importe quel capteur de température et d'humidité Zigbee, par exemple [celui-ci](https://vi.aliexpress.com/item/1005005595631552.html) pour 10 €, et lier les lectures à la télécommande. De cette façon, nous avons un retour d'information simple, et le nombre de scénarios intéressants augmente.",
  "## Energy Meter": "## Compteur d'énergie",
  "There are semi-invasive meters for electricity consumption, such as the one in the image below:": "Il existe des compteurs semi-invasifs pour la consommation d'électricité, comme celui de l'image ci-dessous:",
  "They must be powered by applying L and N to the input. On the other side, an induction ring is connected to the meter, which we hang on a phase or consumption line for measurement. Most houses and apartments have 3 phases, which means you need to install 3 such modules. I bought it on [Amazon](https://www.amazon.de/gp/product/B0C37DJXVD/) for €60, one for each phase. Older homes may only have one phase.": "Ils doivent être alimentés en appliquant L et N à l'entrée. De l'autre côté, un anneau d'induction est connecté au compteur, que nous accrochons à une ligne de phase ou de consommation pour la mesure. La plupart des maisons et des appartements ont 3 phases, ce qui signifie que vous devez installer 3 de ces modules. Je l'ai acheté sur [Amazon](https://www.amazon.de/gp/product/B0C37DJXVD/) pour 60 €, un pour chaque phase. Les maisons plus anciennes peuvent n'avoir qu'une seule phase.",
  "## Conclusion": "## Conclusion",
  "For me, a smart home is not a luxury, but a necessity. This is a place where I want to relax and spend time with my family, without wasting energy on solving everyday issues. The cost of the above kit in my case was about €500 and a couple of evenings. The result is invaluable!": "Pour moi, une maison intelligente n'est pas un luxe, mais une nécessité. C'est un endroit où je veux me détendre et passer du temps avec ma famille, sans gaspiller d'énergie à résoudre des problèmes quotidiens. Le coût du kit ci-dessus dans mon cas était d'environ 500 € et quelques soirées. Le résultat est inestimable!"
}