{
  "\"Robonomics School 2024 / Cyprus Relocant Manual: Smart Home\"": "\"Robonomics Schule 2024 / Zypern Relocant Handbuch: Smart Home\"",
  "Cyprus Relocant Manual: Smart Home": "Zypern Relocant Handbuch: Smart Home",
  "[Learn, \"Robonomics School 2024 / Cyprus Relocant Manual: Smart Home\"]": "[Lernen, \"Robonomics Schule 2024 / Zypern Relocant Handbuch: Smart Home\"]",
  "Changing your country of residence always brings not only new opportunities, but also challenges. It so happened that in my case, the new country was Cyprus, where I came to build a company. For the last 10 years before moving, I lived in a big city, where I get used to certain benefits in the form of central heating from the city, hot water supply, and cheap electricity. In Cyprus, each house and each apartment is much more autonomous in terms of life support, but concerns about maintaining a comfortable life fall on the owner. Take hot water, for example. In the cold months, you have to turn on the boiler yourself to heat it up. The apartment also needs to be heated by yourself. In winter we turn on/off the thermal blanket and boiler, and in summer the air conditioner and mosquito repellent. This requires not only time and energy, but also money.": "Ein Land zu wechseln bringt immer nicht nur neue Möglichkeiten, sondern auch Herausforderungen mit sich. In meinem Fall war das neue Land Zypern, wo ich herkam, um ein Unternehmen aufzubauen. In den letzten 10 Jahren vor meinem Umzug lebte ich in einer großen Stadt, wo ich mich an bestimmte Vorteile wie Zentralheizung, Warmwasserversorgung und günstigen Strom gewöhnt hatte. In Zypern ist jedes Haus und jede Wohnung in Bezug auf die Lebensunterstützung viel autonomer, aber die Sorge um ein komfortables Leben liegt beim Besitzer. Nehmen wir zum Beispiel warmes Wasser. In den kalten Monaten müssen Sie den Boiler selbst einschalten, um es zu erwärmen. Die Wohnung muss auch von Ihnen beheizt werden. Im Winter schalten wir die Wärmedecke und den Boiler ein/aus, und im Sommer die Klimaanlage und das Mückenschutzmittel. Dies erfordert nicht nur Zeit und Energie, sondern auch Geld.",
  "My first winter in Cyprus resulted in astronomical electricity bills. This was a serious blow to my budget. One possible solution: change your habits and adapt to new conditions. But after moving, you will already have enough worries. As an engineer, I started looking for solutions that would help me control costs and make my life more comfortable, and I want to share my experience with you.": "Mein erster Winter in Zypern führte zu astronomischen Stromrechnungen. Das war ein schwerer Schlag für mein Budget. Eine mögliche Lösung: Ändern Sie Ihre Gewohnheiten und passen Sie sich an neue Bedingungen an. Aber nach dem Umzug haben Sie bereits genug Sorgen. Als Ingenieur begann ich nach Lösungen zu suchen, die mir helfen würden, die Kosten zu kontrollieren und mein Leben komfortabler zu gestalten, und ich möchte meine Erfahrungen mit Ihnen teilen.",
  "## Hardware Choosing": "## Hardwareauswahl",
  "The first thing I want to start with is choosing an ecosystem. Wired systems are immediately eliminated, as they require large budgets and serious intervention in the infrastructure of the apartment/house. Of the wireless devices, there are a huge number of devices under the Sonoff and Tyua brands, but they all work via the Internet, which does not always work reliably on the island. This is not to mention the issue of privacy and safety of your personal data on other company’s servers. I recommend building your smart home with [Home Assistant](https://www.home-assistant.io) as a main home server. Pros: can work without access to the external Internet; it is possible to take it with you when moving and deploy it in a new place without losing the settings; supports a huge number of devices, including smart TVs, vacuum cleaners, and much more.": "Das erste, worüber ich sprechen möchte, ist die Auswahl eines Ökosystems. Verdrahtete Systeme werden sofort ausgeschlossen, da sie hohe Budgets und ernsthafte Eingriffe in die Infrastruktur der Wohnung/des Hauses erfordern. Von den drahtlosen Geräten gibt es eine riesige Anzahl von Geräten unter den Marken Sonoff und Tyua, aber sie alle funktionieren über das Internet, das auf der Insel nicht immer zuverlässig funktioniert. Das ganz zu schweigen von der Frage der Privatsphäre und Sicherheit Ihrer persönlichen Daten auf den Servern anderer Unternehmen. Ich empfehle, Ihr Smart Home mit [Home Assistant](https://www.home-assistant.io) als Haupt-Home-Server aufzubauen. Vorteile: kann ohne Zugang zum externen Internet arbeiten; es ist möglich, es bei einem Umzug mitzunehmen und an einem neuen Ort ohne Verlust der Einstellungen einzurichten; unterstützt eine riesige Anzahl von Geräten, einschließlich Smart-TVs, Staubsauger und vieles mehr.",
  "The most popular protocols for wireless connection of devices are Wi-Fi, Zigbee, Bluetooth. In one apartment, all three types of connections can be found at once, but as for devices that make smart things out of ordinary things, it is more convenient to work with the Zigbee protocol. In this case, we do not need to worry about their addresses and coverage area, plus they can be battery operated. Wi-Fi devices require a constant connection to power and are dependent on the strength of the Wi-Fi signal. Even in a small apartment, where there are a couple of walls between the router and your bedroom, sometimes you have to install a Wi-Fi Extender. In the case of Zigbee, the devices themselves act as repeaters.": "Die beliebtesten Protokolle für die drahtlose Verbindung von Geräten sind Wi-Fi, Zigbee, Bluetooth. In einer Wohnung können alle drei Arten von Verbindungen gleichzeitig gefunden werden, aber was Geräte betrifft, die aus gewöhnlichen Dingen intelligente Dinge machen, ist es bequemer, mit dem Zigbee-Protokoll zu arbeiten. In diesem Fall müssen wir uns keine Sorgen um ihre Adressen und Abdeckungsbereiche machen, außerdem können sie batteriebetrieben sein. Wi-Fi-Geräte benötigen eine ständige Stromversorgung und sind abhängig von der Stärke des Wi-Fi-Signals. Selbst in einer kleinen Wohnung, in der sich ein paar Wände zwischen dem Router und Ihrem Schlafzimmer befinden, müssen Sie manchmal einen Wi-Fi-Extender installieren. Im Falle von Zigbee fungieren die Geräte selbst als Repeater.",
  "Returning to Cyprus, my required minimum of devices turned out to be as follows:": "Zurück nach Zypern stellte sich mein erforderliches Minimum an Geräten wie folgt heraus:",
  "## Computer - Home Server": "## Computer - Heimserver",
  "The ultimate task for the server is to serve a smart home controlled by Home Assistant. The easiest way is to take the already preconfigured [Home Assistant Green](https://www.home-assistant.io/green/). Cost [€70 excluding tax](https://thepihut.com/products/home-assistant-green).": "Die ultimative Aufgabe für den Server besteht darin, ein Smart Home zu bedienen, das von Home Assistant gesteuert wird. Der einfachste Weg ist, den bereits vorkonfigurierten [Home Assistant Green](https://www.home-assistant.io/green/) zu nehmen. Kosten [€70 ohne Steuern](https://thepihut.com/products/home-assistant-green).",
  "The option is a little more advanced, but you can even have control over the operating system, this is to find/buy [Raspberry Pi](https://www.raspberrypi.com). Cost [€90 excluding tax](https://https://thepihut.com/products/raspberry-pi-5-starter-kit). The [Installation](https://www.home-assistant.io/installation/) page has many options to suit all tastes.": "Die Option ist etwas fortgeschrittener, aber Sie können sogar die Kontrolle über das Betriebssystem haben, das ist zu finden/kaufen [Raspberry Pi](https://www.raspberrypi.com). Kosten [€90 ohne Steuern](https://https://thepihut.com/products/raspberry-pi-5-starter-kit). Die [Installations](https://www.home-assistant.io/installation/) Seite bietet viele Optionen, um allen Geschmäckern gerecht zu werden.",
  "As a Zigbee Coordinator we take [Sonoff Zigbee Dongle P or E](https://sonoff.tech/product/gateway-and-sensors/sonoff-zigbee-3-0-usb-dongle-plus-p/), they are practically always available on the island. Cost about [€35](https://www.amazon.de/-/en/dp/B09KXTCMSC/). You can also choose a stick from [this list](https://www.zigbee2mqtt.io/guide/adapters/).": "Als Zigbee-Koordinator nehmen wir [Sonoff Zigbee Dongle P oder E](https://sonoff.tech/product/gateway-and-sensors/sonoff-zigbee-3-0-usb-dongle-plus-p/), sie sind praktisch immer auf der Insel verfügbar. Kosten ca. [€35](https://www.amazon.de/-/en/dp/B09KXTCMSC/). Sie können auch einen Stick aus [dieser Liste](https://www.zigbee2mqtt.io/guide/adapters/) wählen.",
  "I highly recommend assigning a static local IP address for your home server. If it is not possible to get into the router settings, then you can additionally install a second router (I have [MikroTik](https://mikrotik.com/product/hap_ax2), approximately [€80](https://www.mstronics.com/c/337_1345_485/networking-devices-routers.html?filter_id=154)), and configure the Internet on it. And in general, it is better for all smart Wi-Fi devices to assign a static IP. This is often important for Home Assistant integrations to work properly.": "Ich empfehle dringend, Ihrem Heimserver eine statische lokale IP-Adresse zuzuweisen. Wenn es nicht möglich ist, in die Router-Einstellungen zu gelangen, können Sie zusätzlich einen zweiten Router installieren (ich habe [MikroTik](https://mikrotik.com/product/hap_ax2), ungefähr [€80](https://www.mstronics.com/c/337_1345_485/networking-devices-routers.html?filter_id=154)), und das Internet darauf konfigurieren. Und im Allgemeinen ist es besser, allen intelligenten WLAN-Geräten eine statische IP zuzuweisen. Dies ist oft wichtig, damit Home Assistant-Integrationen ordnungsgemäß funktionieren.",
  "## Boiler Switch": "## Schalter für den Kessel",
  "The boiler consumes 3-3.5 kWh and a regular smart switch will not work. When choosing, be sure to pay attention to the permissible current; it should be at least 16A, and preferably 20A. It’s difficult to quickly find a Zigbee switch on the island itself, I ordered from [China](https://vi.aliexpress.com/item/1005006833309900.html), it cost about €20.": "Der Kessel verbraucht 3-3,5 kWh und ein normaler intelligenter Schalter funktioniert nicht. Bei der Auswahl sollten Sie darauf achten, dass der zulässige Strom mindestens 16A und vorzugsweise 20A beträgt. Es ist schwierig, einen Zigbee-Schalter auf der Insel selbst schnell zu finden. Ich habe ihn aus [China](https://vi.aliexpress.com/item/1005006833309900.html) bestellt, er kostete etwa 20 €.",
  "The first and most important automation is to turn off the button N minutes after any activation. We set it up and no longer think about whether you forgot to turn off the button or whether it has been working for the third day. An example of automation for Home Assistant, you need to replace it with your `device_id` and `entity_id`:": "Die erste und wichtigste Automatisierung besteht darin, den Schalter N Minuten nach jeder Aktivierung auszuschalten. Wir richten es ein und denken nicht mehr darüber nach, ob Sie vergessen haben, den Schalter auszuschalten oder ob er bereits den dritten Tag funktioniert. Ein Beispiel für die Automatisierung für Home Assistant, Sie müssen es durch Ihre `device_id` und `entity_id` ersetzen:",
  "You can change the time throughout the year. For example, in February I need to heat the water for an hour, and in April 30 minutes is enough. Something useful is to add sending a notification to your phone when the water is heated.": "Sie können die Zeit im Laufe des Jahres ändern. Zum Beispiel muss ich im Februar das Wasser eine Stunde lang heizen, und im April reichen 30 Minuten aus. Es ist nützlich, eine Benachrichtigung auf Ihr Telefon zu senden, wenn das Wasser erhitzt ist.",
  "## IR Remote Controls for Air Conditioners and TV": "## IR-Fernbedienungen für Klimaanlagen und Fernseher",
  "Remote controls come with Wi-Fi connection (require constant power) and Zigbee connection (battery operated).": "Fernbedienungen sind mit Wi-Fi-Verbindung (benötigen konstante Stromversorgung) und Zigbee-Verbindung (batteriebetrieben) erhältlich.",
  "The Wi-Fi option I tried was from the manufacturer [Broadlink](https://www.ibroadlink.com/productinfo/762674.html), bought on [Amazon](https://www.amazon.de/-/en/dp/B07ZSG9Y67/), about €30. For the initial setup, you will have to install their application on your phone and create an account, but after that the IR remote control will work on the local network, connecting to HA is done using [integration](https://www.home-assistant.io/integrations/broadlink/). To further customize the remote control to suit your needs, I recommend looking at the [SmartIR](https://github.com/smartHomeHub/SmartIR) repository - this is a large library of ready-made commands for different air conditioners and TVs.": "Die Wi-Fi-Option, die ich ausprobiert habe, stammt vom Hersteller [Broadlink](https://www.ibroadlink.com/productinfo/762674.html), gekauft auf [Amazon](https://www.amazon.de/-/en/dp/B07ZSG9Y67/), etwa 30 €. Für die Ersteinrichtung müssen Sie ihre Anwendung auf Ihrem Telefon installieren und ein Konto erstellen, aber danach funktioniert die IR-Fernbedienung im lokalen Netzwerk und die Verbindung zu HA erfolgt über [Integration](https://www.home-assistant.io/integrations/broadlink/). Um die Fernbedienung weiter anzupassen, empfehle ich, das [SmartIR](https://github.com/smartHomeHub/SmartIR) Repository anzusehen - dies ist eine große Bibliothek mit fertigen Befehlen für verschiedene Klimaanlagen und Fernseher.",
  "Tip": "Tipp",
  "If your specific A/C model is not found, try other models from the same manufacturer. The commands will probably be the same and you will be able to connect your A/C.": "Wenn Ihr spezifisches Klimaanlagenmodell nicht gefunden wird, versuchen Sie es mit anderen Modellen desselben Herstellers. Die Befehle werden wahrscheinlich die gleichen sein und Sie können Ihre Klimaanlage anschließen.",
  "Remote controls running on Zigbee do not require a constant connection to power, but run on batteries. On the one hand, this is a plus, because you can place the device in any convenient place in the room. On the other hand, the batteries will need to be changed as needed. The setup process for such remote controls may also differ from Broadlink. If you can’t use the SmartIR library, the remote control will need to be trained for each command separately and saved in the Home Assistant configuration.": "Fernbedienungen, die mit Zigbee betrieben werden, benötigen keine konstante Stromverbindung, sondern laufen mit Batterien. Einerseits ist dies ein Pluspunkt, da Sie das Gerät an einem beliebigen bequemen Ort im Raum platzieren können. Andererseits müssen die Batterien bei Bedarf gewechselt werden. Der Einrichtungsprozess für solche Fernbedienungen kann auch von Broadlink abweichen. Wenn Sie die SmartIR-Bibliothek nicht verwenden können, muss die Fernbedienung für jede einzelne Befehl separat geschult und in der Home Assistant-Konfiguration gespeichert werden.",
  "Programmable remote controls are very easy to install and configure; they do not require wall mounting or connection to an air conditioner bus. However, there is a slight limitation due to the lack of feedback between devices. We cannot verify that the A/C has turned on and is executing exactly the command that we sent. However, we do it quickly and without damage to the apartment. To give a little more information to the remote control, you can install any Zigbee temperature and humidity sensor, for example [this one](https://vi.aliexpress.com/item/1005005595631552.html) for €10, and link the readings to the remote control. This way we have simple feedback, and the number of interesting scenarios increases.": "Programmierbare Fernbedienungen sind sehr einfach zu installieren und zu konfigurieren; sie erfordern keine Wandmontage oder Anschluss an einen Klimaanlagenbus. Es gibt jedoch eine leichte Einschränkung aufgrund des fehlenden Feedbacks zwischen den Geräten. Wir können nicht überprüfen, ob die Klimaanlage eingeschaltet ist und genau den Befehl ausführt, den wir gesendet haben. Wir tun es jedoch schnell und ohne Schaden an der Wohnung. Um der Fernbedienung etwas mehr Informationen zu geben, können Sie z.B. einen beliebigen Zigbee-Temperatur- und Feuchtigkeitssensor installieren, z.B. [diesen](https://vi.aliexpress.com/item/1005005595631552.html) für 10 €, und die Messwerte mit der Fernbedienung verknüpfen. Auf diese Weise haben wir einfaches Feedback, und die Anzahl interessanter Szenarien steigt.",
  "## Energy Meter": "## Energiemesser",
  "There are semi-invasive meters for electricity consumption, such as the one in the image below:": "Es gibt halb invasive Zähler für den Stromverbrauch, wie den im Bild unten:",
  "They must be powered by applying L and N to the input. On the other side, an induction ring is connected to the meter, which we hang on a phase or consumption line for measurement. Most houses and apartments have 3 phases, which means you need to install 3 such modules. I bought it on [Amazon](https://www.amazon.de/gp/product/B0C37DJXVD/) for €60, one for each phase. Older homes may only have one phase.": "Sie müssen durch Anlegen von L und N an den Eingang mit Strom versorgt werden. Auf der anderen Seite ist ein Induktionsring mit dem Zähler verbunden, den wir an einer Phase oder Verbraucherleitung zur Messung aufhängen. Die meisten Häuser und Wohnungen haben 3 Phasen, was bedeutet, dass Sie 3 solche Module installieren müssen. Ich habe es auf [Amazon](https://www.amazon.de/gp/product/B0C37DJXVD/) für 60 € gekauft, eins für jede Phase. Ältere Häuser haben möglicherweise nur eine Phase.",
  "## Conclusion": "## Fazit",
  "For me, a smart home is not a luxury, but a necessity. This is a place where I want to relax and spend time with my family, without wasting energy on solving everyday issues. The cost of the above kit in my case was about €500 and a couple of evenings. The result is invaluable!": "Für mich ist ein Smart Home keine Luxus, sondern eine Notwendigkeit. Dies ist ein Ort, an dem ich mich entspannen und Zeit mit meiner Familie verbringen möchte, ohne Energie für die Lösung alltäglicher Probleme zu verschwenden. Die Kosten des oben genannten Kits betrugen in meinem Fall etwa 500 € und ein paar Abende. Das Ergebnis ist unbezahlbar!"
}