{
  "\"Robonomics School 2024 / Cyprus Relocant Manual: Smart Home\"": "\"Robonomics School 2024 / Manuale del Relocante di Cipro: Casa Intelligente\"",
  "Cyprus Relocant Manual: Smart Home": "Manuale del Relocante di Cipro: Casa Intelligente",
  "[Learn, \"Robonomics School 2024 / Cyprus Relocant Manual: Smart Home\"]": "[Imparare, \"Robonomics School 2024 / Manuale del Relocante di Cipro: Casa Intelligente\"]",
  "Changing your country of residence always brings not only new opportunities, but also challenges. It so happened that in my case, the new country was Cyprus, where I came to build a company. For the last 10 years before moving, I lived in a big city, where I get used to certain benefits in the form of central heating from the city, hot water supply, and cheap electricity. In Cyprus, each house and each apartment is much more autonomous in terms of life support, but concerns about maintaining a comfortable life fall on the owner. Take hot water, for example. In the cold months, you have to turn on the boiler yourself to heat it up. The apartment also needs to be heated by yourself. In winter we turn on/off the thermal blanket and boiler, and in summer the air conditioner and mosquito repellent. This requires not only time and energy, but also money.": "Cambiare il paese di residenza porta sempre non solo nuove opportunità, ma anche sfide. È successo che nel mio caso, il nuovo paese fosse Cipro, dove sono venuto a costruire un'azienda. Negli ultimi 10 anni prima del trasferimento, ho vissuto in una grande città, dove mi ero abituato a certi vantaggi sotto forma di riscaldamento centralizzato dalla città, fornitura di acqua calda e elettricità economica. A Cipro, ogni casa e ogni appartamento sono molto più autonomi in termini di supporto alla vita, ma le preoccupazioni per mantenere una vita confortevole ricadono sul proprietario. Prendi ad esempio l'acqua calda. Nei mesi freddi, devi accendere il boiler da solo per scaldarlo. Anche l'appartamento deve essere riscaldato da solo. In inverno accendiamo/spegniamo la coperta termica e il boiler, e in estate l'aria condizionata e il repellente per zanzare. Questo richiede non solo tempo ed energia, ma anche denaro.",
  "My first winter in Cyprus resulted in astronomical electricity bills. This was a serious blow to my budget. One possible solution: change your habits and adapt to new conditions. But after moving, you will already have enough worries. As an engineer, I started looking for solutions that would help me control costs and make my life more comfortable, and I want to share my experience with you.": "Il mio primo inverno a Cipro si è tradotto in bollette elettriche astronomiche. Questo è stato un colpo serio al mio budget. Una possibile soluzione: cambiare le tue abitudini e adattarti alle nuove condizioni. Ma dopo il trasferimento, avrai già abbastanza preoccupazioni. Come ingegnere, ho iniziato a cercare soluzioni che mi aiutassero a controllare i costi e rendere la mia vita più confortevole, e voglio condividere la mia esperienza con te.",
  "## Hardware Choosing": "## Scelta dell'Hardware",
  "The first thing I want to start with is choosing an ecosystem. Wired systems are immediately eliminated, as they require large budgets and serious intervention in the infrastructure of the apartment/house. Of the wireless devices, there are a huge number of devices under the Sonoff and Tyua brands, but they all work via the Internet, which does not always work reliably on the island. This is not to mention the issue of privacy and safety of your personal data on other company’s servers. I recommend building your smart home with [Home Assistant](https://www.home-assistant.io) as a main home server. Pros: can work without access to the external Internet; it is possible to take it with you when moving and deploy it in a new place without losing the settings; supports a huge number of devices, including smart TVs, vacuum cleaners, and much more.": "La prima cosa con cui voglio iniziare è la scelta di un ecosistema. I sistemi cablati vengono immediatamente eliminati, in quanto richiedono budget elevati e interventi seri nell'infrastruttura dell'appartamento/casa. Dei dispositivi wireless, esistono un'enorme quantità di dispositivi sotto i marchi Sonoff e Tyua, ma tutti funzionano tramite Internet, che non sempre funziona in modo affidabile sull'isola. Senza considerare la questione della privacy e della sicurezza dei tuoi dati personali sui server di altre aziende. Raccomando di costruire la tua casa intelligente con [Home Assistant](https://www.home-assistant.io) come server principale. Vantaggi: può funzionare senza accesso a Internet esterno; è possibile portarlo con te in caso di spostamento e installarlo in un nuovo luogo senza perdere le impostazioni; supporta un'enorme quantità di dispositivi, inclusi smart TV, aspirapolvere e molto altro.",
  "The most popular protocols for wireless connection of devices are Wi-Fi, Zigbee, Bluetooth. In one apartment, all three types of connections can be found at once, but as for devices that make smart things out of ordinary things, it is more convenient to work with the Zigbee protocol. In this case, we do not need to worry about their addresses and coverage area, plus they can be battery operated. Wi-Fi devices require a constant connection to power and are dependent on the strength of the Wi-Fi signal. Even in a small apartment, where there are a couple of walls between the router and your bedroom, sometimes you have to install a Wi-Fi Extender. In the case of Zigbee, the devices themselves act as repeaters.": "I protocolli più popolari per la connessione wireless dei dispositivi sono Wi-Fi, Zigbee, Bluetooth. In un appartamento, si possono trovare contemporaneamente tutti e tre i tipi di connessioni, ma per quanto riguarda i dispositivi che trasformano le cose normali in cose intelligenti, è più conveniente lavorare con il protocollo Zigbee. In questo caso, non dobbiamo preoccuparci dei loro indirizzi e dell'area di copertura, inoltre possono funzionare a batteria. I dispositivi Wi-Fi richiedono una connessione costante all'alimentazione e dipendono dalla potenza del segnale Wi-Fi. Anche in un piccolo appartamento, dove ci sono un paio di pareti tra il router e la tua camera da letto, a volte devi installare un Wi-Fi Extender. Nel caso di Zigbee, i dispositivi stessi agiscono come ripetitori.",
  "Returning to Cyprus, my required minimum of devices turned out to be as follows:": "Tornando a Cipro, il mio minimo indispensabile di dispositivi si è rivelato essere il seguente:",
  "## Computer - Home Server": "## Computer - Server domestico",
  "The ultimate task for the server is to serve a smart home controlled by Home Assistant. The easiest way is to take the already preconfigured [Home Assistant Green](https://www.home-assistant.io/green/). Cost [€70 excluding tax](https://thepihut.com/products/home-assistant-green).": "Il compito principale del server è servire una casa intelligente controllata da Home Assistant. Il modo più semplice è prendere il già preconfigurato [Home Assistant Green](https://www.home-assistant.io/green/). Costo [€70 esclusa IVA](https://thepihut.com/products/home-assistant-green).",
  "The option is a little more advanced, but you can even have control over the operating system, this is to find/buy [Raspberry Pi](https://www.raspberrypi.com). Cost [€90 excluding tax](https://https://thepihut.com/products/raspberry-pi-5-starter-kit). The [Installation](https://www.home-assistant.io/installation/) page has many options to suit all tastes.": "L'opzione è un po' più avanzata, ma è possibile avere il controllo anche sul sistema operativo, questo è da trovare/acquistare [Raspberry Pi](https://www.raspberrypi.com). Costo [€90 esclusa IVA](https://https://thepihut.com/products/raspberry-pi-5-starter-kit). La pagina di [Installazione](https://www.home-assistant.io/installation/) ha molte opzioni per accontentare tutti i gusti.",
  "As a Zigbee Coordinator we take [Sonoff Zigbee Dongle P or E](https://sonoff.tech/product/gateway-and-sensors/sonoff-zigbee-3-0-usb-dongle-plus-p/), they are practically always available on the island. Cost about [€35](https://www.amazon.de/-/en/dp/B09KXTCMSC/). You can also choose a stick from [this list](https://www.zigbee2mqtt.io/guide/adapters/).": "Come coordinatore Zigbee prendiamo [Sonoff Zigbee Dongle P o E](https://sonoff.tech/product/gateway-and-sensors/sonoff-zigbee-3-0-usb-dongle-plus-p/), sono praticamente sempre disponibili sull'isola. Costo circa [€35](https://www.amazon.de/-/en/dp/B09KXTCMSC/). È anche possibile scegliere una stick da [questa lista](https://www.zigbee2mqtt.io/guide/adapters/).",
  "I highly recommend assigning a static local IP address for your home server. If it is not possible to get into the router settings, then you can additionally install a second router (I have [MikroTik](https://mikrotik.com/product/hap_ax2), approximately [€80](https://www.mstronics.com/c/337_1345_485/networking-devices-routers.html?filter_id=154)), and configure the Internet on it. And in general, it is better for all smart Wi-Fi devices to assign a static IP. This is often important for Home Assistant integrations to work properly.": "Consiglio vivamente di assegnare un indirizzo IP locale statico al server domestico. Se non è possibile accedere alle impostazioni del router, è possibile installare ulteriormente un secondo router (io ho [MikroTik](https://mikrotik.com/product/hap_ax2), circa [€80](https://www.mstronics.com/c/337_1345_485/networking-devices-routers.html?filter_id=154)), e configurare Internet su di esso. E in generale, è meglio assegnare un IP statico a tutti i dispositivi smart Wi-Fi. Spesso è importante per le integrazioni di Home Assistant funzionare correttamente.",
  "## Boiler Switch": "## Interruttore della caldaia",
  "The boiler consumes 3-3.5 kWh and a regular smart switch will not work. When choosing, be sure to pay attention to the permissible current; it should be at least 16A, and preferably 20A. It’s difficult to quickly find a Zigbee switch on the island itself, I ordered from [China](https://vi.aliexpress.com/item/1005006833309900.html), it cost about €20.": "La caldaia consuma da 3 a 3,5 kWh e un normale interruttore smart non funzionerà. Quando scegli, assicurati di prestare attenzione alla corrente ammessa; dovrebbe essere almeno di 16A, e preferibilmente di 20A. È difficile trovare rapidamente un interruttore Zigbee sull'isola stessa, ho ordinato dalla [Cina](https://vi.aliexpress.com/item/1005006833309900.html), è costato circa €20.",
  "The first and most important automation is to turn off the button N minutes after any activation. We set it up and no longer think about whether you forgot to turn off the button or whether it has been working for the third day. An example of automation for Home Assistant, you need to replace it with your `device_id` and `entity_id`:": "L'automazione più importante è spegnere il pulsante N minuti dopo qualsiasi attivazione. Lo impostiamo e non pensiamo più se hai dimenticato di spegnere il pulsante o se è stato acceso per il terzo giorno. Un esempio di automazione per Home Assistant, devi sostituirlo con il tuo `device_id` e `entity_id`:",
  "You can change the time throughout the year. For example, in February I need to heat the water for an hour, and in April 30 minutes is enough. Something useful is to add sending a notification to your phone when the water is heated.": "Puoi cambiare l'orario durante tutto l'anno. Ad esempio, a febbraio ho bisogno di riscaldare l'acqua per un'ora, e ad aprile 30 minuti sono sufficienti. Qualcosa di utile è aggiungere l'invio di una notifica al tuo telefono quando l'acqua è riscaldata.",
  "## IR Remote Controls for Air Conditioners and TV": "## Telecomandi IR per condizionatori d'aria e TV",
  "Remote controls come with Wi-Fi connection (require constant power) and Zigbee connection (battery operated).": "I telecomandi sono dotati di connessione Wi-Fi (richiedono alimentazione costante) e connessione Zigbee (alimentati a batteria).",
  "The Wi-Fi option I tried was from the manufacturer [Broadlink](https://www.ibroadlink.com/productinfo/762674.html), bought on [Amazon](https://www.amazon.de/-/en/dp/B07ZSG9Y67/), about €30. For the initial setup, you will have to install their application on your phone and create an account, but after that the IR remote control will work on the local network, connecting to HA is done using [integration](https://www.home-assistant.io/integrations/broadlink/). To further customize the remote control to suit your needs, I recommend looking at the [SmartIR](https://github.com/smartHomeHub/SmartIR) repository - this is a large library of ready-made commands for different air conditioners and TVs.": "Ho provato l'opzione Wi-Fi del produttore [Broadlink](https://www.ibroadlink.com/productinfo/762674.html), acquistato su [Amazon](https://www.amazon.de/-/en/dp/B07ZSG9Y67/), circa €30. Per la configurazione iniziale, dovrai installare la loro applicazione sul tuo telefono e creare un account, ma dopo il telecomando IR funzionerà sulla rete locale, collegandosi a HA tramite [integrazione](https://www.home-assistant.io/integrations/broadlink/). Per personalizzare ulteriormente il telecomando IR in base alle tue esigenze, ti consiglio di guardare il repository [SmartIR](https://github.com/smartHomeHub/SmartIR) - si tratta di una grande libreria di comandi pronti per diversi condizionatori d'aria e TV.",
  "Tip": "Consiglio",
  "If your specific A/C model is not found, try other models from the same manufacturer. The commands will probably be the same and you will be able to connect your A/C.": "Se il tuo modello specifico di A/C non viene trovato, prova altri modelli dello stesso produttore. I comandi probabilmente saranno gli stessi e sarai in grado di collegare il tuo A/C.",
  "Remote controls running on Zigbee do not require a constant connection to power, but run on batteries. On the one hand, this is a plus, because you can place the device in any convenient place in the room. On the other hand, the batteries will need to be changed as needed. The setup process for such remote controls may also differ from Broadlink. If you can’t use the SmartIR library, the remote control will need to be trained for each command separately and saved in the Home Assistant configuration.": "I telecomandi remoti che funzionano su Zigbee non richiedono una connessione costante all'alimentazione, ma funzionano a batterie. Da un lato, questo è un vantaggio, perché è possibile posizionare il dispositivo in qualsiasi punto comodo della stanza. D'altra parte, le batterie dovranno essere cambiate secondo necessità. Anche il processo di configurazione di tali telecomandi remoti potrebbe differire da Broadlink. Se non è possibile utilizzare la libreria SmartIR, il telecomando dovrà essere addestrato per ogni comando separatamente e salvato nella configurazione di Home Assistant.",
  "Programmable remote controls are very easy to install and configure; they do not require wall mounting or connection to an air conditioner bus. However, there is a slight limitation due to the lack of feedback between devices. We cannot verify that the A/C has turned on and is executing exactly the command that we sent. However, we do it quickly and without damage to the apartment. To give a little more information to the remote control, you can install any Zigbee temperature and humidity sensor, for example [this one](https://vi.aliexpress.com/item/1005005595631552.html) for €10, and link the readings to the remote control. This way we have simple feedback, and the number of interesting scenarios increases.": "I telecomandi programmabili sono molto facili da installare e configurare; non richiedono il montaggio a parete o la connessione a un bus del condizionatore d'aria. Tuttavia, c'è una leggera limitazione dovuta alla mancanza di feedback tra i dispositivi. Non possiamo verificare che l'A/C si sia acceso ed esegua esattamente il comando che abbiamo inviato. Tuttavia, lo facciamo rapidamente e senza danneggiare l'appartamento. Per dare un po' più di informazioni al telecomando, è possibile installare qualsiasi sensore di temperatura e umidità Zigbee, ad esempio [questo](https://vi.aliexpress.com/item/1005005595631552.html) per €10, e collegare le letture al telecomando. In questo modo abbiamo un feedback semplice, e il numero di scenari interessanti aumenta.",
  "## Energy Meter": "## Contatore Energetico",
  "There are semi-invasive meters for electricity consumption, such as the one in the image below:": "Ci sono contatori semi-invasivi per il consumo di elettricità, come quello nell'immagine qui sotto:",
  "They must be powered by applying L and N to the input. On the other side, an induction ring is connected to the meter, which we hang on a phase or consumption line for measurement. Most houses and apartments have 3 phases, which means you need to install 3 such modules. I bought it on [Amazon](https://www.amazon.de/gp/product/B0C37DJXVD/) for €60, one for each phase. Older homes may only have one phase.": "Devono essere alimentati applicando L e N all'ingresso. Dall'altro lato, un anello di induzione è collegato al contatore, che appendiamo a una fase o linea di consumo per la misurazione. La maggior parte delle case e degli appartamenti ha 3 fasi, il che significa che è necessario installare 3 moduli simili. L'ho comprato su [Amazon](https://www.amazon.de/gp/product/B0C37DJXVD/) per €60, uno per ogni fase. Le case più vecchie potrebbero avere solo una fase.",
  "## Conclusion": "## Conclusione",
  "For me, a smart home is not a luxury, but a necessity. This is a place where I want to relax and spend time with my family, without wasting energy on solving everyday issues. The cost of the above kit in my case was about €500 and a couple of evenings. The result is invaluable!": "Per me, una casa intelligente non è un lusso, ma una necessità. Questo è un luogo dove voglio rilassarmi e trascorrere del tempo con la mia famiglia, senza sprecare energia a risolvere questioni quotidiane. Il costo del kit sopra citato nel mio caso è stato di circa €500 e un paio di serate. Il risultato è inestimabile!"
}