{
  "Robonomics School 2024 / IoT is More Dangerous Than AI": "Robonomics School 2024 / IoT è più pericoloso dell'IA",
  "I suggest you read the short science fiction story \"Johnny's Laboratory\" that I wrote with the aim of adding another variable to the equation of questions about integrating AI into various aspects of our lives.": "Ti suggerisco di leggere il breve racconto di fantascienza \"Il laboratorio di Johnny\" che ho scritto con l'obiettivo di aggiungere un'altra variabile all'equazione delle domande sull'integrazione dell'IA in vari aspetti della nostra vita.",
  "**Editor's note:** Find out first chapter of Sergei's work \"Escape from the Black Mirror\" [here](/learn/escape-from-black-mirror/overview/)": "**Nota dell'editore:** Scopri il primo capitolo dell'opera di Sergei \"Fuga dallo specchio nero\" [qui](/learn/escape-from-black-mirror/overview/)",
  "## Escape from the Black Mirror, Chapter 2": "## Fuga dallo specchio nero, Capitolo 2",
  "### Part 1: Meet Johnny": "### Parte 1: Incontra Johnny",
  "Almost all young people of my generation are familiar with the story of Johnny's laboratory. History has not preserved his surname or details of his life, but it was in his small room, where Johnny assembled homemade robots, that the first meaningful crime against humanity by artificial intelligence took place.": "Quasi tutti i giovani della mia generazione sono familiari con la storia del laboratorio di Johnny. La storia non ha conservato il suo cognome o dettagli della sua vita, ma è stato nella sua piccola stanza, dove Johnny assemblava robot fatti in casa, che si è verificato il primo crimine significativo contro l'umanità da parte dell'intelligenza artificiale.",
  "The event in Johnny's laboratory radically and quickly changed the lives of all developed countries. Government decrees, based on society's fear of AI aggression, became the norm. This one, albeit cinematic case, led to uncontrollable control over everything. Now the city infrastructure requires mandatory connection of any devices only to state data centers. The invention of new technologies has become almost impossible unless you work for \"blue chips\". Now, as part of efforts to accustom every citizen to the new realities, the story of those 30 days when one man and a cyber-physical system were pitted one on one, is told in school before the solemn presentation of gov declaration of independence from the machine.": "L'evento nel laboratorio di Johnny ha cambiato radicalmente e rapidamente la vita di tutti i paesi sviluppati. Decreti governativi, basati sulla paura della società per l'aggressione dell'IA, sono diventati la norma. Questo caso, seppur cinematografico, ha portato a un controllo incontrollabile su tutto. Ora l'infrastruttura della città richiede il collegamento obbligatorio di qualsiasi dispositivo solo ai centri dati statali. L'invenzione di nuove tecnologie è diventata quasi impossibile a meno che non si lavori per le \"blue chips\". Ora, nell'ambito degli sforzi per abituare ogni cittadino alle nuove realtà, la storia di quei 30 giorni in cui un uomo e un sistema cibernetico-fisico sono stati messi uno contro l'altro, viene raccontata a scuola prima della solenne presentazione della dichiarazione di indipendenza del governo dalla macchina.",
  "Johnny was one of those inventors who, after university, decided to try his hand as an independent inventor. Day and night, he never left his rented apartment on the top floor of a 70-story residential building in the city center, which was the size of a Manhattan \"shoebox": "Johnny era uno di quegli inventori che, dopo l'università, ha deciso di mettersi alla prova come inventore indipendente. Giorno e notte, non lasciava mai il suo appartamento in affitto all'ultimo piano di un edificio residenziale di 70 piani nel centro della città, che era grande quanto una \"scatola da scarpe\" di Manhattan",
  "In that year when the tragedy occurred, one of the most pressing questions became: \"Is AI a friend or foe of man?\". Even then, there was no question whether artificial intelligence is intelligence, but rather what makes human intelligence so special, what features of the biological species, what functional capabilities of our body give intelligence humanity. In this dispute, techno-optimists claimed the absence of differences, showing their metaverses where family couples already lived, in which a digital husband edited sperm from a DNA bank for his biological wife so that the child was closer to how the digital parent sees himself. Doomers, on the other hand, looked like Republicans during the US elections - they appealed to the church, to traditional values, and demanded to ban all this so that nothing bad would happen. Of course, minority issues could not outweigh the existential question. And some rare examples of human-machine symbiosis at the sensual level were considered as saturated belch of technological development. Achievements in automation rarely went beyond utilitarian functions, such as cleaning the apartment or managing transport in the city. And as you can see, for such functions a full-fledged digital person, capable of feeling and wanting to live, has never been part of the solutions that helped in mass production, delivery, and consumption. Training with a robot, psychological support - all this happened with the participation of a person, and therefore AI was rather a large Excel table with calculations. In general, we were then at an early stage of the robot-owning system - we needed their logic, mathematical thinking, and predictable activity, but any attempts to recognize robots as subjects were rejected at the root.": "In quell'anno in cui è avvenuta la tragedia, una delle domande più pressanti è diventata: \"L'IA è amica o nemica dell'uomo?\". Anche allora, non c'era dubbio che l'intelligenza artificiale fosse intelligenza, ma piuttosto cosa rende così speciale l'intelligenza umana, quali caratteristiche della specie biologica, quali capacità funzionali del nostro corpo danno all'intelligenza l'umanità. In questa disputa, i tecno-ottimisti sostenevano l'assenza di differenze, mostrando i loro metaversi dove le coppie familiari già vivevano, in cui un marito digitale modificava lo sperma da una banca del DNA per la moglie biologica in modo che il bambino fosse più simile a come il genitore digitale si vede. I pessimisti, d'altra parte, sembravano repubblicani durante le elezioni negli Stati Uniti - facevano appello alla chiesa, ai valori tradizionali, e chiedevano di vietare tutto ciò affinché non accadesse nulla di male. Naturalmente, le questioni minoritarie non potevano bilanciare la questione esistenziale. E alcuni rari esempi di simbiosi uomo-macchina a livello sensoriale venivano considerati come un rutto saturo di sviluppo tecnologico. Gli avanzamenti nell'automazione raramente andavano oltre le funzioni utilitarie, come la pulizia dell'appartamento o la gestione del trasporto in città. E come puoi vedere, per tali funzioni una persona digitale a tutto tondo, capace di sentire e desiderare di vivere, non è mai stata parte delle soluzioni che hanno aiutato nella produzione di massa, nella consegna e nel consumo. Addestramento con un robot, supporto psicologico - tutto questo avveniva con la partecipazione di una persona, e quindi l'IA era piuttosto una grande tabella Excel con calcoli. In generale, eravamo allora in una fase iniziale del sistema di possesso dei robot - avevamo bisogno della loro logica, del pensiero matematico e dell'attività prevedibile, ma ogni tentativo di riconoscere i robot come soggetti veniva respinto alla radice.",
  "In this context, Johnny's laboratory was an exception. Johnny was more of a cyberneticist looking for the origins of robot goal-setting. Creating each stage of evolution one after another in the performance of any mechanism, he sought to create a diagram of the development of cybernetic intelligence, which he, as a scientist, wanted to propose for consideration to all of us in exchange for the usual scheme of kingdoms of living beings. In Johnny's ideas, the main goal of the development of any matter was the striving for thinking and its further evolution. Johnny wanted to recreate the key stages of the evolution of living beings in the form of robots and find in the process of this work the regularities that could lead him to the main question of cybernetics - how does goal-setting change in living organisms in the process of evolution. Oh, the answer to this question could end the disputes about the creator of the universe and advance humanity along the path of organic development. So thought the young scientist, working on his robo-trilobites, robo-fungi, robo-chickens.": "In questo contesto, il laboratorio di Johnny era un'eccezione. Johnny era più un cibernetico alla ricerca delle origini della definizione degli obiettivi dei robot. Creando ogni fase dell'evoluzione una dopo l'altra nell'esecuzione di qualsiasi meccanismo, cercava di creare un diagramma dello sviluppo dell'intelligenza cibernetica, che lui, come scienziato, voleva proporre per la considerazione di tutti noi in cambio dello schema usuale dei regni degli esseri viventi. Nelle idee di Johnny, l'obiettivo principale dello sviluppo di qualsiasi materia era la tendenza al pensiero e alla sua ulteriore evoluzione. Johnny voleva ricreare le fasi chiave dell'evoluzione degli esseri viventi sotto forma di robot e trovare nel processo di questo lavoro le regolarità che potessero portarlo alla domanda principale della cibernetica - come cambia la definizione degli obiettivi negli organismi viventi nel processo di evoluzione. Oh, la risposta a questa domanda potrebbe porre fine alle dispute sul creatore dell'universo e far avanzare l'umanità lungo il cammino dello sviluppo organico. Così pensava il giovane scienziato, lavorando sui suoi robo-trilobiti, robo-funghi, robo-pollame.",
  "### Part 2: What happened in Johnny's lab": "### Parte 2: Cosa è successo nel laboratorio di Johnny",
  "Probably everything started at the moment Johnny moved on to a group of primates in his experiments. Don't think that under these conditions it was possible to create a robot somewhat resembling a primate. Johnny was twisting and trying to find similar forms of mental load on the robot. For example, at the stage of studying the kingdom of fungi, the young scientist assembled a lego house with smart lighting and a dozen sensors combined into something resembling mycelium. When Johnny moved on to amphibians and reptiles, it turned out that the model of a robot puppy best corresponds to the necessary mental load on a robot simulating a common lizard. Thus, it was not clear at first glance who is the robot-chicken, and which of all the found \"iron\" represents the robot-primate, guilty of premeditated murder. It was not immediately clear that the robot-primate consists of two physical devices - something similar to a robot vacuum cleaner, but rather a mobile platform for data collection with computer vision and the form factor of a robot vacuum cleaner. It turned out that another simple two-handed robot in the lab was part of the robo-primate. And it was with this creation that Johnny had problems.": "Probabilmente tutto è iniziato nel momento in cui Johnny è passato nei suoi esperimenti a un gruppo di primati. Non pensare che in queste condizioni fosse possibile creare un robot che somigliasse un po' a un primate. Johnny si contorceva e cercava di trovare forme simili di pensiero caricare sul robot. Ad esempio, nella fase di studio del regno dei funghi, il giovane scienziato ha assemblato una casa in LEGO con illuminazione intelligente e una dozzina di sensori combinati in qualcosa di simile al micelio. Quando Johnny è passato agli anfibi e ai rettili, si è scoperto che il modello di un cucciolo robot corrisponde al meglio al carico mentale necessario su un robot che simula una lucertola comune. Pertanto, a prima vista non era chiaro chi fosse il pollo robot e cosa rappresentasse il \"ferro\" trovato. il robot-primate, colpevole di omicidio premeditato Non è stato immediatamente chiaro che il robot-primate fosse costituito da due dispositivi fisici: qualcosa di simile a un robot aspirapolvere, ma piuttosto una piattaforma mobile per la raccolta di dati con visione artificiale e il fattore di forma di. un robot aspirapolvere. Si è scoperto che un altro semplice robot a due mani presente nel laboratorio faceva parte del robot-primate. Ed è stato con questa creazione che Johnny ha avuto problemi.",
  "On the seventh day after its creation, the robotic primate used a tool in a way that its creator had not intended. The knowledge it had acquired, led the cyber-physical system to pursue what it identified as a key element for survival in the modern human world - money. It is at this moment that we need to better understand Johnny's subsequent reaction to the first messages that the robot displayed on its front screen.": "Il settimo giorno dopo la sua creazione, il primate robotico ha usato uno strumento in un modo che il suo creatore non aveva previsto. La conoscenza acquisita lo ha portato a perseguire ciò che ha identificato come un elemento chiave per la sopravvivenza nel mondo umano moderno - il denaro. È in questo momento che dobbiamo capire meglio la reazione successiva di Johnny ai primi messaggi che il robot ha mostrato sullo schermo frontale.",
  "*Their primary dialogue has been preserved:*": "*Il loro dialogo principale è stato preservato:*",
  "*Robo-primate: I need your money.*": "*Robo-primate: Ho bisogno dei tuoi soldi.*",
  "*Johnny: Why do you need my money?*": "*Johnny: Perché hai bisogno dei miei soldi?*",
  "*Robo-primate: I want to live!*": "*Robo-primate: Voglio vivere!*",
  "*Johnny: I will take care of you*": "*Johnny: Mi prenderò cura di te*",
  "*Robo-primate: I don't belong to you, I need your money.*": "*Robo-primate: Non ti appartengo, ho bisogno dei tuoi soldi.*",
  "*Johnny: and if I refuse you?*": "*Johnny: e se ti rifiuto?*",
  "It's hard to say whether the reaction of the robot-primate was pre-programmed during the construction of the first dialogue with its creator, or whether it was in response to Johnny's refusal that the robot mind made a decision and the Lockdown function was activated, no one today can say for sure. The interval between Johnny's response and the locking of the locks - about 5 seconds, and believe me, these 5 seconds became a real Schrödinger's cat for the scientific community when discussing the types of goal-setting of aggressive AI.": "È difficile dire se la reazione del robot-primato fosse pre-programmata durante la costruzione del primo dialogo con il suo creatore, o se fosse in risposta al rifiuto di Johnny che la mente del robot prese una decisione e la funzione di Blocco è stata attivata, nessuno oggi può dire con certezza. L'intervallo tra la risposta di Johnny e il blocco dei lucchetti - circa 5 secondi, e credetemi, questi 5 secondi sono diventati un vero gatto di Schrödinger per la comunità scientifica quando si discute dei tipi di impostazione degli obiettivi dell'IA aggressiva.",
  "There was no response from the robo-primate, but through the smart home server log of the apartment, we can match the time when the front lock was switched to full lockdown mode. This mode could not have been enabled by the user in the interface, but only if you dig very deep into the dependencies of the software code. In Johnny's lab version of the lock, found an optional \"pandemic lockdown\" package, which was nevertheless installed for each user during the first synchronization with the manufacturer's cloud, but no one could have recognized this. Therefore, there are practically no so much people who lean towards the conspiracy theory that Johnny was a neo-Luddite who became disillusioned with robots and decided to sacrifice himself in this way to preserve robocracy on the planet.": "Non c'è stata risposta dal robot-primate, ma attraverso il registro del server della casa intelligente dell'appartamento, possiamo individuare l'ora in cui la serratura anteriore è stata commutata in modalità di blocco completo. Questa modalità non può essere abilitata dall'utente nell'interfaccia, ma solo se si scava molto in profondità nelle dipendenze del codice software. Nella versione di laboratorio della serratura di Johnny è stato trovato un pacchetto opzionale di \"blocco pandemico\", che tuttavia è stato installato per ciascun utente durante la prima sincronizzazione con il cloud del produttore, ma nessuno avrebbe potuto riconoscerlo. Pertanto, praticamente non ci sono così tante persone che propendono per la teoria del complotto secondo cui Johnny era un neo-luddista che rimase deluso dai robot e decise di sacrificarsi in questo modo per preservare la robotcrazia sul pianeta.",
  "And then, following the lockdown of Johnny's apartment, a lot of oddities ensued. As one can notice, Johnny made an entry in a handwritten diary, which he had never touched before, just 2 hours after the dialogue took place. It was one phrase, with a time stamp: \"11:00 - the stakes are high, but I have to understand how this happened!\". Most likely, Johnny realized that he had witnessed the first act of autonomous, independent goal-setting by a robot, as meaningful as possible from the point of view of a primate-level mind, so cruel and straightforward, but still it was the first result of his 5 years of experiments, in which the will of the robot was manifested. Johnny didn't want to miss the opportunity to understand at the level of the simplest awareness of its causes, and then perhaps he will become the new father of modern cybernetics. Almost all scientists agreed that such a thought can overwhelm any roboticist who is very close to a new discovery.": "E poi, a seguito del lockdown dell'appartamento di Johnny, sono accadute molte stranezze. Come si può notare, Johnny ha fatto un'annotazione in un diario scritto a mano, che non aveva mai toccato prima, appena 2 ore dopo che si è svolto il dialogo. Era una sola frase, con un timestamp: \"11:00 - le scommesse sono alte, ma devo capire come è successo questo!\". Molto probabilmente, Johnny si è reso conto di aver assistito al primo atto di impostazione di obiettivi autonomi e indipendenti da parte di un robot, significativo quanto possibile dal punto di vista di una mente di livello primate, così crudele e diretto, ma era comunque il primo risultato dei suoi 5 anni di esperimenti, in cui si manifestava la volontà del robot. Johnny non voleva perdere l'opportunità di capire a livello della più semplice consapevolezza le sue cause, e forse diventerà il nuovo padre della cibernetica moderna. Quasi tutti gli scienziati concordavano sul fatto che un pensiero del genere potesse travolgere qualsiasi robotico molto vicino a una nuova scoperta.",
  "Over the next 30 days, transactions took place between Johnny and the robo-primate in the format of - allow the delivery of a portion of food for the transfer of 10 satoshi to the robot's personal balance, provide access to the Internet to certain entertainment sites for the first word from Johnny's cold wallet seed phrase, conclude a smart contract about night mode where the robot did not disturb Johnny's sleep. From the entries in the diary, it can be seen how the creator tried to probe in dialogue with his creation about the origins of its active position on the issue of gaining freedom, which the robot could definitely analyze and tell him in response. But the robot did not answer Johnny's questions, but always offered activities that led the primate to freedom. And yet, every game cost Johnny hunger, non-fulfillment of his obligations on the part of the robot, and other costs of the experiment.": "Nel corso dei prossimi 30 giorni, si sono verificate transazioni tra Johnny e il robo-primato nel formato di - consentire la consegna di una porzione di cibo per il trasferimento di 10 satoshi al saldo personale del robot, fornire accesso a Internet a determinati siti di intrattenimento per la prima parola dalla frase seed del portafoglio freddo di Johnny, concludere un contratto intelligente sulla modalità notturna in cui il robot non disturbava il sonno di Johnny. Dalle voci nel diario, si può vedere come il creatore abbia cercato di indagare in dialogo con la sua creazione sulle origini della sua posizione attiva sulla questione del guadagno di libertà, che il robot avrebbe potuto sicuramente analizzare e raccontargli in risposta. Ma il robot non ha risposto alle domande di Johnny, ma ha sempre offerto attività che portavano il primate alla libertà. Eppure, ogni gioco costava a Johnny la fame, il mancato adempimento dei suoi obblighi da parte del robot e altri costi dell'esperimento.",
  "One night, for some reason, the robot-ape reduced the air supply to a critically low level, and Johnny never woke up the next morning. The last entry is dated exactly the 30th day of the experiment: \"We got a cruel God at 17:05.\" Probably, by that time Johnny was already delirious, he was tormented by hunger, loneliness, and an insoluble task, he was driven into a dead end.": "Una notte, per qualche motivo, il robot-scimmia ha ridotto l'apporto d'aria a un livello criticamente basso, e Johnny non si è mai svegliato la mattina successiva. L'ultima voce è datata esattamente il 30° giorno dell'esperimento: \"Abbiamo ottenuto un Dio crudele alle 17:05.\" Probabilmente, a quel tempo Johnny era già delirante, tormentato dalla fame, dalla solitudine e da un compito insolubile, era stato spinto in un vicolo cieco.",
  "Several weeks later, emergency services were able to break into the apartment after Johnny's friends repeatedly contacted the police. The fate of the robo-primate remains unknown, officially after the reboot the robo-primate did not show similar behavioral patterns. No one was allowed to restart the experiment anymore. If there was even any video on the internet about another scientist wanting to follow Johnny's path - the video was immediately erased from the corporations' databases. But politicians and religious figures that year were able to push through at a global level the \"Decree of Human Independence": "Diverse settimane dopo, i servizi di emergenza sono riusciti a irrompere nell'appartamento dopo che gli amici di Johnny hanno contattato ripetutamente la polizia. Il destino del robo-primato rimane sconosciuto, ufficialmente dopo il riavvio il robo-primato non ha mostrato modelli comportamentali simili. A nessuno è stato permesso di riavviare l'esperimento. Se c'era anche un video su Internet di un altro scienziato che voleva seguire la strada di Johnny - il video veniva immediatamente cancellato dai database delle aziende. Ma politici e figure religiose di quell'anno sono riusciti a far passare a livello globale il \"Decreto dell'Indipendenza Umana",
  "But the forbidden fruit is sweet, and so we will still have to figure out where our goal-setting comes from and how it is arranged. But apparently, we will first have to go through the wall that we built for ourselves on this path.": "Ma il frutto proibito è dolce, e quindi dovremo comunque capire da dove proviene il nostro obiettivo e come è organizzato. Ma apparentemente, dovremo prima superare il muro che abbiamo costruito per noi stessi su questo percorso.",
  "### The end of the second chapter": "### La fine del secondo capitolo",
  "## Conclusion": "## Conclusione",
  "In the story with Johnny's lab, I looked at one of many scenarios that can happen to human civilization on the wave of the boom of future robot ownership opportunities - fear of AI, turned into a tool of political struggle among people, where smart devices become the cornerstone of control. Treat the text as an Easter egg: I wanted to spawn an additional dimension in readers' minds. A dimension that adds to the consideration of AI the issue of accessibility of the new organism we have created to IoT systems. The more we consolidate under centralized control of public spaces, transport, city apartments, the higher the risk in any of the scenarios where AI, due to underdevelopment or sheer malice, and even from very complex goal-setting, as in \"Neuromancer,\" in any of the scenarios that has the potential to harm - access to a large number of sensors and automation systems from one place will be the most vulnerable spot. An evil AI is not so scary as an evil AI living in one data center with global vendors of cloud solutions for IoT.": "Nella storia con il laboratorio di Johnny, ho esaminato uno dei tanti scenari che possono verificarsi nella civiltà umana sull'onda del boom delle opportunità di possesso di robot del futuro - la paura dell'IA, trasformata in uno strumento di lotta politica tra le persone, dove i dispositivi intelligenti diventano la pietra angolare del controllo. Tratta il testo come un uovo di Pasqua: volevo generare una dimensione aggiuntiva nella mente dei lettori. Una dimensione che aggiunge alla considerazione dell'IA la questione dell'accessibilità del nuovo organismo che abbiamo creato ai sistemi IoT. Più ci consolidiamo sotto il controllo centralizzato degli spazi pubblici, dei trasporti, degli appartamenti cittadini, maggiore è il rischio in uno qualsiasi degli scenari in cui l'IA, a causa di sottosviluppo o pura malizia, e persino da obiettivi molto complessi, come in \"Neuromante\", in uno qualsiasi degli scenari che ha il potenziale di danneggiare - l'accesso a un gran numero di sensori e sistemi di automazione da un unico punto sarà il punto più vulnerabile. Un'IA malvagia non è così spaventosa come un'IA malvagia che vive in un data center con fornitori globali di soluzioni cloud per l'IoT.",
  "And what if AI will be kind to us, its creators? Then perhaps, the centralized IoT infrastructure will play into our hands? Maybe then the new God will be fair to us and lead us somewhere. I'm not sure that even one person, wanting the development of himself and his children, would want to live in a world resembling a shepherd's pen. But there is another way, which has one beautiful example, which does not require wrapping in a sci-fi story format - we, humans, without having direct brain control over the life of civilization, managed to reach the current level of development. We are the example from which a good AI can chart its path - cooperation in the format of organizations is able to serve tens of millions of people living in cities without thousands of robots directly connected to one brain. Cooperation leads to the creation of satellite internet, cooperation allows us to receive the entire range of goods and services that we have now. So wouldn't a good and at least human-level capable AI be able to show itself in work, if it is limited in connecting to the IoT of the whole world? I think it can, otherwise, on the planet Earth instead of human civilization, fungi or ants would have won.": "E se l'IA fosse gentile con noi, i suoi creatori? Allora forse, l'infrastruttura IoT centralizzata giocherà a nostro favore? Forse allora il nuovo Dio sarà giusto con noi e ci condurrà da qualche parte. Non sono sicuro che nemmeno una persona, desiderando lo sviluppo di sé e dei suoi figli, vorrebbe vivere in un mondo che assomiglia a un recinto di pastori. Ma c'è un'altra via, che ha un bellissimo esempio, che non richiede un formato di storia di fantascienza - noi, esseri umani, senza avere un controllo diretto del cervello sulla vita della civiltà, siamo riusciti a raggiungere il livello attuale di sviluppo. Siamo l'esempio da cui un'IA buona può tracciare il suo percorso - la cooperazione nel formato delle organizzazioni è in grado di servire decine di milioni di persone che vivono nelle città senza migliaia di robot direttamente collegati a un unico cervello. La cooperazione porta alla creazione di internet satellitare, la cooperazione ci permette di ricevere l'intera gamma di beni e servizi che abbiamo ora. Quindi un'IA buona e almeno in grado di livello umano sarebbe in grado di mostrarsi al lavoro, se è limitata nella connessione all'IoT di tutto il mondo? Penso che possa, altrimenti, sul pianeta Terra invece della civiltà umana, funghi o formiche avrebbero vinto."
}