{
  "\"Robonomics School 2024 / Cyprus Relocant Manual: Smart Home\"": "\"Robonomics School 2024 / Руководство по переезду на Кипр: Умный дом\"",
  "Cyprus Relocant Manual: Smart Home": "Руководство по переезду на Кипр: Умный дом",
  "[Learn, \"Robonomics School 2024 / Cyprus Relocant Manual: Smart Home\"]": "[Учиться, \"Robonomics School 2024 / Руководство по переезду на Кипр: Умный дом\"]",
  "Changing your country of residence always brings not only new opportunities, but also challenges. It so happened that in my case, the new country was Cyprus, where I came to build a company. For the last 10 years before moving, I lived in a big city, where I get used to certain benefits in the form of central heating from the city, hot water supply, and cheap electricity. In Cyprus, each house and each apartment is much more autonomous in terms of life support, but concerns about maintaining a comfortable life fall on the owner. Take hot water, for example. In the cold months, you have to turn on the boiler yourself to heat it up. The apartment also needs to be heated by yourself. In winter we turn on/off the thermal blanket and boiler, and in summer the air conditioner and mosquito repellent. This requires not only time and energy, but also money.": "Изменение страны проживания всегда приносит не только новые возможности, но и вызовы. Так случилось, что в моем случае новой страной стал Кипр, куда я приехал строить компанию. За последние 10 лет до переезда я жил в большом городе, где привык к определенным преимуществам в виде центрального отопления от города, горячего водоснабжения и дешевой электроэнергии. На Кипре каждый дом и каждая квартира намного более автономны в плане обеспечения жизнедеятельности, но заботы о поддержании комфортной жизни ложатся на владельца. Возьмем, к примеру, горячую воду. В холодные месяцы приходится самостоятельно включать котел, чтобы его нагреть. Квартиру тоже нужно самостоятельно отапливать. Зимой мы включаем/выключаем тепловую подушку и котел, а летом кондиционер и отпугиватель комаров. Это требует не только времени и энергии, но и денег.",
  "My first winter in Cyprus resulted in astronomical electricity bills. This was a serious blow to my budget. One possible solution: change your habits and adapt to new conditions. But after moving, you will already have enough worries. As an engineer, I started looking for solutions that would help me control costs and make my life more comfortable, and I want to share my experience with you.": "Мой первый зимний сезон на Кипре привел к астрономическим счетам за электроэнергию. Это был серьезный удар по моему бюджету. Один из возможных вариантов решения: изменить свои привычки и адаптироваться к новым условиям. Но после переезда у вас уже будет достаточно забот. Как инженер, я начал искать решения, которые помогли бы мне контролировать расходы и сделать мою жизнь более комфортной, и я хочу поделиться своим опытом с вами.",
  "## Hardware Choosing": "## Выбор оборудования",
  "The first thing I want to start with is choosing an ecosystem. Wired systems are immediately eliminated, as they require large budgets and serious intervention in the infrastructure of the apartment/house. Of the wireless devices, there are a huge number of devices under the Sonoff and Tyua brands, but they all work via the Internet, which does not always work reliably on the island. This is not to mention the issue of privacy and safety of your personal data on other company’s servers. I recommend building your smart home with [Home Assistant](https://www.home-assistant.io) as a main home server. Pros: can work without access to the external Internet; it is possible to take it with you when moving and deploy it in a new place without losing the settings; supports a huge number of devices, including smart TVs, vacuum cleaners, and much more.": "Первое, с чего я хочу начать, это выбор экосистемы. Проводные системы сразу исключаются, так как требуют больших бюджетов и серьезного вмешательства в инфраструктуру квартиры/дома. Из беспроводных устройств существует огромное количество устройств под брендами Sonoff и Tyua, но все они работают через Интернет, что не всегда надежно работает на острове. Не говоря уже о вопросе конфиденциальности и безопасности ваших персональных данных на серверах других компаний. Я рекомендую строить свой умный дом с [Home Assistant](https://www.home-assistant.io) в качестве основного домашнего сервера. Плюсы: может работать без доступа к внешнему Интернету; можно взять его с собой при переезде и развернуть в новом месте без потери настроек; поддерживает огромное количество устройств, включая смарт-телевизоры, пылесосы и многое другое.",
  "The most popular protocols for wireless connection of devices are Wi-Fi, Zigbee, Bluetooth. In one apartment, all three types of connections can be found at once, but as for devices that make smart things out of ordinary things, it is more convenient to work with the Zigbee protocol. In this case, we do not need to worry about their addresses and coverage area, plus they can be battery operated. Wi-Fi devices require a constant connection to power and are dependent on the strength of the Wi-Fi signal. Even in a small apartment, where there are a couple of walls between the router and your bedroom, sometimes you have to install a Wi-Fi Extender. In the case of Zigbee, the devices themselves act as repeaters.": "Самые популярные протоколы беспроводного подключения устройств - Wi-Fi, Zigbee, Bluetooth. В одной квартире можно встретить сразу все три типа подключений, но что касается устройств, которые делают умные вещи из обычных вещей, удобнее всего работать с протоколом Zigbee. В этом случае нам не нужно беспокоиться о их адресах и зоне покрытия, плюс они могут работать от батареек. Устройства Wi-Fi требуют постоянного подключения к электропитанию и зависят от силы сигнала Wi-Fi. Даже в небольшой квартире, где есть пара стен между роутером и вашей спальней, иногда приходится устанавливать усилитель Wi-Fi. В случае Zigbee сами устройства выступают в качестве ретрансляторов.",
  "Returning to Cyprus, my required minimum of devices turned out to be as follows:": "Вернувшись на Кипр, мой минимальный набор устройств оказался следующим:",
  "## Computer - Home Server": "## Компьютер - Домашний сервер",
  "The ultimate task for the server is to serve a smart home controlled by Home Assistant. The easiest way is to take the already preconfigured [Home Assistant Green](https://www.home-assistant.io/green/). Cost [€70 excluding tax](https://thepihut.com/products/home-assistant-green).": "Основная задача сервера - обслуживание умного дома, управляемого Home Assistant. Самый простой способ - взять уже предварительно настроенный [Home Assistant Green](https://www.home-assistant.io/green/). Стоимость [€70 без учета налогов](https://thepihut.com/products/home-assistant-green).",
  "The option is a little more advanced, but you can even have control over the operating system, this is to find/buy [Raspberry Pi](https://www.raspberrypi.com). Cost [€90 excluding tax](https://https://thepihut.com/products/raspberry-pi-5-starter-kit). The [Installation](https://www.home-assistant.io/installation/) page has many options to suit all tastes.": "Вариант немного более продвинутый, но вы даже можете иметь контроль над операционной системой, для этого нужно найти/купить [Raspberry Pi](https://www.raspberrypi.com). Стоимость [€90 без учета налогов](https://https://thepihut.com/products/raspberry-pi-5-starter-kit). На странице [Установка](https://www.home-assistant.io/installation/) есть много вариантов, подходящих для всех вкусов.",
  "As a Zigbee Coordinator we take [Sonoff Zigbee Dongle P or E](https://sonoff.tech/product/gateway-and-sensors/sonoff-zigbee-3-0-usb-dongle-plus-p/), they are practically always available on the island. Cost about [€35](https://www.amazon.de/-/en/dp/B09KXTCMSC/). You can also choose a stick from [this list](https://www.zigbee2mqtt.io/guide/adapters/).": "В качестве координатора Zigbee мы берем [Sonoff Zigbee Dongle P или E](https://sonoff.tech/product/gateway-and-sensors/sonoff-zigbee-3-0-usb-dongle-plus-p/), они практически всегда доступны на острове. Стоимость около [€35](https://www.amazon.de/-/en/dp/B09KXTCMSC/). Вы также можете выбрать палку из [этого списка](https://www.zigbee2mqtt.io/guide/adapters/).",
  "I highly recommend assigning a static local IP address for your home server. If it is not possible to get into the router settings, then you can additionally install a second router (I have [MikroTik](https://mikrotik.com/product/hap_ax2), approximately [€80](https://www.mstronics.com/c/337_1345_485/networking-devices-routers.html?filter_id=154)), and configure the Internet on it. And in general, it is better for all smart Wi-Fi devices to assign a static IP. This is often important for Home Assistant integrations to work properly.": "Я настоятельно рекомендую назначить статический локальный IP-адрес для вашего домашнего сервера. Если невозможно зайти в настройки маршрутизатора, то можно дополнительно установить второй маршрутизатор (у меня [MikroTik](https://mikrotik.com/product/hap_ax2), примерно [€80](https://www.mstronics.com/c/337_1345_485/networking-devices-routers.html?filter_id=154)), и настроить на нем интернет. И вообще, лучше всем умным устройствам Wi-Fi назначить статический IP. Это часто важно для правильной работы интеграций Home Assistant.",
  "## Boiler Switch": "## Переключатель котла",
  "The boiler consumes 3-3.5 kWh and a regular smart switch will not work. When choosing, be sure to pay attention to the permissible current; it should be at least 16A, and preferably 20A. It’s difficult to quickly find a Zigbee switch on the island itself, I ordered from [China](https://vi.aliexpress.com/item/1005006833309900.html), it cost about €20.": "Котел потребляет 3-3,5 кВтч, и обычный умный выключатель не подойдет. При выборе обязательно обратите внимание на допустимый ток; он должен быть не менее 16А, а лучше 20А. На острове сложно быстро найти выключатель Zigbee, я заказал из [Китая](https://vi.aliexpress.com/item/1005006833309900.html), это стоило около €20.",
  "The first and most important automation is to turn off the button N minutes after any activation. We set it up and no longer think about whether you forgot to turn off the button or whether it has been working for the third day. An example of automation for Home Assistant, you need to replace it with your `device_id` and `entity_id`:": "Первая и самая важная автоматизация - выключение кнопки через N минут после любой активации. Мы настраиваем это и больше не думаем о том, забыли ли мы выключить кнопку или она работает уже третий день. Пример автоматизации для Home Assistant, вам нужно заменить его на свой `device_id` и `entity_id`:",
  "You can change the time throughout the year. For example, in February I need to heat the water for an hour, and in April 30 minutes is enough. Something useful is to add sending a notification to your phone when the water is heated.": "Вы можете менять время в течение года. Например, в феврале мне нужно нагреть воду на час, а в апреле 30 минут достаточно. Что-то полезное - добавить отправку уведомления на ваш телефон, когда вода нагреется.",
  "## IR Remote Controls for Air Conditioners and TV": "## Пульты ДУ для кондиционеров и телевизоров",
  "Remote controls come with Wi-Fi connection (require constant power) and Zigbee connection (battery operated).": "Пульты ДУ поставляются с подключением Wi-Fi (требуется постоянное питание) и подключением Zigbee (работают от батареек).",
  "The Wi-Fi option I tried was from the manufacturer [Broadlink](https://www.ibroadlink.com/productinfo/762674.html), bought on [Amazon](https://www.amazon.de/-/en/dp/B07ZSG9Y67/), about €30. For the initial setup, you will have to install their application on your phone and create an account, but after that the IR remote control will work on the local network, connecting to HA is done using [integration](https://www.home-assistant.io/integrations/broadlink/). To further customize the remote control to suit your needs, I recommend looking at the [SmartIR](https://github.com/smartHomeHub/SmartIR) repository - this is a large library of ready-made commands for different air conditioners and TVs.": "Вариант Wi-Fi, который я попробовал, был от производителя [Broadlink](https://www.ibroadlink.com/productinfo/762674.html), куплен на [Amazon](https://www.amazon.de/-/en/dp/B07ZSG9Y67/), около €30. Для начальной настройки вам придется установить их приложение на телефон и создать учетную запись, но после этого ИК-пульт будет работать в локальной сети, подключение к HA осуществляется с помощью [интеграции](https://www.home-assistant.io/integrations/broadlink/). Для дальнейшей настройки пульта ДУ под ваши нужды я рекомендую посмотреть репозиторий [SmartIR](https://github.com/smartHomeHub/SmartIR) - это большая библиотека готовых команд для различных кондиционеров и телевизоров.",
  "Tip": "Совет",
  "If your specific A/C model is not found, try other models from the same manufacturer. The commands will probably be the same and you will be able to connect your A/C.": "Если ваша конкретная модель кондиционера не найдена, попробуйте другие модели от того же производителя. Команды, вероятно, будут такими же, и вы сможете подключить свой кондиционер.",
  "Remote controls running on Zigbee do not require a constant connection to power, but run on batteries. On the one hand, this is a plus, because you can place the device in any convenient place in the room. On the other hand, the batteries will need to be changed as needed. The setup process for such remote controls may also differ from Broadlink. If you can’t use the SmartIR library, the remote control will need to be trained for each command separately and saved in the Home Assistant configuration.": "Пульты дистанционного управления, работающие на Zigbee, не требуют постоянного подключения к питанию, а работают от батареек. С одной стороны, это плюс, потому что вы можете разместить устройство в любом удобном месте в комнате. С другой стороны, батарейки придется менять по мере необходимости. Процесс настройки таких пультов дистанционного управления также может отличаться от Broadlink. Если вы не можете использовать библиотеку SmartIR, пульт дистанционного управления придется обучить для каждой команды отдельно и сохранить в конфигурации Home Assistant.",
  "Programmable remote controls are very easy to install and configure; they do not require wall mounting or connection to an air conditioner bus. However, there is a slight limitation due to the lack of feedback between devices. We cannot verify that the A/C has turned on and is executing exactly the command that we sent. However, we do it quickly and without damage to the apartment. To give a little more information to the remote control, you can install any Zigbee temperature and humidity sensor, for example [this one](https://vi.aliexpress.com/item/1005005595631552.html) for €10, and link the readings to the remote control. This way we have simple feedback, and the number of interesting scenarios increases.": "Программируемые пульты дистанционного управления очень легко устанавливаются и настраиваются; им не требуется крепление на стену или подключение к шине кондиционера. Однако есть небольшое ограничение из-за отсутствия обратной связи между устройствами. Мы не можем проверить, что кондиционер включился и выполняет именно ту команду, которую мы отправили. Однако мы делаем это быстро и без ущерба для квартиры. Чтобы дать немного больше информации пульту дистанционного управления, вы можете установить любой Zigbee датчик температуры и влажности, например [этот](https://vi.aliexpress.com/item/1005005595631552.html) за €10, и связать показания с пультом дистанционного управления. Таким образом у нас есть простая обратная связь, и количество интересных сценариев увеличивается.",
  "## Energy Meter": "## Энергомер",
  "There are semi-invasive meters for electricity consumption, such as the one in the image below:": "Существуют полуинвазивные счетчики для измерения потребления электроэнергии, например, как на изображении ниже:",
  "They must be powered by applying L and N to the input. On the other side, an induction ring is connected to the meter, which we hang on a phase or consumption line for measurement. Most houses and apartments have 3 phases, which means you need to install 3 such modules. I bought it on [Amazon](https://www.amazon.de/gp/product/B0C37DJXVD/) for €60, one for each phase. Older homes may only have one phase.": "Их необходимо питать, подключив L и N к входу. С другой стороны, к счетчику подключен индукционный кольцо, которое мы вешаем на фазовую или потребительскую линию для измерения. В большинстве домов и квартир есть 3 фазы, что означает, что вам нужно установить 3 таких модуля. Я купил его на [Amazon](https://www.amazon.de/gp/product/B0C37DJXVD/) за €60, по одному на каждую фазу. В старых домах может быть только одна фаза.",
  "## Conclusion": "## Заключение",
  "For me, a smart home is not a luxury, but a necessity. This is a place where I want to relax and spend time with my family, without wasting energy on solving everyday issues. The cost of the above kit in my case was about €500 and a couple of evenings. The result is invaluable!": "Для меня умный дом - это не роскошь, а необходимость. Это место, где я хочу отдыхать и проводить время с семьей, не тратя энергию на решение повседневных проблем. Стоимость вышеуказанного набора в моем случае составила около €500 и пару вечеров. Результат бесценен!"
}