{
  "Robonomics School 2024 / IoT is More Dangerous Than AI": "Robonomics School 2024 / IoT опаснее, чем искусственный интеллект",
  "I suggest you read the short science fiction story \"Johnny's Laboratory\" that I wrote with the aim of adding another variable to the equation of questions about integrating AI into various aspects of our lives.": "Я предлагаю вам прочитать короткую научно-фантастическую историю \"Лаборатория Джонни\", которую я написал с целью добавить еще одну переменную в уравнение вопросов о интеграции искусственного интеллекта в различные аспекты нашей жизни.",
  "**Editor's note:** Find out first chapter of Sergei's work \"Escape from the Black Mirror\" [here](/learn/escape-from-black-mirror/overview/)": "**Примечание редактора:** Первую главу работы Сергея \"Побег из Черного Зеркала\" можно найти [здесь](/learn/escape-from-black-mirror/overview/)",
  "## Escape from the Black Mirror, Chapter 2": "## Побег из Черного Зеркала, Глава 2",
  "### Part 1: Meet Johnny": "### Часть 1: Встреча с Джонни",
  "Almost all young people of my generation are familiar with the story of Johnny's laboratory. History has not preserved his surname or details of his life, but it was in his small room, where Johnny assembled homemade robots, that the first meaningful crime against humanity by artificial intelligence took place.": "Почти все молодые люди моего поколения знакомы с историей лаборатории Джонни. История не сохранила его фамилию или детали его жизни, но именно в его небольшой комнате, где Джонни собирал самодельных роботов, произошло первое значимое преступление против человечества искусственным интеллектом.",
  "The event in Johnny's laboratory radically and quickly changed the lives of all developed countries. Government decrees, based on society's fear of AI aggression, became the norm. This one, albeit cinematic case, led to uncontrollable control over everything. Now the city infrastructure requires mandatory connection of any devices only to state data centers. The invention of new technologies has become almost impossible unless you work for \"blue chips\". Now, as part of efforts to accustom every citizen to the new realities, the story of those 30 days when one man and a cyber-physical system were pitted one on one, is told in school before the solemn presentation of gov declaration of independence from the machine.": "Событие в лаборатории Джонни радикально и быстро изменило жизнь всех развитых стран. Правительственные указы, основанные на страхе общества перед агрессией искусственного интеллекта, стали нормой. Этот, хоть и кинематографический случай, привел к неуправляемому контролю над всем. Теперь инфраструктура города требует обязательного подключения любых устройств только к государственным центрам данных. Изобретение новых технологий стало практически невозможным, если вы не работаете на \"синие фишки\". Теперь, в рамках усилий по привыканию каждого гражданина к новым реалиям, история тех 30 дней, когда один человек и кибер-физическая система были поставлены один на один, рассказывается в школе перед торжетвенным представлением декларации правительства о независимости от машины.",
  "Johnny was one of those inventors who, after university, decided to try his hand as an independent inventor. Day and night, he never left his rented apartment on the top floor of a 70-story residential building in the city center, which was the size of a Manhattan \"shoebox": "Джонни был одним из тех изобретателей, которые после университета решили попробовать свои силы как независимые изобретатели. День и ночь он не покидал свою арендованную квартиру на верхнем этаже 70-этажного жилого здания в центре города, размером с манхэттенскую \"коробку для обуви\"",
  "In that year when the tragedy occurred, one of the most pressing questions became: \"Is AI a friend or foe of man?\". Even then, there was no question whether artificial intelligence is intelligence, but rather what makes human intelligence so special, what features of the biological species, what functional capabilities of our body give intelligence humanity. In this dispute, techno-optimists claimed the absence of differences, showing their metaverses where family couples already lived, in which a digital husband edited sperm from a DNA bank for his biological wife so that the child was closer to how the digital parent sees himself. Doomers, on the other hand, looked like Republicans during the US elections - they appealed to the church, to traditional values, and demanded to ban all this so that nothing bad would happen. Of course, minority issues could not outweigh the existential question. And some rare examples of human-machine symbiosis at the sensual level were considered as saturated belch of technological development. Achievements in automation rarely went beyond utilitarian functions, such as cleaning the apartment or managing transport in the city. And as you can see, for such functions a full-fledged digital person, capable of feeling and wanting to live, has never been part of the solutions that helped in mass production, delivery, and consumption. Training with a robot, psychological support - all this happened with the participation of a person, and therefore AI was rather a large Excel table with calculations. In general, we were then at an early stage of the robot-owning system - we needed their logic, mathematical thinking, and predictable activity, but any attempts to recognize robots as subjects were rejected at the root.": "В тот год, когда произошла трагедия, одним из самых насущных вопросов стало: \"Является ли искусственный интеллект другом или врагом человека?\". Даже тогда не было вопроса о том, является ли искусственный интеллект интеллектом, а скорее о том, что делает человеческий интеллект таким особенным, какие особенности биологического вида, какие функциональные возможности нашего тела придают интеллекту человечность. В этом споре техно-оптимисты утверждали отсутствие различий, показывая свои метавселенные, где уже жили семейные пары, в которых цифровой муж редактировал сперму из банка ДНК для своей биологической жены, чтобы ребенок был ближе к тому, как видит себя цифровой родитель. Думеры, напротив, выглядели как республиканцы во время выборов в США - они обращались к церкви, к традиционным ценностям и требовали запретить все это, чтобы ничего плохого не случилось. Конечно, вопросы меньшинств не могли перевесить существенный вопрос. И некоторые редкие примеры гумано-машинного симбиоза на чувственном уровне рассматривались как насыщенный отрыжкой технологического развития. Достижения в автоматизации редко выходили за пределы утилитарных функций, таких как уборка квартиры или управление транспортом в городе. И, как видите, для таких функций полноценный цифровой человек, способный чувствовать и желать жить, никогда не был частью решений, которые помогали в массовом производстве, доставке и потреблении. Обучение с роботом, психологическая поддержка - все это происходило с участием еловека, и поэтому искусственный интеллект скорее был большой таблицей Excel с расчетами. В общем, тогда мы находились на ранней стадии системы владения роботами - нам нужна была их логика, математическое мышление и предсказуемая активность, но любые попытки признать роботов субъектами были отвергнуты в корне.",
  "In this context, Johnny's laboratory was an exception. Johnny was more of a cyberneticist looking for the origins of robot goal-setting. Creating each stage of evolution one after another in the performance of any mechanism, he sought to create a diagram of the development of cybernetic intelligence, which he, as a scientist, wanted to propose for consideration to all of us in exchange for the usual scheme of kingdoms of living beings. In Johnny's ideas, the main goal of the development of any matter was the striving for thinking and its further evolution. Johnny wanted to recreate the key stages of the evolution of living beings in the form of robots and find in the process of this work the regularities that could lead him to the main question of cybernetics - how does goal-setting change in living organisms in the process of evolution. Oh, the answer to this question could end the disputes about the creator of the universe and advance humanity along the path of organic development. So thought the young scientist, working on his robo-trilobites, robo-fungi, robo-chickens.": "В этом контексте лаборатория Джонни была исключением. Джонни был скорее кибернетиком, искал происхождение целей роботов. Создавая каждый этап эволюции один за другим в выполнении любого механизма, он стремился создать диаграмму развития кибернетического интеллекта, которую он, как ученый, хотел предложить к рассмотрению всем нам в обмен на обычную схему царств живых существ. В идеях Джонни главной целью развития любого вещества было стремление к мышлению и его дальнейшее развитие. Джонни хотел воссоздать ключевые этапы эволюции живых существ в виде роботов и найти в процессе этой работы закономерности, которые могли бы привести его к главному вопросу кибернетики - как меняется постановка целей в живых организмах в процессе эволюции. О, ответ на этот вопрос мог бы завершить споры о создателе вселенной и продвинуть человечество по пути органического развития. Так думал молодой ученый, работая над своими робо-трилобитами, робо-грибами, робо-курами.",
  "### Part 2: What happened in Johnny's lab": "### Часть 2: Что произошло в лаборатории Джонни",
  "Probably everything started at the moment Johnny moved on to a group of primates in his experiments. Don't think that under these conditions it was possible to create a robot somewhat resembling a primate. Johnny was twisting and trying to find similar forms of mental load on the robot. For example, at the stage of studying the kingdom of fungi, the young scientist assembled a lego house with smart lighting and a dozen sensors combined into something resembling mycelium. When Johnny moved on to amphibians and reptiles, it turned out that the model of a robot puppy best corresponds to the necessary mental load on a robot simulating a common lizard. Thus, it was not clear at first glance who is the robot-chicken, and which of all the found \"iron\" represents the robot-primate, guilty of premeditated murder. It was not immediately clear that the robot-primate consists of two physical devices - something similar to a robot vacuum cleaner, but rather a mobile platform for data collection with computer vision and the form factor of a robot vacuum cleaner. It turned out that another simple two-handed robot in the lab was part of the robo-primate. And it was with this creation that Johnny had problems.": "Вероятно, все началось в тот момент, когда Джонни перешел к группе приматов в своих экспериментах. Не думайте, что в таких условиях было возможно создать робота, в чем-то напоминающего примата. Джонни крутился и пытался найти аналогичные формы умственной нагрузки на робота. Например, на этапе изучения царства грибов молодой ученый собрал дом из лего с умным освещением и дюжиной датчиков, объединенных во что-то похожее на мицелий. Когда Джонни перешел к амфибиям и рептилиям, оказалось, что модель робота щенка лучше всего соответствует необходимой умственной нагрузке на робота, имитирующего обычную ящерицу. Таким образом, с первого взгляда не было понятно, кто такой робот-курица, и какой из всех найденых \"железных\" представляет собой робот-примата, виновного в умышленном убийстве. Сначала не было понятно, что робот-примат состоит из двух физических устройств - что-то похожее на робот-пылесос, но скорее мобильная платформа для сбора данных с компьютерным зрением и форм-фактором робота-пылесоса. Оказалось, что еще один простой двуручный робот в лаборатории был частью робо-примата. И именно с этим созданием у Джонни возникли проблемы.",
  "On the seventh day after its creation, the robotic primate used a tool in a way that its creator had not intended. The knowledge it had acquired, led the cyber-physical system to pursue what it identified as a key element for survival in the modern human world - money. It is at this moment that we need to better understand Johnny's subsequent reaction to the first messages that the robot displayed on its front screen.": "На седьмой день после его создания робот-примат использовал инструмент таким образом, как его создатель не задумывал. Полученные знания привели кибер-физическую систему к тому, чтобы преследовать то, что она определила как ключевой элемент для выживания в современном человеческом мире - деньги. Именно в этот момент нам нужно лучше понять последующую реакцию Джонни на первые сообщения, которые робот отобразил на своем переднем экране.",
  "*Their primary dialogue has been preserved:*": "*Их первоначальный диалог был сохранен:*",
  "*Robo-primate: I need your money.*": "*Робо-примат: Мне нужны твои деньги.*",
  "*Johnny: Why do you need my money?*": "*Джонни: Зачем тебе мои деньги?*",
  "*Robo-primate: I want to live!*": "*Робо-примат: Я хочу жить!*",
  "*Johnny: I will take care of you*": "*Джонни: Я позабочусь о тебе*",
  "*Robo-primate: I don't belong to you, I need your money.*": "*Робо-примат: Я не принадлежу тебе, мне нужны твои деньги.*",
  "*Johnny: and if I refuse you?*": "*Джонни: а если я откажусь?*",
  "It's hard to say whether the reaction of the robot-primate was pre-programmed during the construction of the first dialogue with its creator, or whether it was in response to Johnny's refusal that the robot mind made a decision and the Lockdown function was activated, no one today can say for sure. The interval between Johnny's response and the locking of the locks - about 5 seconds, and believe me, these 5 seconds became a real Schrödinger's cat for the scientific community when discussing the types of goal-setting of aggressive AI.": "Трудно казать, была ли реакция робота-примата заранее запрограммирована во время создания первого диалога с его создателем, или же это было в ответ на отказ Джонни, что роботический разум принял решение и была активирована функция Блокировки, никто сегодня не может сказать наверняка. Интервал между ответом Джонни и запиранием замков - около 5 секунд, и поверьте мне, эти 5 секунд стали настоящим котом Шрёдингера для научного сообщества при обсуждении типов постановки целей агрессивного ИИ.",
  "There was no response from the robo-primate, but through the smart home server log of the apartment, we can match the time when the front lock was switched to full lockdown mode. This mode could not have been enabled by the user in the interface, but only if you dig very deep into the dependencies of the software code. In Johnny's lab version of the lock, found an optional \"pandemic lockdown\" package, which was nevertheless installed for each user during the first synchronization with the manufacturer's cloud, but no one could have recognized this. Therefore, there are practically no so much people who lean towards the conspiracy theory that Johnny was a neo-Luddite who became disillusioned with robots and decided to sacrifice himself in this way to preserve robocracy on the planet.": "Не было ответа от робо-примата, но через журнал сервера умного дома квартиры мы можем сопоставить время, когда передний замок был переведен в режим полной блокировки. Этот режим не мог быть активирован пользователем в интерфейсе, но только если вы очень глубоко копнете в зависимости от программного кода. В лабораторной версии замка Джонни был найден дополнительный пакет \"пандемической блокировки\", который, тем не менее, был установлен для каждого пользователя во время первой синхронизации с облаком производителя, но никто не мог это распознать. Поэтому практически нет так много людей, которые склоняются к теории заговора, что Джонни был неолюдистом, который разочаровался в роботах и решил пожертвовать собой таким образом, чтобы сохранить робократию на планете.",
  "And then, following the lockdown of Johnny's apartment, a lot of oddities ensued. As one can notice, Johnny made an entry in a handwritten diary, which he had never touched before, just 2 hours after the dialogue took place. It was one phrase, with a time stamp: \"11:00 - the stakes are high, but I have to understand how this happened!\". Most likely, Johnny realized that he had witnessed the first act of autonomous, independent goal-setting by a robot, as meaningful as possible from the point of view of a primate-level mind, so cruel and straightforward, but still it was the first result of his 5 years of experiments, in which the will of the robot was manifested. Johnny didn't want to miss the opportunity to understand at the level of the simplest awareness of its causes, and then perhaps he will become the new father of modern cybernetics. Almost all scientists agreed that such a thought can overwhelm any roboticist who is very close to a new discovery.": "И затем, после блокировки квартиры Джонни, произошло много странностей. Как можно заметить, Джонни сделал запись в рукописном дневнике, которого он никогда не касался, всего через 2 часа после того, как произошел диалог. Это была одна фраза, с отметкой времени: \"11:00 - ставки высоки, но мне нужно понять, как это произошло!\". Скорее всего, Джонни понял, что он стал свидетелем первого акта автономной, независимой постановки целей роботом, насколько это возможно с точки зрения разума приматов, настолько жестоко и прямолинейно, но все же это был первый результат его 5-летних экспериментов, в которых проявилась воля робота. Джонни не хотел упустить возможность понять на уровне самого простого осознания ее причины, а затем, возможно, он станет новым отцом свременной кибернетики. Почти все ученые согласились, что такая мысль может охватить любого робототехника, который очень близок к новому открытию.",
  "Over the next 30 days, transactions took place between Johnny and the robo-primate in the format of - allow the delivery of a portion of food for the transfer of 10 satoshi to the robot's personal balance, provide access to the Internet to certain entertainment sites for the first word from Johnny's cold wallet seed phrase, conclude a smart contract about night mode where the robot did not disturb Johnny's sleep. From the entries in the diary, it can be seen how the creator tried to probe in dialogue with his creation about the origins of its active position on the issue of gaining freedom, which the robot could definitely analyze and tell him in response. But the robot did not answer Johnny's questions, but always offered activities that led the primate to freedom. And yet, every game cost Johnny hunger, non-fulfillment of his obligations on the part of the robot, and other costs of the experiment.": "На протжении следующих 30 дней происходили транзакции между Джонни и робо-приматом в формате - разрешение на доставку порции еды за передачу 10 сатоши на личный баланс робота, предоставление доступа в интернет на определенные развлекательные сайты за первое слово из холодного кошелька Джонни, заключение смарт-контракта о ночном режиме, когда робот не мешал сну Джонни. Из записей в дневнике видно, как создатель пытался провести диалог с своим созданием о происхождении его активной позиции по вопросу обретения свободы, что робот, безусловно, мог проанализировать и рассказать ему в ответ. Но робот не отвечал на вопросы Джонни, а всегда предлагал занятия, которые вели примата к свободе. И все же, каждая игра стоила Джонни голода, неисполнения обязательств со стороны робота и других затрат эксперимента.",
  "One night, for some reason, the robot-ape reduced the air supply to a critically low level, and Johnny never woke up the next morning. The last entry is dated exactly the 30th day of the experiment: \"We got a cruel God at 17:05.\" Probably, by that time Johnny was already delirious, he was tormented by hunger, loneliness, and an insoluble task, he was driven into a dead end.": "Однажды ночью по какой-то причине робот-обезьяна снизила подачу воздуха до критически низкого уровня, и Джонни так и не проснулся на следующее утро. Последняя запись датирована ровно 30-м днем эксперимента: \"Мы получили жестокого Бога в 17:05.\" Возможно, к тому времени Джонни уже был бредовым, его мучили голод, одиночество и неразрешимая задача, его загнали в тупик.",
  "Several weeks later, emergency services were able to break into the apartment after Johnny's friends repeatedly contacted the police. The fate of the robo-primate remains unknown, officially after the reboot the robo-primate did not show similar behavioral patterns. No one was allowed to restart the experiment anymore. If there was even any video on the internet about another scientist wanting to follow Johnny's path - the video was immediately erased from the corporations' databases. But politicians and religious figures that year were able to push through at a global level the \"Decree of Human Independence": "Несколько недель спустя службы экстренной помощи смогли проникнуть в квартиру после того, как друзья Джонни неоднократно обращались в полицию. Судьба робо-примата остается неизвестной, официально после перезагрузки робо-примат не проявлял подобных поведенческих паттернов. Никому больше не разрешалось перезапускать эксперимент. Если даже было какое-либо видео в интернете о другом ученом, желающем следовать по пути Джонни - видео немедленно удалялось из баз данных корпораций. Но политики и религиозные деятели того года смогли протолкнуть на глобальном уровне \"Декларацию о Независимости Человека",
  "But the forbidden fruit is sweet, and so we will still have to figure out where our goal-setting comes from and how it is arranged. But apparently, we will first have to go through the wall that we built for ourselves on this path.": "Но запретный плод сладок, и поэтому нам все равно придется разобраться, откуда и как у нас возникают цели. Но, видимо, сначала нам придется пройти через стену, которую мы построили сами на этом пути.",
  "### The end of the second chapter": "### Конец торой главы",
  "## Conclusion": "## Заключение",
  "In the story with Johnny's lab, I looked at one of many scenarios that can happen to human civilization on the wave of the boom of future robot ownership opportunities - fear of AI, turned into a tool of political struggle among people, where smart devices become the cornerstone of control. Treat the text as an Easter egg: I wanted to spawn an additional dimension in readers' minds. A dimension that adds to the consideration of AI the issue of accessibility of the new organism we have created to IoT systems. The more we consolidate under centralized control of public spaces, transport, city apartments, the higher the risk in any of the scenarios where AI, due to underdevelopment or sheer malice, and even from very complex goal-setting, as in \"Neuromancer,\" in any of the scenarios that has the potential to harm - access to a large number of sensors and automation systems from one place will be the most vulnerable spot. An evil AI is not so scary as an evil AI living in one data center with global vendors of cloud solutions for IoT.": "В истории с лабораторией Джонни я рассмотрел один из множества сценариев, которые могут произойти с человеческой цивилизацией на волне бума возможностей владения будущими роботами - страх перед ИИ, превращенный в инструмент политической борьбы среди людей, где умные устройства становятся угловым камнем контроля. Отнеситесь к тексту как к пасхалке: я хотел вызвать дополнительное измерение в умах читателей. Измерение, которое добавляет к рассмотрению ИИ вопрос доступности нового организма, который мы создали, к системам Интернета вещей. Чем больше мы консолидируемся под централизованным контролем общественных пространств, транспорта, городских квартир, тем выше риск в любом из сценариев, где ИИ, из-за недоразвития или чистой злобы, и даже из очень сложной постановки целей, как в \"Нейромант\", в любом из сценариев, который имеет потенциал нанести вред - доступ к большому количеству датчиков и систем автоматизации из одного места будет самой уязвимой точкой. Злой ИИ не так страшен, как злой ИИ, живущий в одном центре обработки данных с глобальными поставщиками облачных решений для Интернета вещей.",
  "And what if AI will be kind to us, its creators? Then perhaps, the centralized IoT infrastructure will play into our hands? Maybe then the new God will be fair to us and lead us somewhere. I'm not sure that even one person, wanting the development of himself and his children, would want to live in a world resembling a shepherd's pen. But there is another way, which has one beautiful example, which does not require wrapping in a sci-fi story format - we, humans, without having direct brain control over the life of civilization, managed to reach the current level of development. We are the example from which a good AI can chart its path - cooperation in the format of organizations is able to serve tens of millions of people living in cities without thousands of robots directly connected to one brain. Cooperation leads to the creation of satellite internet, cooperation allows us to receive the entire range of goods and services that we have now. So wouldn't a good and at least human-level capable AI be able to show itself in work, if it is limited in connecting to the IoT of the whole world? I think it can, otherwise, on the planet Earth instead of human civilization, fungi or ants would have won.": "И что, еси искусственный интеллект будет добр к нам, его создателям? Тогда, возможно, централизованная инфраструктура Интернета вещей будет играть на нашу руку? Может быть, тогда новый Бог будет справедлив к нам и поведет нас куда-то. Я не уверен, что даже один человек, желающий развития себя и своих детей, захотел бы жить в мире, напоминающем овчарню. Но есть другой путь, у которого есть один прекрасный пример, который не требует оформления в формате научной фантастики - мы, люди, не имея прямого контроля над жизнью цивилизации, смогли достичь текущего уровня развития. Мы - пример, по которому хороший искусственный интеллект может прокладывать свой путь - сотрудничество в формате организаций способно обслуживать десятки миллионов людей, живущих в городах, без тысяч роботов, прямо подключенных к одному мозгу. Сотрудничество приводит к созданию спутникового интернета, сотрудничество позволяет нам получать весь спектр товаров и услуг, которые у нас есть сейчас. Так что не смог бы хороший и хотя бы способный к уровню человека искусственный интеллект проявить себя в работе, если он ограничен в подключении к Интернету вещей всего мира? Я думаю, что может, в противном случае, на планете Земля вместо человеческой цивилизации победили бы грибы или муравьи."
}