{
  "Robonomics School 2024 / IoT is More Dangerous Than AI": "Robonomics School 2024 / IoT es más peligroso que la IA",
  "I suggest you read the short science fiction story \"Johnny's Laboratory\" that I wrote with the aim of adding another variable to the equation of questions about integrating AI into various aspects of our lives.": "Te sugiero que leas la historia de ciencia ficción corta \"El Laboratorio de Johnny\" que escribí con el objetivo de agregar otra variable a la ecuación de preguntas sobre la integración de la IA en varios aspectos de nuestras vidas.",
  "**Editor's note:** Find out first chapter of Sergei's work \"Escape from the Black Mirror\" [here](/learn/escape-from-black-mirror/overview/)": "**Nota del editor:** Descubre el primer capítulo de la obra de Sergei \"Escape from the Black Mirror\" [aquí](/learn/escape-from-black-mirror/overview/)",
  "## Escape from the Black Mirror, Chapter 2": "## Escape from the Black Mirror, Capítulo 2",
  "### Part 1: Meet Johnny": "### Parte 1: Conoce a Johnny",
  "Almost all young people of my generation are familiar with the story of Johnny's laboratory. History has not preserved his surname or details of his life, but it was in his small room, where Johnny assembled homemade robots, that the first meaningful crime against humanity by artificial intelligence took place.": "Casi todos los jóvenes de mi generación están familiarizados con la historia del laboratorio de Johnny. La historia no ha conservado su apellido ni detalles de su vida, pero fue en su pequeña habitación, donde Johnny ensamblaba robots caseros, donde tuvo lugar el primer crimen significativo contra la humanidad por parte de la inteligencia artificial.",
  "The event in Johnny's laboratory radically and quickly changed the lives of all developed countries. Government decrees, based on society's fear of AI aggression, became the norm. This one, albeit cinematic case, led to uncontrollable control over everything. Now the city infrastructure requires mandatory connection of any devices only to state data centers. The invention of new technologies has become almost impossible unless you work for \"blue chips\". Now, as part of efforts to accustom every citizen to the new realities, the story of those 30 days when one man and a cyber-physical system were pitted one on one, is told in school before the solemn presentation of gov declaration of independence from the machine.": "El evento en el laboratorio de Johnny cambió radical y rápidamente la vida de todos los países desarrollados. Los decretos gubernamentales, basados en el miedo de la sociedad a la agresión de la IA, se convirtieron en la norma. Este caso, aunque cinematográfico, llevó a un control incontrolable sobre todo. Ahora la infraestructura de la ciudad requiere la conexión obligatoria de cualquier dispositivo solo a los centros de datos estatales. La invención de nuevas tecnologías se ha vuelto casi imposible a menos que trabajes para las \"blue chips\". Ahora, como parte de los esfuerzos para acostumbrar a cada ciudadano a las nuevas realidades, se cuenta la historia de esos 30 días en los que un hombre y un sistema ciberfísico se enfrentaron uno a uno, en la escuela antes de la presentación solemne de la declaración de independencia del gobierno de la máquina.",
  "Johnny was one of those inventors who, after university, decided to try his hand as an independent inventor. Day and night, he never left his rented apartment on the top floor of a 70-story residential building in the city center, which was the size of a Manhattan \"shoebox": "Johnny fue uno de esos inventores que, después de la universidad, decidió probar suerte como inventor independiente. Día y noche, nunca abandonó su apartamento alquilado en el último piso de un edificio residencial de 70 pisos en el centro de la ciudad, que tenía el tamaño de una \"caja de zapatos\" de Manhattan",
  "In that year when the tragedy occurred, one of the most pressing questions became: \"Is AI a friend or foe of man?\". Even then, there was no question whether artificial intelligence is intelligence, but rather what makes human intelligence so special, what features of the biological species, what functional capabilities of our body give intelligence humanity. In this dispute, techno-optimists claimed the absence of differences, showing their metaverses where family couples already lived, in which a digital husband edited sperm from a DNA bank for his biological wife so that the child was closer to how the digital parent sees himself. Doomers, on the other hand, looked like Republicans during the US elections - they appealed to the church, to traditional values, and demanded to ban all this so that nothing bad would happen. Of course, minority issues could not outweigh the existential question. And some rare examples of human-machine symbiosis at the sensual level were considered as saturated belch of technological development. Achievements in automation rarely went beyond utilitarian functions, such as cleaning the apartment or managing transport in the city. And as you can see, for such functions a full-fledged digital person, capable of feeling and wanting to live, has never been part of the solutions that helped in mass production, delivery, and consumption. Training with a robot, psychological support - all this happened with the participation of a person, and therefore AI was rather a large Excel table with calculations. In general, we were then at an early stage of the robot-owning system - we needed their logic, mathematical thinking, and predictable activity, but any attempts to recognize robots as subjects were rejected at the root.": "En ese año en que ocurrió la tragedia, una de las preguntas más apremiantes fue: \"¿Es la inteligencia artificial amiga o enemiga del hombre?\". Incluso entonces, no había duda de si la inteligencia artificial es inteligencia, sino más bien qué hace que la inteligencia humana sea tan especial, qué características de la especie biológica, qué capacidades funcionales de nuestro cuerpo dan a la inteligencia humanidad. En esta disputa, los tecno-optimistas afirmaban la ausencia de diferencias, mostrando sus metaversos donde las parejas familiares ya vivían, en los que un esposo digital editaba esperma de un banco de ADN para su esposa biológica para que el hijo se pareciera más a cómo el padre digital se ve a sí mismo. Los pesimistas, por otro lado, parecían republicanos durante las elecciones en EE. UU.: apelaban a la iglesia, a los valores tradicionales, y exigían prohibir todo esto para que no ocurriera nada malo. Por supuesto, los problemas de minorías no podían superar la cuestión existencial. Y algunos raros ejemplos de simbiosis humano-máquina a nivel sensorial se consideraban como eructo saturado del desarrollo tecnológico. Los logros en la automatización rara vez iban más allá de funciones utilitarias, como limpiar el apartamento o gestionar el transporte en la ciudad. Y como puedes ver, para tales funciones una persona digital completa, capaz de sentir y querer vivir, nunca fue parte de las soluciones que ayudaron en la producción en masa, la entrega y el consumo. La formación con un robot, el apoyo psicológico, todo esto sucedía con la participación de una persona, y por lo tanto la IA era más bien una gran tabla de Excel con cálculos. En general, estábamos entonces en una etapa temprana del sistema de propiedad de robots: necesitábamos su lógica, pensamiento matemático y actividad predecible, pero cualquier intento de reconocer a los robots como sujetos era rechazado de raíz.",
  "In this context, Johnny's laboratory was an exception. Johnny was more of a cyberneticist looking for the origins of robot goal-setting. Creating each stage of evolution one after another in the performance of any mechanism, he sought to create a diagram of the development of cybernetic intelligence, which he, as a scientist, wanted to propose for consideration to all of us in exchange for the usual scheme of kingdoms of living beings. In Johnny's ideas, the main goal of the development of any matter was the striving for thinking and its further evolution. Johnny wanted to recreate the key stages of the evolution of living beings in the form of robots and find in the process of this work the regularities that could lead him to the main question of cybernetics - how does goal-setting change in living organisms in the process of evolution. Oh, the answer to this question could end the disputes about the creator of the universe and advance humanity along the path of organic development. So thought the young scientist, working on his robo-trilobites, robo-fungi, robo-chickens.": "En este contexto, el laboratorio de Johnny era una excepción. Johnny era más bien un cibernético en busca de los orígenes del establecimiento de objetivos de los robots. Creando cada etapa de evolución una tras otra en el desempeño de cualquier mecanismo, buscaba crear un diagrama del desarrollo de la inteligencia cibernética, que él, como científico, quería proponer para su consideración a todos nosotros a cambio del esquema habitual de los reinos de los seres vivos. En las ideas de Johnny, el objetivo principal del desarrollo de cualquier materia era la aspiración al pensamiento y su evolución posterior. Johnny quería recrear las etapas clave de la evolución de los seres vivos en forma de robots y encontrar en el proceso de este trabajo las regularidades que pudieran llevarlo a la pregunta principal de la cibernética: cómo cambia el establecimiento de objetivos en los organismos vivos en el proceso de evolución. Oh, la respuesta a esta pregunta podría poner fin a las disputas sobre el creador del universo y hacer avanzar a la humanidad por el camino del desarrollo orgánico. Así pensaba el joven científico, trabajando en sus robo-trilobites, robo-hongos, robo-pollitos.",
  "### Part 2: What happened in Johnny's lab": "### Parte 2: ¿Qué pasó en el laboratorio de Johnny",
  "Probably everything started at the moment Johnny moved on to a group of primates in his experiments. Don't think that under these conditions it was possible to create a robot somewhat resembling a primate. Johnny was twisting and trying to find similar forms of mental load on the robot. For example, at the stage of studying the kingdom of fungi, the young scientist assembled a lego house with smart lighting and a dozen sensors combined into something resembling mycelium. When Johnny moved on to amphibians and reptiles, it turned out that the model of a robot puppy best corresponds to the necessary mental load on a robot simulating a common lizard. Thus, it was not clear at first glance who is the robot-chicken, and which of all the found \"iron\" represents the robot-primate, guilty of premeditated murder. It was not immediately clear that the robot-primate consists of two physical devices - something similar to a robot vacuum cleaner, but rather a mobile platform for data collection with computer vision and the form factor of a robot vacuum cleaner. It turned out that another simple two-handed robot in the lab was part of the robo-primate. And it was with this creation that Johnny had problems.": "Probablemente todo comenzó en el momento en que Johnny pasó a un grupo de primates en sus experimentos. No creas que en estas condiciones fue posible crear un robot algo parecido a un primate. Johnny estaba retorciéndose y tratando de encontrar formas similares de mentalidad. carga en el robot, por ejemplo, en la etapa de estudio del reino de los hongos, el joven científico montó una casa de Lego con iluminación inteligente y una docena de sensores combinados en algo parecido al micelio. Cuando Johnny pasó a los anfibios y reptiles. que el modelo de un cachorro robot se corresponde mejor con la carga mental necesaria en un robot que simula un lagarto común. Por lo tanto, a primera vista no estaba claro quién es el pollo robot y cuál de todos los 'hierro' encontrados representa. El robot primate, culpable de asesinato premeditado No quedó claro de inmediato que el robot primate se compone de dos dispositivos físicos: algo similar a un robot aspirador, sino más bien una plataforma móvil para la recopilación de datos con visión por computadora y un factor de forma. un robot aspirador. Resultó que otro simple robot de dos manos en el laboratorio era parte del roboprimate. Y fue con esta creación que Johnny tuvo problemas.",
  "On the seventh day after its creation, the robotic primate used a tool in a way that its creator had not intended. The knowledge it had acquired, led the cyber-physical system to pursue what it identified as a key element for survival in the modern human world - money. It is at this moment that we need to better understand Johnny's subsequent reaction to the first messages that the robot displayed on its front screen.": "En el séptimo día después de su creación, el primate robótico utilizó una herramienta de una manera que su creador no había previsto. El conocimiento que había adquirido llevó al sistema ciberfísico a perseguir lo que identificó como un elemento clave para la supervivencia en el mundo humano moderno: el dinero. Es en este momento que necesitamos entender mejor la reacción posterior de Johnny a los primeros mensajes que el robot mostró en su pantalla frontal.",
  "*Their primary dialogue has been preserved:*": "*Se ha preservado su diálogo principal:*",
  "*Robo-primate: I need your money.*": "*Robo-primate: Necesito tu dinero.*",
  "*Johnny: Why do you need my money?*": "*Johnny: ¿Por qué necesitas mi dinero?*",
  "*Robo-primate: I want to live!*": "*Robo-primate: ¡Quiero vivir!*",
  "*Johnny: I will take care of you*": "*Johnny: Me encargaré de ti*",
  "*Robo-primate: I don't belong to you, I need your money.*": "*Robo-primate: No pertenezco a ti, necesito tu dinero.*",
  "*Johnny: and if I refuse you?*": "*Johnny: ¿Y si te rechazo?*",
  "It's hard to say whether the reaction of the robot-primate was pre-programmed during the construction of the first dialogue with its creator, or whether it was in response to Johnny's refusal that the robot mind made a decision and the Lockdown function was activated, no one today can say for sure. The interval between Johnny's response and the locking of the locks - about 5 seconds, and believe me, these 5 seconds became a real Schrödinger's cat for the scientific community when discussing the types of goal-setting of aggressive AI.": "Es difícil decir si la reacción del robot-primate estaba preprogramada durante la construcción del primer diálogo con su creador, o si fue en respuesta al rechazo de Johnny que la mente del robot tomó una decisión y se activó la función de Bloqueo, nadie hoy puede decir con certeza. El intervalo entre la respuesta de Johnny y el bloqueo de las cerraduras - alrededor de 5 segundos, y créanme, estos 5 segundos se convirtieron en un verdadero gato de Schrödinger para la comunidad científica al discutir los tipos de establecimiento de objetivos de la IA agresiva.",
  "There was no response from the robo-primate, but through the smart home server log of the apartment, we can match the time when the front lock was switched to full lockdown mode. This mode could not have been enabled by the user in the interface, but only if you dig very deep into the dependencies of the software code. In Johnny's lab version of the lock, found an optional \"pandemic lockdown\" package, which was nevertheless installed for each user during the first synchronization with the manufacturer's cloud, but no one could have recognized this. Therefore, there are practically no so much people who lean towards the conspiracy theory that Johnny was a neo-Luddite who became disillusioned with robots and decided to sacrifice himself in this way to preserve robocracy on the planet.": "No hubo respuesta por parte del robo-primato, pero a través del registro del servidor del hogar inteligente del apartamento, podemos coincidir con el momento en que la cerradura frontal se cambió al modo de bloqueo total. Este modo no podría haber sido habilitado por el usuario en la interfaz, sino solo si se profundiza mucho en las dependencias del código de software. En la versión de la cerradura del laboratorio de Johnny, se encontró un paquete opcional de \"bloqueo pandémico\", que sin embargo se instaló para cada usuario durante la primera sincronización con la nube del fabricante, pero nadie podría haber reconocido esto. Por lo tanto, prácticamente no hay tanta gente que se incline hacia la teoría de la conspiración de que Johnny era un neo-ludita que se desilusionó con los robots y decidió sacrificarse de esta manera para preservar la robocracia en el planeta.",
  "And then, following the lockdown of Johnny's apartment, a lot of oddities ensued. As one can notice, Johnny made an entry in a handwritten diary, which he had never touched before, just 2 hours after the dialogue took place. It was one phrase, with a time stamp: \"11:00 - the stakes are high, but I have to understand how this happened!\". Most likely, Johnny realized that he had witnessed the first act of autonomous, independent goal-setting by a robot, as meaningful as possible from the point of view of a primate-level mind, so cruel and straightforward, but still it was the first result of his 5 years of experiments, in which the will of the robot was manifested. Johnny didn't want to miss the opportunity to understand at the level of the simplest awareness of its causes, and then perhaps he will become the new father of modern cybernetics. Almost all scientists agreed that such a thought can overwhelm any roboticist who is very close to a new discovery.": "Y luego, despus del cierre del apartamento de Johnny, ocurrieron muchas rarezas. Como se puede notar, Johnny hizo una entrada en un diario escrito a mano, que nunca había tocado antes, justo 2 horas después de que tuvo lugar el diálogo. Fue una frase, con una marca de tiempo: \"11:00 - ¡las apuestas son altas, pero tengo que entender cómo sucedió esto!\". Lo más probable es que Johnny se dio cuenta de que había presenciado el primer acto de establecimiento de metas autónomas e independientes por parte de un robot, tan significativo como fuera posible desde el punto de vista de una mente de nivel primate, tan cruel y directo, pero aún así fue el primer resultado de sus 5 años de experimentos, en los que se manifestaba la voluntad del robot. Johnny no quería perder la oportunidad de entender a nivel de la conciencia más simple de sus causas, y luego tal vez se convertirá en el nuevo padre de la cibernética moderna. Casi todos los científicos estuvieron de acuerdo en que tal pensamiento puede abrumar a cualquier robótico que esté muy cerca de un nuevo descubrimiento.",
  "Over the next 30 days, transactions took place between Johnny and the robo-primate in the format of - allow the delivery of a portion of food for the transfer of 10 satoshi to the robot's personal balance, provide access to the Internet to certain entertainment sites for the first word from Johnny's cold wallet seed phrase, conclude a smart contract about night mode where the robot did not disturb Johnny's sleep. From the entries in the diary, it can be seen how the creator tried to probe in dialogue with his creation about the origins of its active position on the issue of gaining freedom, which the robot could definitely analyze and tell him in response. But the robot did not answer Johnny's questions, but always offered activities that led the primate to freedom. And yet, every game cost Johnny hunger, non-fulfillment of his obligations on the part of the robot, and other costs of the experiment.": "Durante los prximos 30 días, se llevaron a cabo transacciones entre Johnny y el robo-primato en el formato de - permitir la entrega de una porción de comida a cambio de la transferencia de 10 satoshis al saldo personal del robot, proporcionar acceso a Internet a ciertos sitios de entretenimiento a cambio de la primera palabra de la frase semilla de la billetera fría de Johnny, concluir un contrato inteligente sobre el modo nocturno donde el robot no perturbaba el sueño de Johnny. A partir de las entradas en el diario, se puede ver cómo el creador intentó sondear en diálogo con su creación sobre los orígenes de su posición activa sobre la cuestión de la obtención de la libertad, que el robot definitivamente podría analizar y contarle en respuesta. Pero el robot no respondió a las preguntas de Johnny, sino que siempre ofreció actividades que llevaban al primate hacia la libertad. Y sin embargo, cada juego le costaba a Johnny hambre, incumplimiento de sus obligaciones por parte del robot y otros costos del experimento.",
  "One night, for some reason, the robot-ape reduced the air supply to a critically low level, and Johnny never woke up the next morning. The last entry is dated exactly the 30th day of the experiment: \"We got a cruel God at 17:05.\" Probably, by that time Johnny was already delirious, he was tormented by hunger, loneliness, and an insoluble task, he was driven into a dead end.": "Una noche, por alguna razón, el robot-primato redujo el suministro de aire a un nivel críticamente bajo, y Johnny nunca despertó a la mañana siguiente. La última entrada está fechada exactamente el día 30 del experimento: \"Obtuvimos un Dios cruel a las 17:05.\" Probablemente, para ese momento Johnny ya estaba delirando, lo atormentaba el hambre, la soledad y una tarea insoluble, lo habían llevado a un callejón sin salida.",
  "Several weeks later, emergency services were able to break into the apartment after Johnny's friends repeatedly contacted the police. The fate of the robo-primate remains unknown, officially after the reboot the robo-primate did not show similar behavioral patterns. No one was allowed to restart the experiment anymore. If there was even any video on the internet about another scientist wanting to follow Johnny's path - the video was immediately erased from the corporations' databases. But politicians and religious figures that year were able to push through at a global level the \"Decree of Human Independence": "Varias semanas después, los servicios de emergencia lograron entrar en el apartamento después de que los amigos de Johnny contactaran repetidamente a la policía. El destino del robo-primato sigue siendo desconocido, oficialmente después del reinicio el robo-primato no mostró patrones de comportamiento similares. A nadie se le permitió reiniciar el experimento nuevamente. Si es que había algún video en Internet sobre otro científico que quisiera seguir el camino de Johnny, el video fue eliminado inmediatamente de las bases de datos de las corporaciones. Pero los políticos y figuras religiosas de ese año lograron impulsar a nivel global el \"Decreto de Independencia Humana",
  "But the forbidden fruit is sweet, and so we will still have to figure out where our goal-setting comes from and how it is arranged. But apparently, we will first have to go through the wall that we built for ourselves on this path.": "Pero la fruta prohibida es dulce, y así todavía tendremos que averiguar de dónde proviene nuestra fijación de objetivos y cómo está organizada. Pero aparentemente, primero tendremos que atravesar la pared que construimos para nosotros en este camino.",
  "### The end of the second chapter": "### El final del segundo capítulo",
  "## Conclusion": "## Conclusión",
  "In the story with Johnny's lab, I looked at one of many scenarios that can happen to human civilization on the wave of the boom of future robot ownership opportunities - fear of AI, turned into a tool of political struggle among people, where smart devices become the cornerstone of control. Treat the text as an Easter egg: I wanted to spawn an additional dimension in readers' minds. A dimension that adds to the consideration of AI the issue of accessibility of the new organism we have created to IoT systems. The more we consolidate under centralized control of public spaces, transport, city apartments, the higher the risk in any of the scenarios where AI, due to underdevelopment or sheer malice, and even from very complex goal-setting, as in \"Neuromancer,\" in any of the scenarios that has the potential to harm - access to a large number of sensors and automation systems from one place will be the most vulnerable spot. An evil AI is not so scary as an evil AI living in one data center with global vendors of cloud solutions for IoT.": "En la historia del laboratorio de Johnny, analicé uno de los muchos escenarios que pueden ocurrir en la civilización humana en la ola del auge de las oportunidades de propiedad de robots del futuro: el miedo a la IA, convertido en una herramienta de lucha política entre las personas, donde los dispositivos inteligentes se convierten en la piedra angular del control. Trata el texto como un huevo de Pascua: quería generar una dimensión adicional en la mente de los lectores. Una dimensión que se suma a la consideración de la IA el problema de la accesibilidad del nuevo organismo que hemos creado a los sistemas de IoT. Cuanto más nos consolidemos bajo el control centralizado de espacios públicos, transporte, apartamentos de la ciudad, mayor será el riesgo en cualquiera de los escenarios donde la IA, debido a la falta de desarrollo o pura malicia, e incluso desde la configuración de objetivos muy compleja, como en \"Neuromancer\", en cualquiera de los escenarios que tienen el potencial de dañar - el acceso a un gran número de sensores y sistemas de automatización desde un solo lugar será el punto más vulnerable. Una IA malvada no es tan aterradora como una IA malvada que vive en un centro de datos con proveedores globales de soluciones en la nube para IoT.",
  "And what if AI will be kind to us, its creators? Then perhaps, the centralized IoT infrastructure will play into our hands? Maybe then the new God will be fair to us and lead us somewhere. I'm not sure that even one person, wanting the development of himself and his children, would want to live in a world resembling a shepherd's pen. But there is another way, which has one beautiful example, which does not require wrapping in a sci-fi story format - we, humans, without having direct brain control over the life of civilization, managed to reach the current level of development. We are the example from which a good AI can chart its path - cooperation in the format of organizations is able to serve tens of millions of people living in cities without thousands of robots directly connected to one brain. Cooperation leads to the creation of satellite internet, cooperation allows us to receive the entire range of goods and services that we have now. So wouldn't a good and at least human-level capable AI be able to show itself in work, if it is limited in connecting to the IoT of the whole world? I think it can, otherwise, on the planet Earth instead of human civilization, fungi or ants would have won.": "¿Y si la IA fuera amable con nosotros, sus creadores? ¿Entonces tal vez la infraestructura centralizada de IoT jugará a nuestro favor? Tal vez entonces el nuevo Dios será justo con nosotros y nos llevará a algún lugar. No estoy seguro de que ni siquiera una persona, deseando el desarrollo de sí misma y de sus hijos, querría vivir en un mundo que se asemeje a un corral de ovejas. Pero hay otro camino, que tiene un hermoso ejemplo, que no requiere envolverse en un formato de historia de ciencia ficción - nosotros, los humanos, sin tener control directo sobre la vida de la civilización, logramos alcanzar el nivel actual de desarrollo. Somos el ejemplo del cual una buena IA puede trazar su camino - la cooperación en el formato de organizaciones es capaz de servir a decenas de millones de personas que viven en ciudades sin miles de robots conectados directamente a un cerebro. La cooperación lleva a la creación de internet satelital, la cooperación nos permite recibir todo el rango de bienes y servicios que tenemos ahora. Entonces, ¿no sería capaz una IA buena y al menos capaz a nivel humano de mostrarse en el trabajo, si está limitada en conectarse al IoT de todo el mundo? Creo que sí, de lo contrario, en el planeta Tierra en lugar de la civilización humana, los hongos o las hormigas habrían ganado."
}