{
  "404": "404",
  "Complexity:": "التعقيد:",
  "Tags:": "العلامات:",
  "Authors:": "المؤلفون:",
  "Apply": "تطبيق",
  "Clear all": "مسح الكل",
  "Spring school 2023": "مدرسة الربيع 2023",
  "ROS": "ROS",
  "Raspberry Pi": "Raspberry Pi",
  "ai": "ذكاء اصطناعي",
  "Spot": "Spot",
  "Multi-Agent Systems": "أنظمة الوكلاء المتعددة",
  "Industrial": "صناعي",
  "World computer": "الكمبيوتر العالمي",
  "Privacy Policy": "سياسة الخصوصية",
  "Learn": "تعلم",
  "Robonomics website": "موقع Robonomics",
  "Tell us more": "أخبرنا المزيد",
  "Send": "إرسال",
  "Sending your info...": "جاري إرسال معلوماتك...",
  "Thanks": "شكرًا",
  "we’ll keep in touch": "سنبقى على اتصال",
  "Results": "النتائج",
  "Previous Lesson": "الدرس السابق",
  "Previous Page": "الصفحة السابقة",
  "Next Lesson": "الدرس التالي",
  "Next Page": "الصفحة التالية",
  "You are currently opted out. Click here to opt in": "أنت حاليًا مستبعد. انقر هنا للاشتراك",
  "You may choose not to have a unique web analytics cookie identification number assigned to your computer to avoid the aggregation and analysis of data collected on this website.": "يمكنك عدم تعيين رقم تعريف فريد لملف تعريف الارتباط بالويب على جهاز الكمبيوتر الخاص بك لتجنب تجميع وتحليل البيانات المجمعة على هذا الموقع.",
  "To make that choice, please click below to receive an opt-out cookie": "لاتخاذ هذا الاختيار، يرجى النقر أدناه لتلقي ملف تعريف ارتباط للإلغاء",
  "You are currently opted out. Click here to opt in.": "أنت حاليًا مستبعد. انقر هنا للاشتراك.",
  "Opt-out complete; your visits to this website will not be recorded by the Web Analytics tool. Note that if you clear your cookies, delete the opt-out cookie, or if you change computers or Web browsers, you will need to perform the opt-out procedure again.": "اكتمال الإلغاء؛ لن يتم تسجيل زياراتك إلى هذا الموقع بواسطة أداة تحليل الويب. يرجى ملاحظة أنه إذا قمت بمسح ملفات تعريف الارتباط الخاصة بك، أو حذف ملف تعريف الارتباط للإلغاء، أو إذا قمت بتغيير أجهزة الكمبيوتر أو متصفحات الويب، فيجب عليك إجراء إجراء الإلغاء مرة أخرى.",
  "Please click below to opt in:": "يرجى النقر أدناه للاشتراك:",
  "You are currently opted in. Click here to opt out.": "أنت حاليًا مشترك. انقر هنا لإلغاء الاشتراك.",
  "Latest update": "أحدث تحديث",
  "on (date of commit)": "في (تاريخ الالتزام)",
  "by (author of commit)": "بواسطة (مؤلف الالتزام)",
  "Completed the Course?": "هل أكملت الدورة؟",
  "You can apply for a certificate of completion, after which you will be able to:": "يمكنك التقدم بطلب للحصول على شهادة الانتهاء، بعد ذلك ستتمكن من:",
  "add certificate to your LinkedIn profile": "إضافة الشهادة إلى ملفك الشخصي على LinkedIn",
  "apply for": "التقدم بطلب ل",
  "Robonomics Ambassador Program": "برنامج سفير Robonomics",
  "print the certificate and hang it on the wall.": "طباعة الشهادة وتعليقها على الحائط.",
  "Apply for Certificate": "تقديم طلب للحصول على الشهادة",
  "Ask question on GitHub": "طرح سؤال على GitHub",
  "Get Notifications & Updates": "الحصول على إشعارات وتحديثات",
  "You've come to the wrong classroom": "لقد وصلت إلى الفصل الدراسي اخاطئ",
  "Return to main campus": "العودة إلى الحرم الرئيسي",
  "Welcome to Our Online School!": "مرحبًا بكم في مدرستنا عبر الإنترنت!",
  "The core developers of the Robonomics project, robotics specialists and PhD research scientists offer to pass through compendious experience based on 7 years of work with web 3.0 projects.": "يقدم المطورون الأساسيون لمشروع Robonomics، وأخصائيو الروبوتيات وعلماء البحوث الدكتوراه، تجربة موجزة تستند إلى 7 سنوات من العمل مع مشاريع الويب 3.0.",
  "What can you discover for yourself in the academy?": "ما الذي يمكنك اكتشافه بنفسك في الأكاديمية؟",
  "Web3 Advanced Applications": "تطبيقات الويب3 المتقدمة",
  "Find out how cutting-edge web3 technologies can be integrated into personal, city, or corporate settings on examples with practical uses in real-life scenarios.": "اكتشف كيف يمكن دمج تقنيات الويب3 الحديثة في الإعدادات الشخصية أو الحضرية أو الشركات على أمثلة تطبيقية تستخدم في سيناريوهات الحياة الواقعية.",
  "Focus on decentralized IoT strategies that provide greater safety and flexibility compared to their centralized counterparts.": "التركيز على استراتيجيات الإنترنت الأشياء اللامركزية التي توفر مزيدًا من الأمان والمرونة مقارنة بأقرانها المركزية.",
  "Study new robotics frameworks and SDKs and apply them to your projects.": "دراسة الأطر الروبوتية وأدوات تطوير البرمجيات الخاصة الجديدة وتطبيقها على مشاريعك.",
  "Peep insights how Norbert Wiener's principles of cybernetics are applied to modern autonomous systems.": "اطلع على كيفية تطبيق مبادئ السيبرنيتيكا لنوربرت وينر على الأنظمة الذاتية الحديثة.",
  "Discover new mechanisms of techno-economic communication between machines and humans.": "اكتشف آليات جديدة للتواصل التكنولوجي الاقتصادي بين الآلات والبشر.",
  "Learn how to work with single board computers, sensors, smart devices and complex robots.": "تعلم كيفية العمل مع أجهزة الكمبيوتر ذات اللوحة الواحدة، والمستشعرات، والأجهزة الذكية، والروبوتات المعقدة.",
  "What is Robonomics?": "ما هو Robonomics؟",
  "Robonomics is a secure, serverless and futuristic IoT platform that connects users and smart devices. It enables the exchange of technical and economic information in the form of atomic transactions between user applications, IoT services, and complex robotics.": "Robonomics هو منصة IoT آمنة وخالية من الخوادم ومستقبلية تربط المستخدمين والأجهزة الذكية. يمكنها تبادل المعلومات التقنية والاقتصادية في شكل معاملات ذرية بين تطبيقات المستخدم، وخدمات الإنترنت الأشياء، والروبوتات المعقدة.",
  "Learn more on Robonomics website": "تعرف على المزيد على موقع Robonomics",
  "User Dapp": "تطبيق المستخدم",
  "Function Request": "طلب الوظيفة",
  "Report": "تقرير",
  "Digital Twin": "توأم رقمي",
  "Control": "التحكم",
  "Log": "سجل",
  "IoT Device": "جهاز الإنترنت الأشياء",
  "Learn and practice web3": "تعلم وممارسة الويب3",
  "Discover our expanding selection of hands-on exercises, tutorials, and online courses for free. The core developers and researchers at Robonomics invite you to enter the world of web3 and gain practical and theoretical skills through quizzes, device simulations, and even real-life setups using Robonomics Parachain (Polkadot), IPFS, and other web3 tools.": "اكتشف مجموعتنا المتنامية من التمارين العملية، والبرامج التعليمية عبر الإنترنت مجانًا. يدعوك المطورون الأساسيون والباثون في Robonomics إلى دخول عالم الويب3 واكتساب المهارات العملية والنظرية من خلال الاختبارات، ومحاكاة الأجهزة، وحتى الإعدادات العملية باستخدام Robonomics Parachain (Polkadot)، وIPFS، وغيرها من أدوات الويب3.",
  "No courses were found with such filters.": "لم يتم العثور على دورات بهذه الفلاتر.",
  "Try again": "حاول مرة أخرى",
  "This Policy describes the information we collect from you, how we use that information and our legal basis for doing so. It also covers whether and how that information may be shared and your rights and choices regarding the information you provide to us.": "توضح هذه السياسة المعلومات التي نجمعها منك، وكيفية استخدام تلك المعلومات وأساسنا القانوني لذلك. كما تغطي ما إذا كانت وكيف يمكن مشاركة تلك المعلومات وحقوقك وخياراتك بشأن المعلومات التي تقدمها لنا.",
  "Where are those annoying cookie consent pop-ups?": "أين تلك النوافذ المنبثقة المزعجة للموافقة على ملفات تعريف الارتباط؟",
  "We don't need cookie consent is needed because:": "لا نحتاج إلى موافقة ملفات تعريف الارتباط لأن:",
  "Tracking cookies are not used": "لا تستخدم ملفات تعقب",
  "The data is not used for any other purpose than analytics": "لا تستخدم البيانات لأي غرض آخر سوى التحليلات",
  "Visitors aren’t tracked across websites": "لا يتم تتبع الزوار عبر المواقع الإلكترونية",
  "A user cannot be tracked across days within the same website": "لا يمكن تتبع المستخدم عبر الأيام داخل نفس الموقع الإلكتروني",
  "What We Collect and Receive": "ما الذي نجمعه ونتلقاه",
  "In order for us to provide you the best possible experience on our websites, we need to collect and process certain information. Depending on your use of the Services, that may include:": "من أجل توفير أفضل تجربة ممكنة لك على مواقعنا الإلكترونية، نحتاج إلى جمع ومعالجة بعض المعلومات. اعتمادًا على استخدامك للخدمات، قد تشمل ذلك:",
  "Contact us via email": "الاتصال بنا عبر البريد الإلكتروني",
  "for example, when you submit our forms, send us questions or comments, or report a problem, we will collect your name, email address, message, etc. We use this data solely in connection with answering the queries we receive.": "على سبيل المثال، عند تقديم النماذج الخاصة بنا، أو إرسال الأسئلة أو التعليقات إلينا، أو الإبلاغ عن مشكلة، سنقوم بجمع اسمك، عنوان بريدك الإلكتروني، الرسالة، إلخ. نحن نستخدم هذه البيانات فقط فيما يتعلق بالرد على الاستفسارات التي نتلقاها.",
  "Usage data": "بيانات الاستخدام",
  "other": "أخرى",
  "non-personal data. We process this usage data only on our server, not passing it to third-parties with": "بيانات غير شخصية. نعالج هذه البيانات الاستخدام فقط على خادمنا، دون تمريرها إلى أطراف ثالثة مع",
  "Matomo": "منصة تحليلات الويب التي تمنحنا ملكية البيانات بنسبة 100%. تساعدنا هذه التحليلات على تحسين تجربة المستخدم مع موقعنا الإلكتروني والتعرف على وإيقاف أي سوء استخدام.",
  "web analytics platform that gives us 100% data ownership. This analytics helps us to improve user experience with our website and to recognize and stop any misuse.": "ملفات تعريف الارتباط غير المخصصة",
  "we use non-tracking cookies (small data files transferred onto computers or devices by sites) for record-keeping purposes and to enhance functionality on our website. You may deactivate or restrict the transmission of these cookies by changing the settings of your web browser or by opt-out on this page in the form below. Cookies that are already stored may be deleted at any time.": "نحن نستخدم ملفات تعريف الارتباط غير التتبعية (ملفات بيانات صغيرة يتم نقلها إلى أجهزة الكمبيوتر أو الأجهزة عن طريق المواقع) لأغراض الحفظ وتعزيز الوظائف على موقعنا على الويب. يمكنك إلغاء تنشيط أو تقييد نقل هذه الملفات عن طريق تغيير إعدادات متصفح الويب الخاص بك أو عن طريق الاختيار على هذه الصفحة في النموذج أدناه. يمكن حذف ملفات تعريف الارتباط التي تم تخزينها بالفعل في أي وقت.",
  "Opt-out of website tracking": "الاختيار بعيدا عن تتبع الموقع",
  "You can opt out of being tracked by our Matomo Analytics instance below:": "يمكنك اختيار عدم تتبعك من قبل مثيلنا لتحليلات Matomo أدناه:",
  "Your Rights": "حقوقك",
  "You have the right to be informed of Personal Data processed by Matomo, a right to rectification/correction, erasure and restriction of processing. You also have the right to ask from us a structured, common and machine-readable format of Personal Data you provided to us.": "لديك الحق في أن تكون مطلعًا على البيانات الشخصية التي تم معالجتها بواسطة Matomo، والحق في التصحيح/التصحيح، والحذف وتقييد المعالجة. لديك أيضًا الحق في طلب منا تنسيق بيانات شخصية هيكلية ومشتركة وقابلة للقراءة بواسطة الآلة التي قدمتها لنا.",
  "We can only identify you via your email address and we can only adhere to your request and provide information if we have Personal Data about you through you having made contact with us directly and/or you using our site and/or service. We cannot provide, rectify or delete any data that we store on behalf of our users or customers.": "يمكننا تحديد هويتك فقط من خلال عنوان بريدك الإلكتروني ويمكننا الالتزام بطلبك وتقديم المعلومات إذا كانت لدينا بيانات شخصية عنك من خلال الاتصال المباشر بنا و/أو استخدامك لموقعنا و/أو خدمتنا. لا يمكننا توفير أو تصحيح أو حذف أي بيانات نقوم بتخزينها نيابة عن مستخدمينا أو عملائنا.",
  "To exercise any of the rights mentioned in this Privacy Policy and/or in the event of questions or comments relating to the use of Personal Data you may contact us.": "لممارسة أي من الحقوق المذكورة في سياسة الخصوصية هذه و/أو في حالة وجود أسئلة أو تعليقات تتعلق باستخدام البيانات الشخصية يمكنك الاتصال بنا.",
  "In addition, you have the right to lodge a complaint with the data protection authority in your jurisdiction.": "بالإضافة إلى ذلك، لديك الحق في تقديم شكوى إلى سلطة حماية البيانات في اختصاصك.",
  "Retention of data": "الاحتفاظ بالبيانات",
  "We will retain your information as long as necessary to provide you with the services or as otherwise set forth in this Policy. We will also retain and use this information as necessary for the purposes set out in this Policy and to the extent necessary to comply with our legal obligations, resolve disputes, enforce our agreements and protect Robonomics Academy legal rights.": "سنحتفظ بمعلوماتك طالما كان ذلك ضروريًا لتوفير الخدمات لك أو كما هو محدد في هذه السياسة. سنحتفظ أيضًا بهذه المعلومات واستخدامها عند الضرورة للأغراض المحددة في هذه السياسة وعلى النحو اللازم للامتثال لالتزاماتنا القانونية، ول النزاعات، وفرض اتفاقياتنا وحماية حقوق Robonomics Academy القانونية.",
  "We also collect and maintain aggregated, anonymized or pseudonymized information which we may retain indefinitely to protect the safety and security of our Site, improve our Services or comply with legal obligations.": "نجمع أيضًا ونحتفظ بالمعلومات المجمعة أو المجهولة أو المشفرة التي قد نحتفظ بها إلى الأبد لحماية سلامة وأمان موقعنا، وتحسين خدماتنا أو الامتثال لالتزامات قانونية.",
  "This page has moved to a": "تم نقل هذه الصفحة إلى",
  "Automatic redirecting": "إعادة توجيه تلقائي",
  "Non-personalized cookies": "ملفات تعريف الارتباط غير الشخصية",
  "when you visit our website, we will store: the URL from which you visited us from, web pages of our website you visit, the date and duration of your visit, your anonymized IP address, the device specifications (device type, operating system, screen resolution, language, country you are located in, and web browser type) you used during your visit, and": "عند زيارتك لموقعنا على الويب، سنقوم بتخزين: عنوان URL الذي زرتنا منه، صفحات الويب من موقعنا الذي زرتها، تاريخ ومدة زيارتك، عنوان IP المجهول الخاص بك، مواصفات الجهاز (نوع الجهاز، نظام التشغيل، دقة الشاشة، اللغة، البلد الذي تقع فيه، ونوع متصفح الويب) الذي استخدمته خلال زيارتك، و",
  "Sending your request": "إرسال طلبك",
  "You are in the list": "أنت في القائمة",
  "By submitting this form you agree to receive emails with notifications and updates from the Robonomics Network team": "من خلال تقديم هذا النموذج، فإنك توافق على تلقي رسائل بريد إلكتروني تحتوي على إشعارات وتحديثات من فريق شبكة Robonomics",
  "Strategies for IoT Decentralization": "استراتيجيات لتمزيق الإنترنت للأشياء",
  "Latest Robotics Tools": "أحدث أدوات الروبوتيات",
  "Modern Cybernetics": "السيبرنيات الحديثة",
  "Economic Processes for Robots": "العمليات الاقتصادية للروبوتات",
  "Engineering Skills": "مهارات الهندسة",
  "Your email": "بريدك الإلكتروني",
  "Submit": "إرسال",
  "course": "الدورة",
  "guide": "الدليل",
  "launch simulation": "تشغيل المحاكاة",
  "real-life setup": "إعداد الحياة الواقعية",
  "Introduction to the ideas of Robonomics": "مقدمة لأفكار Robonomics",
  "Broadcasting Through the Black Mirror": "البث من خلال المرآة السوداء",
  "At the Intersection of Cybernetics and Economics": "عند تقاطع السيبرنيتيك والاقتصاد",
  "Polkadot Ecosystem for Home IoT Infrastructure": "بيئة Polkadot لبنية الإنترنت المنزلية الذكية",
  "IoT Subscriptions Using Robonomics Parachain": "اشتراكات الإنترنت من خلال Robonomics Parachain",
  "Sovereign Smart Home with Robonomics and Home Assistant": "منزل ذكي ذاتي الحكم مع Robonomics وHome Assistant",
  "Raspberry Pi Setup": "إعداد Raspberry Pi",
  "MQTT Broker Setup and Home Assistant Init": "إعداد وبدء MQTT Broker و Home Assistant",
  "Gateway Setup: Zigbee2MQTT": "إعداد البوابة: Zigbee2MQTT",
  "Gateway Setup: Robonomics SLS Gateway": "إعداد البوابة: Robonomics SLS Gateway",
  "Robonomics IoT Subscription Setup": "إعداد اشتراكات Robonomics IoT",
  "Robonomics Integration Setup": "إعداد التكامل مع Robonomics",
  "Sensors Connectivity & Decentralized Sensors Network": "توصيل الأجهزة الاستشعار وشبكة الأجهزة الاستشعار اللامركزية",
  "Sensor Hardware": "أجهزة الاستشعار",
  "Setting up and connecting sensors": "إعداد وتوصيل الأجهزة الاستشعار",
  "Sensors connectivity module": "وحدة توصيل الأجهزة الاستشعار",
  "Sensors connectivity config options": "خيارات تكوين وحدة توصيل الأجهزة الاستشعار",
  "Sensor map deployment": "نشر خريطة الأجهزة الاستشعار",
  "Robonomics sensors measure analytics and archive mode": "تحليل وضبط أجهزة الاستشعار Robonomics ووضع الأرشيف",
  "Connect Mars Curiosity Rover": "توصيل مسبر الفضاء كيوريوسيتي على المريخ",
  "Connect ROS-compatible drone": "توصيل الطائرة بدون طيار المتوافقة مع ROS",
  "Connect Kuka manipulator": "توصيل المانيبولاتور Kuka",
  "Connect unmanned aerial vehicle": "توصيل الطائرة بدون طيار",
  "Control Baxter robot": "التحكم في روبوت باكستر",
  "ROS-based projects for smart spaces": "مشاريع قائمة على ROS للمساحات الذكية",
  "Operate Boston Dynamics Spot": "تشغيل Boston Dynamics Spot",
  "Quickstart Your Bachelor's Thesis with AI-powered Tools": "بدء سريع لرسالة البكالوريوس باستخدام أدوات مدعومة بالذكاء الاصطناعي",
  "Introduction": "مقدمة",
  "Literature Review": "مراجعة الأدب",
  "Methods": "الأساليب",
  "Conclusion": "الاستنتاج",
  "OpenGov for managing the IoT infrastructure": "OpenGov لإدارة بنية الإنترنت المنزلية الذكية",
  "The Shadow of AdCorp's Intrusion": "ظل الاختراق من AdCorp",
  "Introduction to open source solution for private smart homes": "مقدمة لحل مصدر مفتوح للمنازل الذكية الخاصة",
  "New Home, New Habits": "منزل جديد، عادات جديدة",
  "Assembling Smart Home Board": "تجميع لوحة المنزل الذكي",
  "Unleash Automation Potential": "إطلاق إمكانيات الأتمتة",
  "Escape from Black Mirror": "الهروب من المرآة السوداء",
  "The story of a girl named Trinity": "قصة فتاة تدعى ترينيتي",
  "Fake Housewife & AI research Smart Home Solution": "زوي الزوجة المزيفة والذكاء الاصطناعي حلا للمنزل الذكي",
  "Meet Fake Housewife Zoe and her story": "التعرف على زوي الزوجة المزيفة وقصتها",
  "Risks of standard Smart Home solutions and the Home Assistant": "مخاطر حلول المنزل الذكي القياسية ومساعد المنزل",
  "Blockchain-based Smart home solutions": "حلول المنزل الذكي القائمة على تقنية البلوكشين",
  "Home Assistant + blockchain+Web3": "مساعد المنزل + بلوكشين + Web3",
  "Studying the Sovereign smart home course at the academy and WIKI instructions": "دراسة دورة المنزل الذكي السيادي في الأكاديمية وتعليمات WIKI",
  "Fake Housewife & AI is researching devices to install": "زوي الزوجة المزيفة والذكاء الاصطناعي تبحث عن الأجهزة للتثبيت",
  "Fake Housewife & AI is installing a Smart Home Robonomics": "زوي الزوجة المزيفة والذكاء الاصطناعي تثبت منزل ذكي Robonomics",
  "AI scenario of the Relax zone for the Fake Housewife": "سيناريو الذكاء الاصطناعي لمنطقة الاسترخاء لزوي الزوجة المزيفة",
  "Software Developing for Boston Dynamics Spot": "تطوير البرمجيات لروبوت باكستر Dynamics",
  "Emergency Stop, Initialization, Body Position Control": "إيقاف الطوارئ، التهيئة، التحكم في وضع الجسم",
  "Getting Used to Feecc": "التعود على Feecc",
  "Architecture": "الهندسة المعمارية",
  "Overview": "نظرة عامة",
  "Demo of Feecc": "عرض توضيحي لـ Feecc",
  "Deployment of Engineer Workbench": "نشر محطة عمل المهندس",
  "Deployment of Analytics": "نشر التحليلات",
  "World computer in your home": "الكمبيوتر العالمي في منزلك",
  "Part 1: The Idea of a World Computer": "الجزء 1: فكرة الكمبيوتر العالمي",
  "Part 2: The Heart of the World Computer": "الجزء 2: قلب الكمبيوتر العالمي",
  "Part 3: Emergence of the World Computer": "الجزء 3: ظهور الكمبيوتر العالمي",
  "Part 4: The Path of a New Block of Information in the World Computer": "الجزء 4: مسار كتلة جديدة من المعلومات في الكمبيوتر العالمي",
  "Ivan Berman": "إيفان بيرمان",
  "Leemo": "ليمو",
  "Vadim Manaenko": "فاديم ماناينكو",
  "Sergei Lonshakov": "سيرغي لونشاكوف",
  "Anna Wimmer-Savinova": "آنا فيمر-سافينوفا",
  "Pavel Tarasov": "بافيل تاراسوف",
  "Alexander Smekhnov": "ألكسندر سميخنوف",
  "Filter": "مرشح",
  "Note: you need to pass all lessons from course with one Polkadot.js account to apply for certificate": "ملاحظة: تحتاج إلى اجتياز جميع الدروس من الدورة بحساب واحد في Polkadot.js لتقديم طلب الشهادة",
  "Robonomics School 2024 / IoT is More Dangerous Than AI": "مدرسة روبونوميكس 2024 / إنترنت الأشياء أكثر خطورة من الذكاء الاصطناعي"
}