{
  "404": "404",
  "Complexity:": "التعقيد:",
  "Tags:": "العلامات:",
  "Authors:": "المؤلفون:",
  "Apply": "تطبيق",
  "Clear all": "مسح الكل",
  "Spring school 2023": "مدرسة الربيع 2023",
  "ROS": "ROS",
  "Raspberry Pi": "Raspberry Pi",
  "ai": "ذكاء اصطناعي",
  "Spot": "Spot",
  "Multi-Agent Systems": "أنظمة الوكلاء المتعددة",
  "Industrial": "صناعي",
  "World computer": "الكمبيوتر العالمي",
  "Privacy Policy": "سياسة الخصوصية",
  "Learn": "تعلم",
  "Robonomics website": "موقع Robonomics",
  "Tell us more": "أخبرنا المزيد",
  "Thanks": "شكرًا",
  "we’ll keep in touch": "سنبقى على اتصال",
  "Results": "النتائج",
  "Previous Lesson": "الدرس السابق",
  "Previous Page": "الصفحة السابقة",
  "Next Lesson": "الدرس التالي",
  "Next Page": "الصفحة التالية",
  "You are currently opted out. Click here to opt in": "أنت حاليًا مستبعد. انقر هنا للاشتراك",
  "You may choose not to have a unique web analytics cookie identification number assigned to your computer to avoid the aggregation and analysis of data collected on this website.": "يمكنك عدم تعيين رقم تعريف فريد لملف تعريف الارتباط بالويب على جهاز الكمبيوتر الخاص بك لتجنب تجميع وتحليل البيانات المجمعة على هذا الموقع.",
  "To make that choice, please click below to receive an opt-out cookie": "لاتخاذ هذا الاختيار، يرجى النقر أدناه لتلقي ملف تعريف ارتباط للإلغاء",
  "You are currently opted out. Click here to opt in.": "أنت حاليًا مستبعد. انقر هنا للاشتراك.",
  "Opt-out complete; your visits to this website will not be recorded by the Web Analytics tool. Note that if you clear your cookies, delete the opt-out cookie, or if you change computers or Web browsers, you will need to perform the opt-out procedure again.": "اكتمال الإلغاء؛ لن يتم تسجيل زياراتك إلى هذا الموقع بواسطة أداة تحليل الويب. يرجى ملاحظة أنه إذا قمت بمسح ملفات تعريف الارتباط الخاصة بك، أو حذف ملف تعريف الارتباط للإلغاء، أو إذا قمت بتغيير أجهزة الكمبيوتر أو متصفحات الويب، فيجب عليك إجراء إجراء الإلغاء مرة أخرى.",
  "Please click below to opt in:": "يرجى النقر أدناه للاشتراك:",
  "You are currently opted in. Click here to opt out.": "أنت حاليًا مشترك. انقر هنا لإلغاء الاشتراك.",
  "Latest update": "أحدث تحديث",
  "on (date of commit)": "في (تاريخ الالتزام)",
  "by (author of commit)": "بواسطة (مؤلف الالتزام)",
  "Completed the Course?": "هل أكملت الدورة؟",
  "You can apply for a certificate of completion, after which you will be able to:": "يمكنك التقدم بطلب للحصول على شهادة الانتهاء، بعد ذلك ستتمكن من:",
  "add certificate to your LinkedIn profile": "إضافة الشهادة إلى ملفك الشخصي على LinkedIn",
  "apply for": "التقدم بطلب ل",
  "Robonomics Ambassador Program": "برنامج سفير Robonomics",
  "print the certificate and hang it on the wall.": "طباعة الشهادة وتعليقها على الحائط.",
  "Apply for Certificate": "تقديم طلب للحصول على الشهادة",
  "Ask question on GitHub": "طرح سؤال على GitHub",
  "Get Notifications & Updates": "الحصول على إشعارات وتحديثات",
  "You've come to the wrong classroom": "لقد وصلت إلى الفصل الدراسي اخاطئ",
  "Return to main campus": "العودة إلى الحرم الرئيسي",
  "Welcome to Our Online School!": "مرحبًا بكم في مدرستنا عبر الإنترنت!",
  "The core developers of the Robonomics project, robotics specialists and PhD research scientists offer to pass through compendious experience based on 7 years of work with web 3.0 projects.": "يقدم المطورون الأساسيون لمشروع Robonomics، وأخصائيو الروبوتيات وعلماء البحوث الدكتوراه، تجربة موجزة تستند إلى 7 سنوات من العمل مع مشاريع الويب 3.0.",
  "What can you discover for yourself in the academy?": "ما الذي يمكنك اكتشافه بنفسك في الأكاديمية؟",
  "Web3 Advanced Applications": "تطبيقات الويب3 المتقدمة",
  "Find out how cutting-edge web3 technologies can be integrated into personal, city, or corporate settings on examples with practical uses in real-life scenarios.": "اكتشف كيف يمكن دمج تقنيات الويب3 الحديثة في الإعدادات الشخصية أو الحضرية أو الشركات على أمثلة تطبيقية تستخدم في سيناريوهات الحياة الواقعية.",
  "Focus on decentralized IoT strategies that provide greater safety and flexibility compared to their centralized counterparts.": "التركيز على استراتيجيات الإنترنت الأشياء اللامركزية التي توفر مزيدًا من الأمان والمرونة مقارنة بأقرانها المركزية.",
  "Study new robotics frameworks and SDKs and apply them to your projects.": "دراسة الأطر الروبوتية وأدوات تطوير البرمجيات الخاصة الجديدة وتطبيقها على مشاريعك.",
  "Peep insights how Norbert Wiener's principles of cybernetics are applied to modern autonomous systems.": "اطلع على كيفية تطبيق مبادئ السيبرنيتيكا لنوربرت وينر على الأنظمة الذاتية الحديثة.",
  "Discover new mechanisms of techno-economic communication between machines and humans.": "اكتشف آليات جديدة للتواصل التكنولوجي الاقتصادي بين الآلات والبشر.",
  "Learn how to work with single board computers, sensors, smart devices and complex robots.": "تعلم كيفية العمل مع أجهزة الكمبيوتر ذات اللوحة الواحدة، والمستشعرات، والأجهزة الذكية، والروبوتات المعقدة.",
  "What is Robonomics?": "ما هو Robonomics؟",
  "Robonomics is a secure, serverless and futuristic IoT platform that connects users and smart devices. It enables the exchange of technical and economic information in the form of atomic transactions between user applications, IoT services, and complex robotics.": "Robonomics هو منصة IoT آمنة وخالية من الخوادم ومستقبلية تربط المستخدمين والأجهزة الذكية. يمكنها تبادل المعلومات التقنية والاقتصادية في شكل معاملات ذرية بين تطبيقات المستخدم، وخدمات الإنترنت الأشياء، والروبوتات المعقدة.",
  "Learn more on Robonomics website": "تعرف على المزيد على موقع Robonomics",
  "User Dapp": "تطبيق المستخدم",
  "Function Request": "طلب الوظيفة",
  "Report": "تقرير",
  "Digital Twin": "توأم رقمي",
  "Control": "التحكم",
  "Log": "سجل",
  "IoT Device": "جهاز الإنترنت الأشياء",
  "Learn and practice web3": "تعلم وممارسة الويب3",
  "Discover our expanding selection of hands-on exercises, tutorials, and online courses for free. The core developers and researchers at Robonomics invite you to enter the world of web3 and gain practical and theoretical skills through quizzes, device simulations, and even real-life setups using Robonomics Parachain (Polkadot), IPFS, and other web3 tools.": "اكتشف مجموعتنا المتنامية من التمارين العملية، والبرامج التعليمية عبر الإنترنت مجانًا. يدعوك المطورون الأساسيون والباثون في Robonomics إلى دخول عالم الويب3 واكتساب المهارات العملية والنظرية من خلال الاختبارات، ومحاكاة الأجهزة، وحتى الإعدادات العملية باستخدام Robonomics Parachain (Polkadot)، وIPFS، وغيرها من أدوات الويب3.",
  "No courses were found with such filters.": "لم يتم العثور على دورات بهذه الفلاتر.",
  "Try again": "حاول مرة أخرى",
  "This page has moved to a": "تم نقل هذه الصفحة إلى",
  "Automatic redirecting": "إعادة توجيه تلقائي",
  "Strategies for IoT Decentralization": "استراتيجيات لتمزيق الإنترنت للأشياء",
  "Latest Robotics Tools": "أحدث أدوات الروبوتيات",
  "Modern Cybernetics": "السيبرنيات الحديثة",
  "Economic Processes for Robots": "العمليات الاقتصادية للروبوتات",
  "Engineering Skills": "مهارات الهندسة",
  "Your email": "بريدك الإلكتروني",
  "course": "الدورة",
  "guide": "الدليل",
  "launch simulation": "تشغيل المحاكاة",
  "real-life setup": "إعداد الحياة الواقعية",
  "Introduction to the ideas of Robonomics": "مقدمة لأفكار Robonomics",
  "Broadcasting Through the Black Mirror": "البث من خلال المرآة السوداء",
  "At the Intersection of Cybernetics and Economics": "عند تقاطع السيبرنيتيك والاقتصاد",
  "Polkadot Ecosystem for Home IoT Infrastructure": "بيئة Polkadot لبنية الإنترنت المنزلية الذكية",
  "IoT Subscriptions Using Robonomics Parachain": "اشتراكات الإنترنت من خلال Robonomics Parachain",
  "Sovereign Smart Home with Robonomics and Home Assistant": "منزل ذكي ذاتي الحكم مع Robonomics وHome Assistant",
  "Raspberry Pi Setup": "إعداد Raspberry Pi",
  "MQTT Broker Setup and Home Assistant Init": "إعداد وبدء MQTT Broker و Home Assistant",
  "Gateway Setup: Zigbee2MQTT": "إعداد البوابة: Zigbee2MQTT",
  "Gateway Setup: Robonomics SLS Gateway": "إعداد البوابة: Robonomics SLS Gateway",
  "Robonomics IoT Subscription Setup": "إعداد اشتراكات Robonomics IoT",
  "Robonomics Integration Setup": "إعداد التكامل مع Robonomics",
  "Sensors Connectivity & Decentralized Sensors Network": "توصيل الأجهزة الاستشعار وشبكة الأجهزة الاستشعار اللامركزية",
  "Sensor Hardware": "أجهزة الاستشعار",
  "Setting up and connecting sensors": "إعداد وتوصيل الأجهزة الاستشعار",
  "Sensors connectivity module": "وحدة توصيل الأجهزة الاستشعار",
  "Sensors connectivity config options": "خيارات تكوين وحدة توصيل الأجهزة الاستشعار",
  "Sensor map deployment": "نشر خريطة الأجهزة الاستشعار",
  "Robonomics sensors measure analytics and archive mode": "تحليل وضبط أجهزة الاستشعار Robonomics ووضع الأرشيف",
  "Connect Mars Curiosity Rover": "توصيل مسبر الفضاء كيوريوسيتي على المريخ",
  "Connect ROS-compatible drone": "توصيل الطائرة بدون طيار المتوافقة مع ROS",
  "Connect Kuka manipulator": "توصيل المانيبولاتور Kuka",
  "Connect unmanned aerial vehicle": "توصيل الطائرة بدون طيار",
  "Control Baxter robot": "التحكم في روبوت باكستر",
  "ROS-based projects for smart spaces": "مشاريع قائمة على ROS للمساحات الذكية",
  "Operate Boston Dynamics Spot": "تشغيل Boston Dynamics Spot",
  "Quickstart Your Bachelor's Thesis with AI-powered Tools": "بدء سريع لرسالة البكالوريوس باستخدام أدوات مدعومة بالذكاء الاصطناعي",
  "Introduction": "مقدمة",
  "Literature Review": "مراجعة الأدب",
  "Methods": "الأساليب",
  "Conclusion": "الاستنتاج",
  "OpenGov for managing the IoT infrastructure": "OpenGov لإدارة بنية الإنترنت المنزلية الذكية",
  "The Shadow of AdCorp's Intrusion": "ظل الاختراق من AdCorp",
  "Introduction to open source solution for private smart homes": "مقدمة لحل مصدر مفتوح للمنازل الذكية الخاصة",
  "New Home, New Habits": "منزل جديد، عادات جديدة",
  "Assembling Smart Home Board": "تجميع لوحة المنزل الذكي",
  "Unleash Automation Potential": "إطلاق إمكانيات الأتمتة",
  "Escape from Black Mirror": "الهروب من المرآة السوداء",
  "The story of a girl named Trinity": "قصة فتاة تدعى ترينيتي",
  "Fake Housewife & AI research Smart Home Solution": "زوي الزوجة المزيفة والذكاء الاصطناعي حلا للمنزل الذكي",
  "Meet Fake Housewife Zoe and her story": "التعرف على زوي الزوجة المزيفة وقصتها",
  "Risks of standard Smart Home solutions and the Home Assistant": "مخاطر حلول المنزل الذكي القياسية ومساعد المنزل",
  "Blockchain-based Smart home solutions": "حلول المنزل الذكي القائمة على تقنية البلوكشين",
  "Home Assistant + blockchain+Web3": "مساعد المنزل + بلوكشين + Web3",
  "Studying the Sovereign smart home course at the academy and WIKI instructions": "دراسة دورة المنزل الذكي السيادي في الأكاديمية وتعليمات WIKI",
  "Fake Housewife & AI is researching devices to install": "زوي الزوجة المزيفة والذكاء الاصطناعي تبحث عن الأجهزة للتثبيت",
  "Fake Housewife & AI is installing a Smart Home Robonomics": "زوي الزوجة المزيفة والذكاء الاصطناعي تثبت منزل ذكي Robonomics",
  "AI scenario of the Relax zone for the Fake Housewife": "سيناريو الذكاء الاصطناعي لمنطقة الاسترخاء لزوي الزوجة المزيفة",
  "Software Developing for Boston Dynamics Spot": "تطوير البرمجيات لروبوت باكستر Dynamics",
  "Emergency Stop, Initialization, Body Position Control": "إيقاف الطوارئ، التهيئة، التحكم في وضع الجسم",
  "Getting Used to Feecc": "التعود على Feecc",
  "Architecture": "الهندسة المعمارية",
  "Overview": "نظرة عامة",
  "Demo of Feecc": "عرض توضيحي لـ Feecc",
  "Deployment of Engineer Workbench": "نشر محطة عمل المهندس",
  "Deployment of Analytics": "نشر التحليلات",
  "World computer in your home": "الكمبيوتر العالمي في منزلك",
  "Part 1: The Idea of a World Computer": "الجزء 1: فكرة الكمبيوتر العالمي",
  "Part 2: The Heart of the World Computer": "الجزء 2: قلب الكمبيوتر العالمي",
  "Part 3: Emergence of the World Computer": "الجزء 3: ظهور الكمبيوتر العالمي",
  "Part 4: The Path of a New Block of Information in the World Computer": "الجزء 4: مسار كتلة جديدة من المعلومات في الكمبيوتر العالمي",
  "Ivan Berman": "إيفان بيرمان",
  "Leemo": "ليمو",
  "Vadim Manaenko": "فاديم ماناينكو",
  "Sergei Lonshakov": "سيرغي لونشاكوف",
  "Anna Wimmer-Savinova": "آنا فيمر-سافينوفا",
  "Pavel Tarasov": "بافيل تاراسوف",
  "Alexander Smekhnov": "ألكسندر سميخنوف",
  "Filter": "مرشح",
  "Note: you need to pass all lessons from course with one Polkadot.js account to apply for certificate": "ملاحظة: تحتاج إلى اجتياز جميع الدروس من الدورة بحساب واحد في Polkadot.js لتقديم طلب الشهادة",
  "Robonomics School 2024 / IoT is More Dangerous Than AI": "مدرسة روبونوميكس 2024 / إنترنت الأشياء أكثر خطورة من الذكاء الاصطناعي",
  "Robonomics School 2024 / Privacy Insights for Smart Homes": "مدرسة روبونوميكس 2024 / رؤى الخصوصية للمنازل الذكية",
  "Robonomics School 2024 / Cyprus Relocant Manual: Smart Home": "مدرسة روبونوميكس 2024 / دليل الانتقال إلى قبرص: المنزل الذكي",
  "ROS 2": "ROS 2",
  "Essentials": "Essentials",
  "Smart Home": "Smart Home",
  "Robotics": "Robotics",
  "Sensor Network": "Sensor Network",
  "School 2024": "School 2024",
  "By clicking on the button “Submit” you agree to receive regular emails from Robonomics (no more than 1 per month) and you agree with": "بالنقر فوق الزر “إرسال”، فإنك توافق على تلقي رسائل البريد الإلكتروني الدورية من Robonomics (لا تزيد عن واحدة في الشهر) وتوافق على",
  "Last updated: February 05, 2025": "آخر تحديث: 05 فبراير 2025",
  "This Privacy Policy describes Our policies and procedures on the collection, use and disclosure of Your information when You use the Service and tells You about Your privacy rights and how the law protects You.": "توضح سياسة الخصوصية هذه سياساتنا وإجراءاتنا بشأن جمع واستخدام وكشف معلوماتك عند استخدامك للخدمة وتخبرك عن حقوق خصوصيتك وكيفية حمايتك بموجب القانون.",
  "We use Your Personal data to provide and improve the Service. By using the Service, You agree to the collection and use of information in accordance with this Privacy Policy.": "نحن نستخدم بياناتك الشخصية لتوفير الخدمة وتحسينها. من خلال استخدام الخدمة، فإنك توافق على جمع واستخدام المعلومات وفقًا لهذه السياسة الخاصة بالخصوصية.",
  "Interpretation and Definitions": "التفسير والتعاريف",
  "Interpretation": "التفسير",
  "The words of which the initial letter is capitalized have meanings defined under the following conditions. The following definitions shall have the same meaning regardless of whether they appear in singular or in plural.": "الكلمات التي تبدأ بحرف كبير لها معان محددة بموجب الشروط التالية. يجب أن تكون التعاريف التالية لها نفس المعنى بغض النظر عما إذا كانت تظهر في صيغة مفرد أو جمع.",
  "Definitions": "التعاريف",
  "For the purposes of this Privacy Policy:": "لأغراض هذه السياسة الخاصة بالخصوصية:",
  "DAO": "DAO",
  "(referred to as either \"the DAO\", \"We\", \"Us\" or \"Our\" in this Agreement) refers to decentralized autonomous organization Robonomics Network, an operator for website": "(المشار إليه باسم \"ال DAO\", \"نحن\", \"نحن\" أو \"نحن\" في هذا الاتفاق) يشير إلى منظمة الحكم الذاتي اللامركزية Robonomics Network، وهي مشغل لموقع الويب",
  "(referred to as": "(المشار إليها باسم",
  "Website": "الموقع الإلكتروني",
  "in this Agreement). For the purpose of the GDPR, the DAO is the Data Controller.": "في هذا الاتفاق). لأغراض اللائحة العامة لحماية البيانات، يعتبر ال DAO هو المتحكم في البيانات.",
  "Cookies": "الكوكيز",
  "are small files that are placed on Your computer, mobile device or any other device by a website, containing the details of Your browsing history on that website among its many uses. More detailed information on cookies and how they work can be found at:": "هي ملفات صغيرة يتم وضعها على جهاز الكمبيوتر الخاص بك أو الجهاز المحمول أو أي جهاز آخر من قبل موقع ويب، تحتوي على تفاصيل تاريخ تصفحك على ذلك الموقع بين استخداماتها العديدة. يمكن العثور على معلومات أكثر تفصيلًا حول الكوكيز وكيفية عملها على:",
  "Country": "البلد",
  "refers to: Cyprus.": "يشير إلى: قبرص.",
  "Data Controller": "متحكم البيانات",
  "for the purposes of the GDPR (General Data Protection Regulation), refers to the DAO as the legal person which alone or jointly with others determines the purposes and means of the processing of Personal Data.": "لأغراض اللائحة العامة لحماية البيانات (لائحة حماية البيانات العامة الأوروبية)، يشير إلى ال DAO كالشخص القانوني الذي يحدد بمفرده أو بالتعاون مع الآخرين الأغراض والوسائل لمعالجة البيانات الشخصية.",
  "Device": "الجهاز",
  "means any device that can access the Service such as a computer, a cellphone or a digital tablet.": "يعني أي جهاز يمكنه الوصول إلى الخدمة مثل جهاز كمبيوتر أو هاتف خلوي أو جهاز لوحي رقمي.",
  "GDPR": "لائحة حماية البيانات العامة الأوروبية",
  "refers to EU General Data Protection Regulation.": "تشير إلى لائحة حماية البيانات العامة الأوروبية.",
  "Personal Data": "البيانات الشخصية",
  "is any information that relates to an identified or identifiable individual.": "هي أي معلومات تتعلق بشخص محدد أو قابل للتحديد.",
  "For the purposes of GDPR, Personal Data means any information relating to You such as a name, an identification number, location data, online identifier or to one or more factors specific to the physical, physiological, genetic, mental, economic, cultural or social identity.": "لأغراض لائحة حماية البيانات العامة الأوروبية، تعني البيانات الشخصية أي معلومات تتعلق بك مثل الاسم، أو رقم التعريف، أو بيانات الموقع، أو معرف الإنترنت، أو عوامل أخرى محددة للهوية الجسدية، أو الفسيولوجية، أو الجينية، أو العقلية، أو الاقتصادية، أو الثقافية، أو الاجتماعية.",
  "Service": "الخدمة",
  "refers to the Website": "تشير إلى الموقع الإلكتروني",
  "Service Provider": "مقدم الخدمة",
  "means any natural or legal person who processes the data on behalf of the DAO. It refers to third-party companies or individuals employed by the DAO to facilitate the Service, to provide the Service on behalf of the DAO, to perform services related to the Service or to assist the DAO in analyzing how the Service is used. For the purpose of the GDPR, Service Providers are considered Data Processors.": "يعني أي شخص طبيعي أو قانوني يعالج البيانات نيابة عن ال DAO. يشير إلى الشركات أو الأفراد الذين يعملون لصالح ال DAO لتسهيل الخدمة، أو تقديم الخدمة نيابة عن ال DAO، أو تقديم خدمات تتعلق بالخدمة، أو مساعدة ال DAO في تحليل كيفية استخدام الخدمة. لأغراض لائحة حماية البيانات العامة، يُعتبر مقدمو الخدمة معالجي البيانات.",
  "Usage Data": "بيانات الاستخدام",
  "refers to data collected automatically, either generated by the use of the Service or from the Service infrastructure itself (for example, the duration of a page visit).": "تشير إلى البيانات التي تم جمعها تلقائيًا، إما من خلال استخدام الخدمة أو من بنية الخدمة نفسها (على سبيل المثال، مدة زيارة الصفحة).",
  "You": "أنت",
  "(referred to as either \"Your\" in this Agreement) means the individual accessing or using the Service, or the DAO, or other legal entity on behalf of which such individual is accessing or using the Service, as applicable.": "(المشار إليه باسم \"أنت\" في هذا الاتفاق) يعني الشخص الذي يستخدم الخدمة، أو ال DAO، أو الكيان القانوني الآخر الذي يستخدم الخدمة نيابة عن هذا الشخص، حسب الاقتضاء.",
  "Under GDPR, You can be referred to as the Data Subject or as the User as you are the individual using the Service.": "بموجب لائحة حماية البيانات العامة، يمكن الإشارة إليك باسم الموضوع البياني أو باسم المستخدم حيث أنك الشخص الذي يستخدم الخدمة.",
  "This Agreement is originally written in English. This AI translation is provided for your reference only.": "هذا الاتفاق مكتوب أصلاً باللغة الإنجليزية. تم توفير هذه الترجمة الذكية للإشارة فقط.",
  "Demo academic apps": "تطبيقات أكاديمية تجريبية",
  "Here are some demonstrational applications for academic needs. Some of them can be active, some of them not.": "هنا بعض التطبيقات التجريبية للاحتياجات الأكاديمية. بعضها قد يكون نشطًا، وبعضها لا.",
  "Hack Johnny's lab": "اختراق مختبر جوني",
  "Johny's crypto lab is a cutting-edge hub filled with all sorts of smart gadgets, including a TurtleBot 4 robot that is known as a base for an iRobot vacuum. But imagine the thrill—and the risk—if someone managed to hack into the robot's camera. Ready to dive into the world of cybersecurity and test your hacking skills? See what you can uncover!": "مختبر العملات الرقمية لجوني هو مركز حديث مليء بجميع أنواع الأجهزة الذكية، بما في ذلك روبوت TurtleBot 4 المعروف باسم قاعدة لمكنسة الروبوت iRobot. ولكن تخيل الإثارة والمخاطر إذا نجح شخص ما في اختراق كاميرا الروبوت. هل أنت مستعد للغوص في عالم أمان المعلومات واختبار مهارات القرصنة الخاصة بك؟ انظر ما يمكنك اكتشافه!",
  "Rules of the game": "قواعد اللعبة",
  "Collecting and Using Your Personal Data": "جمع واستخدام بياناتك الشخصية",
  "Types of Data Collected": "أنواع البيانات المجمعة",
  "While using Our Service, We may ask You to provide Us with certain personally identifiable information that can be used to contact or identify You. Personally identifiable information may include, but is not limited to:": "أثناء استخدام خدمتنا، قد نطلب منك تقديم بعض المعلومات الشخصية التي يمكن استخدامها للاتصال بك أو تحديد هويتك. قد تشمل المعلومات الشخصية التي يمكن تحديدها، على سبيل المثال لا الحصر:",
  "Email address": "عنوان البريد الإلكتروني",
  "First name and last name": "الاسم الأول والاسم الأخير",
  "Usage Data is collected automatically when using the Service.": "يتم جمع بيانات الاستخدام تلقائيًا عند استخدام الخدمة.",
  "Usage Data may include information such as Your Device's Internet Protocol address (e.g. IP address), browser type, browser version, the pages of our Service that You visit, the time and date of Your visit, the time spent on those pages, unique device identifiers and other diagnostic data.": "قد تشمل بيانات الاستخدام معلومات مثل عنوان بروتوكول الإنترنت لجهازك (على سبيل المثال عنوان IP)، نوع المتصفح، إصدار المتصفح، الصفحات التي تزورها على خدمتنا، وقت وتاريخ زيارتك، الوقت الذي قضيته على تلك الصفحات، معرفات الأجهزة الفريدة وبيانات تشخيصية أخرى.",
  "When You access the Service by or through a mobile device, We may collect certain information automatically, including, but not limited to, the type of mobile device You use, Your mobile device unique ID, the IP address of Your mobile device, Your mobile operating system, the type of mobile Internet browser You use, unique device identifiers and other diagnostic data.": "عند الوصول إلى الخدمة عن طريق جهاز محمول، قد نجمع بعض المعلومات تلقائيًا، بما في ذلك، على سبيل المثال ��ا الحصر، نوع الجهاز المحمول الذي تستخدمه، معرف الجهاز المحمول الفريد الخاص بك، عنوان IP لجهازك المحمول، نظام تشغيل جهازك المحمول، نوع متصفح الإنترنت المحمول الذي تستخدمه، معرفات الأجهزة الفريدة وبيانات تشخيصية أخرى.",
  "We may also collect information that Your browser sends whenever You visit our Service or when You access the Service by or through a mobile device.": "قد نجمع أيضًا معلومات ترسلها متصفحك كلما زرت خدمتنا أو عندما تصل إلى الخدمة عن طريق جهاز محمول.",
  "Cookies & Browser Storage": "ملفات تعريف الارتباط وتخزين المتصفح",
  "The Websites may use cookies. We use cookies and browser storage only for essential settings to improve your experience—not for tracking. These help remember your preferences, such as language settings or consent choices, so you don’t have to reset them each time you visit.": "قد تستخدم المواقع الإلكترونية ملفات تعريف الارتباط. نحن نستخدم ملفات تعريف الارتباط وتخزين المتصفح فقط للإعدادات الأساسية لتحسين تجربتك—وليس للتتبع. تساعد هذه الملفات على تذكر تفضيلاتك، مثل إعدادات اللغة أو خيارات الموافقة، حتى لا تضطر إلى إعادة تعيينها في كل مرة تزور فيها.",
  "We do not use cookies for tracking or personalized advertising. You can manage or disable cookies in your browser settings, but some features may not work properly without them.": "لا نستخدم ملفات تعريف الارتباط للتتبع أو الإعلانات المخصصة. يمكنك إدارة أو تعطيل ملفات تعريف الارتباط في إعدادات متصفحك، ولكن قد لا تعمل بعض الميزات بشكل صحيح بدونها.",
  "Matomo Analytics": "تحليلات Matomo",
  "Our website may use Matomo, an open-source analytics platform, to gather insights into website usage. This includes anonymized data such as:": "قد تستخدم موقعنا الإلكتروني Matomo، وهو منصة تحليلات مفتوحة المصدر، لجمع رؤى حول استخدام الموقع الإلكتروني. يشمل ذلك البيانات المجهولة مثل:",
  "Pages visited and navigation paths": "الصفحات التي تم زيارتها ومسارات التنقل",
  "Time spent on our website": "الوقت الذي قضيته على موقعنا الإلكتروني",
  "Whether you’re a returning or new visitor": "ما إذا كنت زائرًا جديدًا أم عائدًا",
  "Your device type (desktop, mobile, etc.)": "نوع جهازك (سطح المكتب، محمول، إلخ)",
  "To protect your privacy, your IP address is anonymized before being stored. The data we collect is only used to improve the website and is not used for personal identification.": "لحماية خصوصيتك، يتم تجهيز عنوان IP الخاص بك بشكل مجهول قبل تخزينه. البيانات التي نجمعها تستخدم فقط لتحسين الموقع الإلكتروني ولا تستخدم للتعرف الشخصي.",
  "Under Art. 6(1)(f) GDPR": "بموجب المادة 6(1)(f) من قانون حماية البيانات العامة",
  "we process this data based on our legitimate interest in enhancing our services.": "نقوم بمعالجة هذه البيانات بناءً على مصلحتنا المشروعة في تعزيز خدماتنا.",
  "Opt-Out Option": "خيار عدم المشاركة",
  "You can disable Matomo tracking at any time:": "يمكنك تعطيل تتبع Matomo في أي وقت:",
  "Use of Your Personal Data": "استخدام بياناتك الشخصية",
  "The DAO may use Personal Data for the following purposes:": "قد تستخدم الشركة بيانات شخصية للأغراض التالية:",
  "To provide and maintain our Service": "لتوفير وصيانة خدمتنا",
  "including to monitor the usage of our Service.": "بما في ذلك مراقبة استخدام خدمتنا.",
  "For the performance of a contract": "لأداء عقد",
  "the development, compliance and undertaking of the purchase contract for the products, items or services You have purchased or of any other contract with Us through the Service.": "تطوير وامتثال وتنفيذ عقد الشراء للمنتجات أو العناصر أو الخدمات التي قمت بشرائها أو أي عقد آخر معنا من خلال الخدمة.",
  "To contact You": "للاتصال بك",
  "To contact You by email, telephone calls, SMS, or other equivalent forms of electronic communication, such as a mobile application's push notifications regarding updates or informative communications related to the functionalities, products or contracted services, including the security updates, when necessary or reasonable for their implementation.": "للاتصال بك عن طريق البريد الإلكتروني، والمكالمات الهاتفية، والرسائل النصية القصيرة، أو أشكال الاتصال الإلكتروني الأخرى المعادلة، مثل إشعارات التطبيق المحمول بخصوص التحديثات أو الاتصالات الإعلامية ذات الصلة بالوظائف أو المنتجات أو الخدمات المتعاقد عليها، بما في ذلك تحديثات الأمان، عند الضرورة أو الاعتدال لتنفيذها.",
  "To provide You": "لتوفير لك",
  "with news, special offers and general information about other goods, services and events which we offer that are similar to those that you have already purchased or enquired about unless You have opted not to receive such information.": "الأخبار والعروض الخاصة والمعلومات العامة حول السلع والخدمات والفعاليات الأخرى التي نقدمها والتي تشابه تلك التي قمت بشرائها أو الاستفسار عنها ما لم تكن قد اخترت عدم تلقي مثل هذه المعلومات.",
  "To manage Your requests": "لإدارة طلباتك",
  "To attend and manage Your requests to Us.": "لحضور وإدارة طلباتك إلينا.",
  "For other purposes": "لأغراض أخرى",
  "We may use Your information for other purposes, such as data analysis, identifying usage trends, determining the effectiveness of our promotional campaigns and to evaluate and improve our Service, products, services, marketing and your experience.": "قد نستخدم معلوماتك لأغراض أخرى، مثل تحليل البيانات، وتحديد اتجاهات الاستخدام، وتحديد فعالية حملاتنا الترويجية وتقييمها وتحسين خدمتنا ومنتجاتنا وخدماتنا وتسويقنا وتجربتك.",
  "We may share Your personal information in the following situations:": "قد نشارك معلوماتك الشخصية في الحالات التالية:",
  "With Service Providers": "مع مقدمي الخدمات",
  "We may share Your personal information with Service Providers to monitor and analyze the use of our Service, to contact You.": "قد نشارك معلوماتك الشخصية مع مقدمي الخدمات لمراقبة وتحليل استخدام خدمتنا، للاتصال بك.",
  "With Your consent": "بموافقتك",
  "We may disclose Your personal information for any other purpose with Your consent.": "قد نكشف معلوماتك الشخصية لأي غرض آخر بموافقتك.",
  "Retention of Your Personal Data": "الاحتفاظ ببياناتك الشخصية",
  "The DAO will retain Your Personal Data only for as long as is necessary for the purposes set out in this Privacy Policy. We will retain and use Your Personal Data to the extent necessary to comply with our legal obligations (for example, if we are required to retain your data to comply with applicable laws), resolve disputes, and enforce our legal agreements and policies.": "سيحتفظ الدي أي أو بياناتك الشخصية فقط طالما كان ذلك ضروريًا للأغراض المنصوص عليها في سياسة الخصوصية هذه. سنحتفظ ببياناتك الشخصية ونستخدمها إلى الحد اللازم للامتثال لالتزاماتنا القانونية (على سبيل المثال، إذا كان علينا الاحتفاظ ببياناتك للامتثال للقوانين السارية)، حل النزاعات، وفرض اتفاقياتنا وسياساتنا القانونية.",
  "The DAO will also retain Usage Data for internal analysis purposes. Usage Data is generally retained for a shorter period of time, except when this data is used to strengthen the security or to improve the functionality of Our Service, or We are legally obligated to retain this data for longer time periods.": "سيحتفظ الدي أي أيضًا ببيانات الاستخدام لأغراض التحليل الداخلي. تُحتفظ عادةً ببيانات الاستخدام لفترة أقصر من الوقت، ما لم يتم استخدام هذه البيانات لتعزيز الأمان أو تحسين وظائف خدمتنا، أو يكون علينا الالتزام القانوني بالاحتفاظ بهذه البيانات لفترات زمنية أطول.",
  "Security of Your Personal Data": "أمان بياناتك الشخصية",
  "The security of Your Personal Data is important to Us, but remember that no method of transmission over the Internet, or method of electronic storage is 100% secure. While We strive to use commercially acceptable means to protect Your Personal Data, We cannot guarantee its absolute security.": "أمان بياناتك الشخصية مهم بالنسبة لنا، ولكن تذكر أنه لا يوجد طريقة لضمان النقل عبر الإنترنت، أو طريقة لتخزين البيانات الإلكترونية بنسبة 100٪ آمنة. بينما نحاول استخدام وسائل تجارية مقبولة لحماية بياناتك الشخصية، لا يمكننا ضمان أمانها المطلق.",
  "Detailed Information on the Processing of Your Personal Data": "معلومات مفصلة حول معالجة بياناتك الشخصية",
  "Your information, including Personal Data, is processed is processed at the DAO's website service provider(s) and in any other places where the parties involved in the processing are located. It means that this information may be transferred to — and maintained on — computers located outside of Your state, province, country or other governmental jurisdiction where the data protection laws may differ than those from Your jurisdiction.": "تتم معالجة معلوماتك، بما في ذلك البيانات الشخصية، على خدمة موقع الدي أي ومقدمي الخدمات الآخرين في أي مكان آخر يقع فيه الأطراف المعنية بالمعالجة. يعني ذلك أن هذه المعلومات قد يتم نقلها إلى — والاحتفاظ بها على — أجهزة الكمبيوتر الموجودة خارج دولتك، مقاطعتك، بلدك أو سلطة حكومية أخرى حيث قد تختلف قوانين حماية البيانات عن تلك الموجودة في سلطتك.",
  "Your consent to this Privacy Policy followed by Your submission of such information represents Your agreement to that transfer.": "موافقتك على سياسة الخصوصية هذه تليها تقديمك لهذه المعلومات يمثل موافقتك على تلك النقلة.",
  "The DAO will take all steps reasonably necessary to ensure that Your data is treated securely and in accordance with this Privacy Policy and no transfer of Your Personal Data will take place to an organization or a country unless there are adequate controls in place including the security of Your data and other personal information.": "سيقوم الدي أي باتخاذ جميع الخطوات الضرورية بما يعقل لضمان معالجة بياناتك بشكل آمن ووفقًا لهذه السياسة الخصوصية ولن يتم نقل بياناتك الشخصية إلى منظمة أو بلد ما ما لم تكن هناك ضوابط كافية مثل أمان بياناتك ومعلوماتك الشخصية الأخرى.",
  "Please note that any data transmission on the Internet (e.g. communication by e-mail) is generally not secure and we accept no liability for data transmitted to us via the Internet. Unfortunately, absolute protection is not technically possible. This information does not apply to the Website of third parties and the corresponding links given on our Website. The DAO assumes no responsibility and liability for these.": "يرجى ملاحظة أن أي نقل للبيانات عبر الإنترنت (على سبيل المثال، الاتصال عبر البريد الإلكتروني) عمومًا ليس آمنًا ونحن لا نتحمل أي مسؤولية عن البيانات المنقولة إلينا عبر الإنترنت. للأسف، لا يمكن تحقيق حماية مطلقة من الناحية التقنية. لا تنطبق هذه المعلومات على مواقع الويب للأطراف الثالثة والروابط المقابلة الموجودة على موقعنا. لا يتحمل الدي أي أي مسؤولية أو مسؤولية عن ذلك.",
  "The Service Providers We use may have access to Your Personal Data. These third-party vendors collect, store, use, process and transfer information about Your activity on Our Service in accordance with their Privacy Policies.": "قد تكون لمقدمي الخدمات الذين نستخدمهم وصول إلى بياناتك الشخصية. تجمع هذه الشركات الموردة الخارجية، وتخزن، وتستخدم، وتعالج، وتنقل المعلومات حول نشاطك على خدمتنا وفقًا لسياساتهم الخصوصية.",
  "Email Marketing": "التسويق عبر البريد الإلكتروني",
  "We may use Your Personal Data to contact You with newsletters, marketing or promotional materials and other information that may be of interest to You. You may opt-out of receiving any, or all, of these communications from Us by following the unsubscribe link or instructions provided in any email We send or by contacting Us.": "قد نستخدم بياناتك الشخصية للاتصال بك من خلال النشرات الإخبارية والمواد التسويقية أو الترويجية والمعلومات الأخرى التي قد تكون مثيرة لاهتمامك. يمكنك الاختيار من عدم تلقي أي من هذه الاتصالات منا عن طريق اتباع الرابط لإلغاء الاشتراك أو التعليمات المقدمة في أي بريد إلكتروني نرسله أو عن طريق الاتصال بنا.",
  "We may use Email Marketing Service Providers to manage and send emails to You;": "قد نستخدم مزودي خدمات التسويق عبر البريد الإلكتروني لإدارة وإرسال رسائل البريد الإلكتروني إليك؛",
  "Unisender": "يمكن الاطلاع على سياسة الخصوصية الخاصة بهم على",
  "Their Privacy Policy can be viewed at": "الاستخدام والأداء والمتفرقات",
  "Usage, Performance and Miscellaneous": "قد نستخدم مزودي خدمات الطرف الثالث للحفاظ على وتحسين خدمتنا.",
  "We may use third-party Service Providers to maintain and improve our Service.": "hcaptcha",
  "hcaptcha": "hcaptcha",
  "GDPR Privacy": "GDPR الخصوصية",
  "Legal Basis for Processing Personal Data under GDPR": "الأساس القانوني لمعالجة البيانات الشخصية بموجب قواعد الحماية العامة للبيانات",
  "We may process Personal Data under the following conditions:": "قد نقوم بمعالجة البيانات الشخصية بموجب الشروط التالية:",
  "Consent:": "موافقة:",
  "You have given Your consent for processing Personal Data for one or more specific purposes.": "لقد قدمت موافقتك على معالجة البيانات الشخصية لأغراض واحدة أو أكثر محددة.",
  "Performance of a contract:": "أداء عقد:",
  "Provision of Personal Data is necessary for the performance of an agreement with You and/or for any pre-contractual obligations thereof.": "إن تقديم البيانات الشخصية ضروري لأداء اتفاق معك و/أو لأي التزامات قبل العقد.",
  "Legal obligations:": "التزامات قانونية:",
  "Processing Personal Data is necessary for compliance with a legal obligation to which the DAO is subject.": "إن معالجة البيانات الشخصية ضرورية للامتثال لالتزام قانوني يخضع له الDAO.",
  "Vital interests:": "المصالح الحيوية:",
  "Processing Personal Data is necessary in order to protect Your vital interests or of another natural person.": "إن معالجة البيانات الشخصية ضرورية لحماية مصالحك الحيوية أو لشخص طبيعي آخر.",
  "Public interests:": "المصالح العامة:",
  "Processing Personal Data is related to a task that is carried out in the public interest or in the exercise of official authority vested in the DAO.": "إن معالجة البيانات الشخصية تتعلق بمهمة تُنفذ في مصلحة عامة أو في ممارسة السلطة الرسمية الممنوحة للDAO.",
  "Legitimate interests:": "المصالح المشروعة:",
  "Processing Personal Data is necessary for the purposes of the legitimate interests pursued by the DAO.": "إن معالجة البيانات الشخصية ضرورية لأغراض ��لمصالح المشروعة التي يسعى إليها الDAO.",
  "In any case, the DAO will gladly help to clarify the specific legal basis that applies to the processing, and in particular whether the provision of Personal Data is a statutory or contractual requirement, or a requirement necessary to enter into a contract.": "على أي حال، سيساعد الDAO بكل سرور في توضيح الأساس القانوني الخاص الذي ينطبق على المعالجة، وخاصة ما إذا كان توفير البيانات الشخصية متطلبًا قانونيًا أو تعاقديًا، أو متطلبًا ضروريًا لدخول عقد.",
  "Your Rights under the GDPR": "حقوقك بموجب قواعد الحماية العامة للبيانات",
  "The DAO undertakes to respect the confidentiality of Your Personal Data and to guarantee You can exercise Your rights.": "يتعهد الDAO بأحترام سرية بياناتك الشخصية وضمان أن يمكنك ممارسة حقوقك.",
  "You have the right under this Privacy Policy, and by law if You are within the EU, to:": "لديك الحق بموجب هذه السياسة الخصوصية، وبموجب القانون إذا كنت داخل الاتحاد الأوروبي، ل:",
  "Request access to Your Personal Data.": "طلب الوصول إلى بياناتك الشخصية.",
  "The right to access, update or delete the information We have on You. Whenever made possible, you can access, update or request deletion of Your Personal Data directly within Your account settings section. If you are unable to perform these actions yourself, please contact Us to assist You. This also enables You to receive a copy of the Personal Data We hold about You.": "الحق في الوصول إلى، تحديث أو حذف المعلومات التي لدينا عنك. في حال توفر الفرصة، يمكنك الوصول إلى بياناتك الشخصية وتحديثها أو طلب حذفها مباشرة ضمن قسم إعدادات حسابك. إذا كنت غير قادر على إجراء هذه الإجراءات بنفسك، يرجى الاتصال بنا لمساعدتك. كما يمكنك من خلال ذلك الحصول على نسخة من البيانات الشخصية التي نحتفظ بها عنك.",
  "Request correction of the Personal Data that We hold about You.": "طلب تصحيح البيانات الشخصية التي نحتفظ بها عنك.",
  "You have the right to have any incomplete or inaccurate information We hold about You corrected.": "لديك الحق في تصحيح أي معلومات غير كاملة أو غير دقيقة نحتفظ بها عنك.",
  "Object to processing of Your Personal Data.": "الاعتراض على معالجة بياناتك الشخصية.",
  "This right exists where We are relying on a legitimate interest as the legal basis for Our processing and there is something about Your particular situation, which makes You want to object to our processing of Your Personal Data on this ground. You also have the right to object where We are processing Your Personal Data for direct marketing purposes.": "هذا الحق موجود عندما نعتمد على مصلحة مشروعة كأساس قانوني لمعالجتنا وهناك شيء ما في وضعك الخاص يجعلك ترغب في الاعتراض على معالجتنا لبياناتك الشخصية على هذا الأساس. لديك أيضًا الحق في الاعتراض عندما نقوم بمعالجة بياناتك الشخصية لأغراض التسويق المباشر.",
  "Request erasure of Your Personal Data.": "طلب حذف بياناتك الشخصية.",
  "You have the right to ask Us to delete or remove Personal Data when there is no good reason for Us to continue processing it.": "لديك الحق في طلب منا حذف أو إزالة البيانات الشخصية عندما لا يكون هناك سبب وجيه لنا لمواصلة معالجتها.",
  "Request the transfer of Your Personal Data.": "طلب نقل بياناتك الشخصية.",
  "We will provide to You, or to a third-party You have chosen, Your Personal Data in a structured, commonly used, machine-readable format. Please note that this right only applies to automated information which You initially provided consent for Us to use or where We used the information to perform a contract with You.": "سنقدم لك، أو لجهة ثالثة اخترتها، بياناتك الشخصية في تنسيق منظم، شائع الاستخدام، قابل للقراءة بواسطة الآلة. يرجى ملاحظة أن هذا الحق ينطبق فقط على المعلومات التلقائية التي قدمتها أولاً موافقة على استخدامها أو حيث استخدمنا المعلومات لأداء عقد معك.",
  "Withdraw Your consent.": "سحب موافقتك.",
  "You have the right to withdraw Your consent on using your Personal Data. If You withdraw Your consent, We may not be able to provide You with access to certain specific functionalities of the Service.": "لديك الحق في سحب موافقتك على استخدام بياناتك الشخصية. إذا قمت بسحب موافقتك، قد لا نكون قادرين على توفير لك الوصول إلى بعض الوظائف الخاصة بالخدمة.",
  "Exercising of Your GDPR Data Protection Rights": "ممارسة حقوق حماية البيانات الخاصة بك بموجب قواعد حماية البيانات العامة الأوروبية (GDPR)",
  "You may exercise Your rights of access, rectification, cancellation and opposition by contacting Us. Please note that we may ask You to verify Your identity before responding to such requests. If You make a request, We will try our best to respond to You as soon as possible.": "يمكنك ممارسة حقوق الوصول والتصحيح والإلغاء والاعتراض الخاصة بك عن طريق الاتصال بنا. يرجى ملاحظة أنه قد نطلب منك التحقق من هويتك قبل الرد على مثل هذه الطلبات. إذا قمت بطلب ذلك، سنبذل قصارى جهدنا للرد عليك في أقرب وقت ممكن.",
  "You have the right to complain to a Data Protection Authority about Our collection and use of Your Personal Data. For more information, if You are in the European Economic Area (EEA), please contact Your local data protection authority in the EEA.": "لديك الحق في تقديم شكوى إلى سلطة حماية البيانات حول جمعنا واستخدام بياناتك الشخصية. لمزيد من المعلومات، إذا كنت في منطقة الاتحاد الأوروبي الاقتصادية (EEA)، يرجى الاتصال بسلطة حماية البيانات المحلية في EEA.",
  "Children's Privacy": "خصوصية الأطفال",
  "Our Service does not address anyone under the age of 13. We do not knowingly collect personally identifiable information from anyone under the age of 13. If You are a parent or guardian and You are aware that Your child has provided Us with Personal Data, please contact Us. If We become aware that We have collected Personal Data from anyone under the age of 13 without verification of parental consent, We take steps to remove that information from Our servers.": "لا يستهدف خدمتنا أي شخص دون سن 13 عامًا. نحن لا نقوم بجمع معلومات تعريف شخصي�� من أي شخص دون سن 13 عامًا بشكل معرف. إذا كنت والدًا أو وصيًا وكنت على علم بأن طفلك قد قدم لنا بيانات شخصية، يرجى الاتصال بنا. إذا أصبحنا على علم بأننا قمنا بجمع بيانات شخصية من أي شخص دون سن 13 عامًا دون التحقق من موافقة الوالدين، فإننا نتخذ خطوات لإزالة تلك المعلومات من خوادمنا.",
  "If We need to rely on consent as a legal basis for processing Your information and Your country requires consent from a parent, We may require Your parent's consent before We collect and use that information.": "إذا كان علينا الاعتماد على الموافقة كأساس قانوني لمعالجة معلوماتك وكان بلدك يتطلب موافقة من الوالدين، فقد نحتاج إلى موافقة والديك قبل جمع واستخدام تلك المعلومات.",
  "Links to Other Websites": "روابط إلى مواقع الويب الأخرى",
  "Our Service may contain links to other websites that are not operated by Us. If You click on a third party link, You will be directed to that third party's site. We strongly advise You to review the Privacy Policy of every site You visit.": "قد تحتوي خدمتنا على روابط إلى مواقع الويب الأخرى التي لا تديرها نحن. إذا قمت بالنقر على رابط طرف ثالث، ستتم توجيهك إلى موقع طرف ثالث. ننصحك بشدة بمراجعة سياسة الخصوصية لكل موقع تزوره.",
  "We have no control over and assume no responsibility for the content, privacy policies or practices of any third party sites or services.": "ليس لدينا أي تحكم على ولا نتحمل أي مسؤولية عن محتوى أو سياسات الخصوصية أو الممارسات في أي ��واقع أو خدمات طرف ثالث.",
  "Changes to this Privacy Policy": "تغييرات على سياسة الخصوصية هذه",
  "We may update Our Privacy Policy from time to time. We will notify You of any changes by posting the new Privacy Policy on this page.": "قد نقوم بتحديث سياسة الخصوصية الخاصة بنا من وقت لآخر. سنقوم بإعلامك بأي تغييرات عن طريق نشر السياسة الجديدة على هذه الصفحة.",
  "We will let You know via email and/or a prominent notice on Our Service, prior to the change becoming effective and update the \"Last updated\" date at the top of this Privacy Policy.": "سنقوم بإعلامك عبر البريد الإلكتروني و/أو إشعار بارز على خدمتنا، قبل أن يصبح التغيير ساري المفعول وتحديث تاريخ \"آخر تحديث\" في أعلى هذه السياسة الخاصة بالخصوصية.",
  "You are advised to review this Privacy Policy periodically for any changes. Changes to this Privacy Policy are effective when they are posted on this page.": "ننصحك بمراجعة سياسة الخصوصية هذه بانتظام لأي تغييرات. تكون التغييرات على سياسة الخصوصية هذه فعالة عند نشرها على هذه الصفحة.",
  "Contact Us": "اتصل بنا",
  "If you have any questions about this Privacy Policy, You can contact us:": "إذا كان لديك أي أسئلة حول سياسة الخصوصية هذه، يمكنك الاتصال بنا:",
  "By visiting this page on our website:": "عن طريق زيارة هذه الصفحة على موقعنا على الويب:"
}