{
  "404": "404",
  "Complexity:": "Complexiteit:",
  "Tags:": "Tags:",
  "Authors:": "Auteurs:",
  "Apply": "Toepassen",
  "Clear all": "Alles wissen",
  "Spring school 2023": "Spring school 2023",
  "ROS": "ROS",
  "Raspberry Pi": "Raspberry Pi",
  "ai": "ai",
  "Spot": "Spot",
  "Multi-Agent Systems": "Multi-Agent Systems",
  "Industrial": "Industrieel",
  "World computer": "Wereldcomputer",
  "Privacy Policy": "Privacybeleid",
  "Learn": "Leren",
  "Robonomics website": "Robonomics-website",
  "Tell us more": "Vertel ons meer",
  "Thanks": "Bedankt",
  "we’ll keep in touch": "we houden contact",
  "Results": "Resultaten",
  "Previous Lesson": "Vorige Les",
  "Previous Page": "Vorige Pagina",
  "Next Lesson": "Volgende Les",
  "Next Page": "Volgende Pagina",
  "You are currently opted out. Click here to opt in": "U bent momenteel afgemeld. Klik hier om u aan te melden",
  "You may choose not to have a unique web analytics cookie identification number assigned to your computer to avoid the aggregation and analysis of data collected on this website.": "U kunt ervoor kiezen om geen uniek cookie-identificatienummer voor webanalyse toe te wijzen aan uw computer om de verzameling en analyse van gegevens die op deze website zijn verzameld te vermijden.",
  "To make that choice, please click below to receive an opt-out cookie": "Om die keuze te maken, klik hieronder om een opt-out-cookie te ontvangen",
  "You are currently opted out. Click here to opt in.": "U bent momenteel afgemeld. Klik hier om u aan te melden.",
  "Opt-out complete; your visits to this website will not be recorded by the Web Analytics tool. Note that if you clear your cookies, delete the opt-out cookie, or if you change computers or Web browsers, you will need to perform the opt-out procedure again.": "Opt-out voltooid; uw bezoeken aan deze website worden niet geregistreerd door de Web Analytics-tool. Let op dat als u uw cookies wist, de opt-out-cookie verwijdert, of als u van computer of webbrowser verandert, u de opt-out-procedure opnieuw moet uitvoeren.",
  "Please click below to opt in:": "Klik hieronder om u aan te melden:",
  "You are currently opted in. Click here to opt out.": "U bent momenteel aangemeld. Klik hier om u af te melden.",
  "Latest update": "Laatste update",
  "on (date of commit)": "op (datum van commit)",
  "by (author of commit)": "door (auteur van commit)",
  "Completed the Course?": "Cursus voltooid?",
  "You can apply for a certificate of completion, after which you will be able to:": "U kunt een certificaat van voltooiing aanvragen, waarna u in staat zult zijn om:",
  "add certificate to your LinkedIn profile": "certificaat toevoegen aan uw LinkedIn-profiel",
  "apply for": "aanvragen voor",
  "Robonomics Ambassador Program": "Robonomics Ambassador Programma",
  "print the certificate and hang it on the wall.": "het certificaat afdrukken en aan de muur hangen.",
  "Apply for Certificate": "Certificaat aanvragen",
  "Ask question on GitHub": "Vraag stellen op GitHub",
  "Get Notifications & Updates": "Ontvang meldingen & updates",
  "You've come to the wrong classroom": "U bent in het verkeerde klaslokaal beland",
  "Return to main campus": "Terug naar de hoofdcampus",
  "Welcome to Our Online School!": "Welkom op onze online school!",
  "The core developers of the Robonomics project, robotics specialists and PhD research scientists offer to pass through compendious experience based on 7 years of work with web 3.0 projects.": "De kernontwikkelaars van het Robonomics-project, roboticaspecialisten en PhD-onderzoekswetenschappers bieden een beknopte ervaring op basis van 7 jaar werk met web 3.0-projecten.",
  "What can you discover for yourself in the academy?": "Wat kun je ontdekken in de academie?",
  "Web3 Advanced Applications": "Web3 Geavanceerde Toepassingen",
  "Find out how cutting-edge web3 technologies can be integrated into personal, city, or corporate settings on examples with practical uses in real-life scenarios.": "Ontdek hoe geavanceerde web3-technologieën kunnen worden geïntegreerd in persoonlijke, stedelijke of bedrijfsomgevingen aan de hand van voorbeelden met praktische toepassingen in realistische scenario's.",
  "Focus on decentralized IoT strategies that provide greater safety and flexibility compared to their centralized counterparts.": "Richt u op gedecentraliseerde IoT-strategieën die meer veiligheid en flexibiliteit bieden in vergelijking met hun gecentraliseerde tegenhangers.",
  "Study new robotics frameworks and SDKs and apply them to your projects.": "Bestudeer nieuwe robotica-frameworks en SDK's en pas ze toe op uw projecten.",
  "Peep insights how Norbert Wiener's principles of cybernetics are applied to modern autonomous systems.": "Kijk hoe de principes van cybernetica van Norbert Wiener worden toegepast op moderne autonome systemen.",
  "Discover new mechanisms of techno-economic communication between machines and humans.": "Ontdek nieuwe mechanismen van techno-economische communicatie tussen machines en mensen.",
  "Learn how to work with single board computers, sensors, smart devices and complex robots.": "Leer hoe u kunt werken met single board computers, sensoren, slimme apparaten en complexe robots.",
  "What is Robonomics?": "Wat is Robonomics?",
  "Robonomics is a secure, serverless and futuristic IoT platform that connects users and smart devices. It enables the exchange of technical and economic information in the form of atomic transactions between user applications, IoT services, and complex robotics.": "Robonomics is een veilig, serverloos en futuristisch IoT-platform dat gebruikers en slimme apparaten met elkaar verbindt. Het maakt de uitwisseling van technische en economische informatie mogelijk in de vorm van atomaire transacties tussen gebruikersapplicaties, IoT-services en complexe robotica.",
  "Learn more on Robonomics website": "Meer informatie op de Robonomics-website",
  "User Dapp": "Gebruikers-Dapp",
  "Function Request": "Functieverzoek",
  "Report": "Rapport",
  "Digital Twin": "Digitaal tweeling",
  "Control": "Controle",
  "Log": "Log",
  "IoT Device": "IoT-apparaat",
  "Learn and practice web3": "Leer en oefen web3",
  "Discover our expanding selection of hands-on exercises, tutorials, and online courses for free. The core developers and researchers at Robonomics invite you to enter the world of web3 and gain practical and theoretical skills through quizzes, device simulations, and even real-life setups using Robonomics Parachain (Polkadot), IPFS, and other web3 tools.": "Ontdek ons groeiende aanbod van praktische oefeningen, tutorials en online cursussen gratis. De kernontwikkelaars en onderzoekers bij Robonomics nodigen u uit om de wereld van web3 binnen te gaan en praktische en theoretische vaardigheden op te doen via quizzen, apparaatsimulaties en zelfs real-life opstellingen met behulp van Robonomics Parachain (Polkadot), IPFS en andere web3-tools.",
  "No courses were found with such filters.": "Er zijn geen cursussen gevonden met dergelijke filters.",
  "Try again": "Probeer opnieuw",
  "This page has moved to a": "Deze pagina is verplaatst naar een",
  "Automatic redirecting": "Automatische doorverwijzing",
  "Strategies for IoT Decentralization": "Strategieën voor IoT decentralisatie",
  "Latest Robotics Tools": "Laatste robotica tools",
  "Modern Cybernetics": "Moderne cybernetica",
  "Economic Processes for Robots": "Economische processen voor robots",
  "Engineering Skills": "Engineering vaardigheden",
  "Your email": "Jouw e-mail",
  "course": "cursus",
  "guide": "gids",
  "launch simulation": "lancering simulatie",
  "real-life setup": "real-life setup",
  "Introduction to the ideas of Robonomics": "Kennismaking met de ideeën van Robonomics",
  "Broadcasting Through the Black Mirror": "Uitzenden via de Black Mirror",
  "At the Intersection of Cybernetics and Economics": "Op het snijvlak van cybernetica en economie",
  "Polkadot Ecosystem for Home IoT Infrastructure": "Polkadot-ecosysteem voor thuis-IoT-infrastructuur",
  "IoT Subscriptions Using Robonomics Parachain": "IoT-abonnementen met behulp van Robonomics Parachain",
  "Sovereign Smart Home with Robonomics and Home Assistant": "Soevereine slimme woning met Robonomics en Home Assistant",
  "Raspberry Pi Setup": "Raspberry Pi-installatie",
  "MQTT Broker Setup and Home Assistant Init": "MQTT Broker-installatie en Home Assistant Init",
  "Gateway Setup: Zigbee2MQTT": "Gateway-installatie: Zigbee2MQTT",
  "Gateway Setup: Robonomics SLS Gateway": "Gateway-installatie: Robonomics SLS Gateway",
  "Robonomics IoT Subscription Setup": "Robonomics IoT-abonnementinstallatie",
  "Robonomics Integration Setup": "Robonomics integratie-installatie",
  "Sensors Connectivity & Decentralized Sensors Network": "Sensorenconnectiviteit & Gedecentraliseerd sensorennetwerk",
  "Sensor Hardware": "Sensorhardware",
  "Setting up and connecting sensors": "Opzetten en verbinden van sensoren",
  "Sensors connectivity module": "Sensorenconnectiviteitsmodule",
  "Sensors connectivity config options": "Sensorenconnectiviteitsconfiguratieopties",
  "Sensor map deployment": "Sensor kaart implementatie",
  "Robonomics sensors measure analytics and archive mode": "Robonomics sensoren meetanalyse en archiefmodus",
  "Connect Mars Curiosity Rover": "Mars Curiosity Rover verbinden",
  "Connect ROS-compatible drone": "ROS-compatibele drone verbinden",
  "Connect Kuka manipulator": "Kuka manipulator verbinden",
  "Connect unmanned aerial vehicle": "Onbemand luchtvaartuig verbinden",
  "Control Baxter robot": "Baxter-robot bedienen",
  "ROS-based projects for smart spaces": "ROS-gebaseerde projecten voor slimme ruimtes",
  "Operate Boston Dynamics Spot": "Boston Dynamics Spot bedienen",
  "Quickstart Your Bachelor's Thesis with AI-powered Tools": "Snelstart van je bachelorscriptie met door AI aangedreven tools",
  "Introduction": "Introductie",
  "Literature Review": "Literatuuroverzicht",
  "Methods": "Methoden",
  "Conclusion": "Conclusie",
  "OpenGov for managing the IoT infrastructure": "OpenGov voor het beheren van de IoT-infrastructuur",
  "The Shadow of AdCorp's Intrusion": "De schaduw van de indringing van AdCorp",
  "Introduction to open source solution for private smart homes": "Introductie tot open source oplossing voor privé slimme woningen",
  "New Home, New Habits": "Nieuw huis, nieuwe gewoonten",
  "Assembling Smart Home Board": "Monteren van Smart Home Board",
  "Unleash Automation Potential": "Automatiseringspotentieel ontketenen",
  "Escape from Black Mirror": "Ontsnappen uit Black Mirror",
  "The story of a girl named Trinity": "Het verhaal van een meisje genaamd Trinity",
  "Fake Housewife & AI research Smart Home Solution": "Nep-huisvrouw & AI-onderzoek Slimme Huisoplossing",
  "Meet Fake Housewife Zoe and her story": "Ontmoet nep-huisvrouw Zoe en haar verhaal",
  "Risks of standard Smart Home solutions and the Home Assistant": "Risico's van standaard Slimme Huisoplossingen en de Home Assistant",
  "Blockchain-based Smart home solutions": "Blockchain-gebaseerde slimme huisoplossingen",
  "Home Assistant + blockchain+Web3": "Home Assistant + blockchain+Web3",
  "Studying the Sovereign smart home course at the academy and WIKI instructions": "Studeren van de soevereine slimme woning cursus aan de academie en WIKI-instructies",
  "Fake Housewife & AI is researching devices to install": "Nep-huisvrouw & AI is apparaten aan het onderzoeken om te installeren",
  "Fake Housewife & AI is installing a Smart Home Robonomics": "Nep-huisvrouw & AI installeert een Slimme Huis Robonomics",
  "AI scenario of the Relax zone for the Fake Housewife": "AI-scenario van de Relax-zone voor de nep-huisvrouw",
  "Software Developing for Boston Dynamics Spot": "Software ontwikkelen voor Boston Dynamics Spot",
  "Emergency Stop, Initialization, Body Position Control": "Noodstop, initialisatie, lichaamspositiecontrole",
  "Getting Used to Feecc": "Wennen aan Feecc",
  "Architecture": "Architectuur",
  "Overview": "Overzicht",
  "Demo of Feecc": "Demo van Feecc",
  "Deployment of Engineer Workbench": "Implementatie van Engineer Workbench",
  "Deployment of Analytics": "Implementatie van Analyse",
  "World computer in your home": "Wereldcomputer in je huis",
  "Part 1: The Idea of a World Computer": "Deel 1: Het idee van een wereldcomputer",
  "Part 2: The Heart of the World Computer": "Deel 2: Het hart van de wereldcomputer",
  "Part 3: Emergence of the World Computer": "Deel 3: Opkomst van de wereldcomputer",
  "Part 4: The Path of a New Block of Information in the World Computer": "Deel 4: Het pad van een nieuw blok informatie in de wereldcomputer",
  "Ivan Berman": "Ivan Berman",
  "Leemo": "Leemo",
  "Vadim Manaenko": "Vadim Manaenko",
  "Sergei Lonshakov": "Sergei Lonshakov",
  "Anna Wimmer-Savinova": "Anna Wimmer-Savinova",
  "Pavel Tarasov": "Pavel Tarasov",
  "Alexander Smekhnov": "Alexander Smekhnov",
  "Filter": "Filteren",
  "Note: you need to pass all lessons from course with one Polkadot.js account to apply for certificate": "Opmerking: je moet alle lessen van de cursus met één Polkadot.js-account halen om in aanmerking te komen voor een certificaat",
  "Robonomics School 2024 / IoT is More Dangerous Than AI": "Robonomics School 2024 / IoT is Gevaarlijker Dan AI",
  "Robonomics School 2024 / Privacy Insights for Smart Homes": "Robonomics School 2024 / Privacy inzichten voor slimme huizen",
  "Robonomics School 2024 / Cyprus Relocant Manual: Smart Home": "Robonomics School 2024 / Cyprus Verhuisgids: Slimme woning",
  "ROS 2": "ROS 2",
  "Essentials": "Essentials",
  "Smart Home": "Smart Home",
  "Robotics": "Robotics",
  "Sensor Network": "Sensor Network",
  "School 2024": "School 2024",
  "By clicking on the button “Submit” you agree to receive regular emails from Robonomics (no more than 1 per month) and you agree with": "Door op de knop 'Verzenden' te klikken, stemt u in met het ontvangen van regelmatige e-mails van Robonomics (niet meer dan 1 per maand) en gaat u akkoord met",
  "Last updated: February 05, 2025": "Laatst bijgewerkt: 5 februari 2025",
  "This Privacy Policy describes Our policies and procedures on the collection, use and disclosure of Your information when You use the Service and tells You about Your privacy rights and how the law protects You.": "Dit privacybeleid beschrijft onze beleidsregels en procedures met betrekking tot de verzameling, het gebruik en de openbaarmaking van uw informatie wanneer u de service gebruikt en informeert u over uw privacyrechten en hoe de wet u beschermt.",
  "We use Your Personal data to provide and improve the Service. By using the Service, You agree to the collection and use of information in accordance with this Privacy Policy.": "We gebruiken uw persoonlijke gegevens om de service te leveren en te verbeteren. Door de service te gebruiken, stemt u in met de verzameling en het gebruik van informatie in overeenstemming met dit privacybeleid.",
  "Interpretation and Definitions": "Interpretatie en definities",
  "Interpretation": "Interpretatie",
  "The words of which the initial letter is capitalized have meanings defined under the following conditions. The following definitions shall have the same meaning regardless of whether they appear in singular or in plural.": "De woorden waarvan de eerste letter is geaccentueerd, hebben betekenissen die zijn gedefinieerd onder de volgende voorwaarden. De volgende definities hebben dezelfde betekenis ongeacht of ze in enkelvoud of meervoud voorkomen.",
  "Definitions": "Definities",
  "For the purposes of this Privacy Policy:": "Voor de doeleinden van dit privacybeleid:",
  "DAO": "DAO",
  "(referred to as either \"the DAO\", \"We\", \"Us\" or \"Our\" in this Agreement) refers to decentralized autonomous organization Robonomics Network, an operator for website": "(aangeduid als 'de DAO', 'Wij', 'Ons' of 'Onze' in deze Overeenkomst) verwijst naar de gedecentraliseerde autonome organisatie Robonomics Network, een exploitant voor de website",
  "(referred to as": "(aangeduid als",
  "Website": "Website",
  "in this Agreement). For the purpose of the GDPR, the DAO is the Data Controller.": "in deze Overeenkomst). Voor de doeleinden van de AVG is de DAO de gegevensbeheerder.",
  "Cookies": "Cookies",
  "are small files that are placed on Your computer, mobile device or any other device by a website, containing the details of Your browsing history on that website among its many uses. More detailed information on cookies and how they work can be found at:": "zijn kleine bestanden die door een website op uw computer, mobiele apparaat of een ander apparaat worden geplaatst en de details van uw browsegeschiedenis op die website bevatten, naast vele andere toepassingen. Meer gedetailleerde informatie over cookies en hoe ze werken, is te vinden op:",
  "Country": "Land",
  "refers to: Cyprus.": "verwijst naar: Cyprus.",
  "Data Controller": "Gegevensbeheerder",
  "for the purposes of the GDPR (General Data Protection Regulation), refers to the DAO as the legal person which alone or jointly with others determines the purposes and means of the processing of Personal Data.": "voor de doeleinden van de AVG (Algemene Verordening Gegevensbescherming) verwijst naar de DAO als de rechtspersoon die alleen of gezamenlijk met anderen de doeleinden en middelen van de verwerking van persoonsgegevens bepaalt.",
  "Device": "Apparaat",
  "means any device that can access the Service such as a computer, a cellphone or a digital tablet.": "betekent elk apparaat dat toegang kan krijgen tot de service, zoals een computer, een mobiele telefoon of een digitale tablet.",
  "GDPR": "AVG",
  "refers to EU General Data Protection Regulation.": "verwijst naar de Algemene Verordening Gegevensbescherming van de EU.",
  "Personal Data": "Persoonsgegevens",
  "is any information that relates to an identified or identifiable individual.": "zijn alle informatie die betrekking heeft op een geïdentificeerde of identificeerbare persoon.",
  "For the purposes of GDPR, Personal Data means any information relating to You such as a name, an identification number, location data, online identifier or to one or more factors specific to the physical, physiological, genetic, mental, economic, cultural or social identity.": "Voor de doeleinden van de AVG betekent persoonsgegevens alle informatie met betrekking tot u, zoals een naam, een identificatienummer, locatiegegevens, online identificatie of een of meer factoren die specifiek zijn voor de fysieke, fysiologische, genetische, mentale, economische, culturele of sociale identiteit.",
  "Service": "Service",
  "refers to the Website": "verwijst naar de Website",
  "Service Provider": "Dienstverlener",
  "means any natural or legal person who processes the data on behalf of the DAO. It refers to third-party companies or individuals employed by the DAO to facilitate the Service, to provide the Service on behalf of the DAO, to perform services related to the Service or to assist the DAO in analyzing how the Service is used. For the purpose of the GDPR, Service Providers are considered Data Processors.": "betekent elke natuurlijke of rechtspersoon die de gegevens namens de DAO verwerkt. Het verwijst naar derde partijen of individuen die door de DAO zijn ingehuurd om de service te faciliteren, om namens de DAO de service te verlenen, om diensten uit te voeren die verband houden met de service of om de DAO te helpen bij het analyseren van hoe de service wordt gebruikt. Voor de doeleinden van de AVG worden dienstverleners beschouwd als gegevensverwerkers.",
  "Usage Data": "Gebruiksgegevens",
  "refers to data collected automatically, either generated by the use of the Service or from the Service infrastructure itself (for example, the duration of a page visit).": "verwijst naar gegevens die automatisch worden verzameld, gegenereerd door het gebruik van de service of van de service-infrastructuur zelf (bijvoorbeeld de duur van een paginabezoek).",
  "You": "U",
  "(referred to as either \"Your\" in this Agreement) means the individual accessing or using the Service, or the DAO, or other legal entity on behalf of which such individual is accessing or using the Service, as applicable.": "(aangeduid als 'Uw' in deze Overeenkomst) betekent de persoon die toegang heeft tot of de service gebruikt, of de DAO, of een andere rechtspersoon namens wie een dergelijke persoon toegang heeft tot of de service gebruikt, indien van toepassing.",
  "Under GDPR, You can be referred to as the Data Subject or as the User as you are the individual using the Service.": "Onder de AVG kunt u worden aangeduid als de betrokkene of als de gebruiker omdat u de persoon bent die de service gebruikt.",
  "Collecting and Using Your Personal Data": "Verzamelen en gebruiken van uw persoonsgegevens",
  "Types of Data Collected": "Soorten verzamelde gegevens",
  "While using Our Service, We may ask You to provide Us with certain personally identifiable information that can be used to contact or identify You. Personally identifiable information may include, but is not limited to:": "Tijdens het gebruik van onze service kunnen wij u vragen ons bepaalde persoonlijk identificeerbare informatie te verstrekken die kan worden gebruikt om contact met u op te nemen of u te identificeren. Persoonlijk identificeerbare informatie kan onder meer omvatten:",
  "Email address": "E-mailadres",
  "First name and last name": "Voornaam en achternaam",
  "Usage Data is collected automatically when using the Service.": "Gebruiksgegevens worden automatisch verzameld bij het gebruik van de service.",
  "Usage Data may include information such as Your Device's Internet Protocol address (e.g. IP address), browser type, browser version, the pages of our Service that You visit, the time and date of Your visit, the time spent on those pages, unique device identifiers and other diagnostic data.": "Gebruiksgegevens kunnen informatie bevatten zoals het internetprotocoladres van uw apparaat (bijv. IP-adres), browsertype, browserversie, de pagina's van onze service die u bezoekt, het tijdstip en de datum van uw bezoek, de tijd die u op die pagina's hebt doorgebracht, unieke apparaatidentificatoren en andere diagnostische gegevens.",
  "When You access the Service by or through a mobile device, We may collect certain information automatically, including, but not limited to, the type of mobile device You use, Your mobile device unique ID, the IP address of Your mobile device, Your mobile operating system, the type of mobile Internet browser You use, unique device identifiers and other diagnostic data.": "Wanneer u de service opent via een mobiel apparaat, kunnen wij bepaalde informatie automatisch verzamelen, waaronder, maar niet beperkt tot, het type mobiel apparaat dat u gebruikt, uw unieke ID voor mobiele apparaten, het IP-adres van uw mobiele apparaat, uw mobiele besturingssysteem, het type mobiele internetbrowser dat u gebruikt, unieke apparaatidentificatoren en andere diagnostische gegevens.",
  "We may also collect information that Your browser sends whenever You visit our Service or when You access the Service by or through a mobile device.": "Wij kunnen ook informatie verzamelen die uw browser automatisch verzendt wanneer u onze service bezoekt of wanneer u de service opent via een mobiel apparaat.",
  "Cookies & Browser Storage": "Cookies & Browseropslag",
  "The Websites may use cookies. We use cookies and browser storage only for essential settings to improve your experience—not for tracking. These help remember your preferences, such as language settings or consent choices, so you don’t have to reset them each time you visit.": "De websites kunnen cookies gebruiken. We gebruiken cookies en browseropslag alleen voor essentiële instellingen om uw ervaring te verbeteren - niet voor tracking. Deze helpen uw voorkeuren te onthouden, zoals taalinstellingen of toestemmingskeuzes, zodat u ze niet elke keer opnieuw hoeft in te stellen.",
  "We do not use cookies for tracking or personalized advertising. You can manage or disable cookies in your browser settings, but some features may not work properly without them.": "We gebruiken geen cookies voor tracking of gepersonaliseerde advertenties. U kunt cookies beheren of uitschakelen in uw browserinstellingen, maar sommige functies werken mogelijk niet goed zonder deze.",
  "Matomo Analytics": "Matomo Analytics",
  "Our website may use Matomo, an open-source analytics platform, to gather insights into website usage. This includes anonymized data such as:": "Onze website kan Matomo, een open-source analyseplatform, gebruiken om inzicht te krijgen in het gebruik van de website. Dit omvat geanonimiseerde gegevens zoals:",
  "Pages visited and navigation paths": "Bezochte pagina's en navigatiepaden",
  "Time spent on our website": "Tijd doorgebracht op onze website",
  "Whether you’re a returning or new visitor": "Of u een terugkerende of nieuwe bezoeker bent",
  "Your device type (desktop, mobile, etc.)": "Uw apparaattype (desktop, mobiel, etc.)",
  "To protect your privacy, your IP address is anonymized before being stored. The data we collect is only used to improve the website and is not used for personal identification.": "Om uw privacy te beschermen, wordt uw IP-adres geanonimiseerd voordat het wordt opgeslagen. De gegevens die we verzamelen worden alleen gebruikt om de website te verbeteren en worden niet gebruikt voor persoonlijke identificatie.",
  "Under Art. 6(1)(f) GDPR": "Onder Art. 6(1)(f) AVG",
  "we process this data based on our legitimate interest in enhancing our services.": "verwerken wij deze gegevens op basis van ons legitieme belang om onze diensten te verbeteren.",
  "Opt-Out Option": "Opt-Out Optie",
  "You can disable Matomo tracking at any time:": "U kunt op elk moment Matomo-tracking uitschakelen:",
  "Use of Your Personal Data": "Gebruik van uw persoonlijke gegevens",
  "The DAO may use Personal Data for the following purposes:": "De DAO kan persoonlijke gegevens gebruiken voor de volgende doeleinden:",
  "To provide and maintain our Service": "Om onze service te leveren en te onderhouden",
  "including to monitor the usage of our Service.": "inclusief het monitoren van het gebruik van onze service.",
  "For the performance of a contract": "Voor de uitvoering van een contract",
  "the development, compliance and undertaking of the purchase contract for the products, items or services You have purchased or of any other contract with Us through the Service.": "de ontwikkeling, naleving en uitvoering van het aankoopcontract voor de producten, items of diensten die u heeft gekocht of van elk ander contract met ons via de service.",
  "To contact You": "Om contact met U op te nemen",
  "To contact You by email, telephone calls, SMS, or other equivalent forms of electronic communication, such as a mobile application's push notifications regarding updates or informative communications related to the functionalities, products or contracted services, including the security updates, when necessary or reasonable for their implementation.": "Om contact met U op te nemen via e-mail, telefoongesprekken, SMS, of andere equivalent vormen van elektronische communicatie, zoals pushmeldingen van een mobiele applicatie met betrekking tot updates of informatieve communicatie gerelateerd aan de functionaliteiten, producten of gecontracteerde diensten, inclusief de beveiligingsupdates, wanneer noodzakelijk of redelijk voor hun implementatie.",
  "The DAO will retain Your Personal Data only for as long as is necessary for the purposes set out in this Privacy Policy. We will retain and use Your Personal Data to the extent necessary to comply with our legal obligations (for example, if we are required to retain your data to comply with applicable laws), resolve disputes, and enforce our legal agreements and policies.": "De DAO zal ook Gebruiksgegevens bewaren voor interne analyse doeleinden. Gebruiksgegevens worden over het algemeen voor een kortere periode bewaard, behalve wanneer deze gegevens worden gebruikt om de beveiliging te versterken of de functionaliteit van Onze Dienst te verbeteren, of wanneer wij wettelijk verplicht zijn om deze gegevens voor langere periodes te bewaren.",
  "Detailed Information on the Processing of Your Personal Data": "Gedetailleerde informatie over de verwerking van uw persoonlijke gegevens",
  "Your information, including Personal Data, is processed is processed at the DAO's website service provider(s) and in any other places where the parties involved in the processing are located. It means that this information may be transferred to — and maintained on — computers located outside of Your state, province, country or other governmental jurisdiction where the data protection laws may differ than those from Your jurisdiction.": "Uw informatie, inclusief persoonsgegevens, wordt verwerkt op de website van de DAO's serviceprovider(s) en op andere plaatsen waar de betrokken partijen bij de verwerking zich bevinden. Dit betekent dat deze informatie kan worden overgedragen aan — en onderhouden op — computers die zich buiten uw staat, provincie, land of andere overheidsjurisdictie bevinden waar de wetgeving inzake gegevensbescherming kan verschillen van die in uw jurisdictie.",
  "Your consent to this Privacy Policy followed by Your submission of such information represents Your agreement to that transfer.": "Uw toestemming voor dit privacybeleid gevolgd door uw indiening van dergelijke informatie vertegenwoordigt uw akkoord met die overdracht.",
  "The DAO will take all steps reasonably necessary to ensure that Your data is treated securely and in accordance with this Privacy Policy and no transfer of Your Personal Data will take place to an organization or a country unless there are adequate controls in place including the security of Your data and other personal information.": "De DAO zal alle redelijkerwijs noodzakelijke stappen ondernemen om ervoor te zorgen dat uw gegevens veilig worden behandeld en in overeenstemming met dit privacybeleid en er zal geen overdracht van uw persoonlijke gegevens plaatsvinden naar een organisatie of een land tenzij er adequate controles zijn ingesteld, inclusief de beveiliging van uw gegevens en andere persoonlijke informatie.",
  "Please note that any data transmission on the Internet (e.g. communication by e-mail) is generally not secure and we accept no liability for data transmitted to us via the Internet. Unfortunately, absolute protection is not technically possible. This information does not apply to the Website of third parties and the corresponding links given on our Website. The DAO assumes no responsibility and liability for these.": "Houd er rekening mee dat elke gegevensoverdracht via internet (bijv. communicatie via e-mail) over het algemeen niet veilig is en wij aanvaarden geen aansprakelijkheid voor gegevens die via internet aan ons worden verzonden. Helaas is absolute bescherming technisch niet mogelijk. Deze informatie is niet van toepassing op de website van derden en de bijbehorende links die op onze website worden gegeven. De DAO aanvaardt geen verantwoordelijkheid en aansprakelijkheid hiervoor.",
  "The Service Providers We use may have access to Your Personal Data. These third-party vendors collect, store, use, process and transfer information about Your activity on Our Service in accordance with their Privacy Policies.": "De serviceproviders die we gebruiken kunnen toegang hebben tot uw persoonlijke gegevens. Deze externe leveranciers verzamelen, bewaren, gebruiken, verwerken en overdragen informatie over uw activiteit op onze service in overeenstemming met hun privacybeleid.",
  "Email Marketing": "E-mailmarketing",
  "We may use Your Personal Data to contact You with newsletters, marketing or promotional materials and other information that may be of interest to You. You may opt-out of receiving any, or all, of these communications from Us by following the unsubscribe link or instructions provided in any email We send or by contacting Us.": "We kunnen uw persoonlijke gegevens gebruiken om contact met u op te nemen met nieuwsbrieven, marketing- of promotiemateriaal en andere informatie die voor u interessant kan zijn. U kunt ervoor kiezen om geen, of alle, van deze communicaties van ons te ontvangen door de afmeldlink of instructies te volgen die in elke e-mail die we sturen worden verstrekt of door contact met ons op te nemen.",
  "We may use Email Marketing Service Providers to manage and send emails to You;": "We kunnen e-mailmarketingserviceproviders gebruiken om e-mails naar u te beheren en te verzenden;",
  "Their Privacy Policy can be viewed at": "Hun privacybeleid kan worden bekeken op",
  "Usage, Performance and Miscellaneous": "Gebruik, prestaties en diversen",
  "We may use third-party Service Providers to maintain and improve our Service.": "We kunnen externe serviceproviders gebruiken om onze service te onderhouden en te verbeteren.",
  "hcaptcha": "hcaptcha",
  "GDPR Privacy": "GDPR Privacy",
  "Legal Basis for Processing Personal Data under GDPR": "Juridische basis voor de verwerking van persoonsgegevens onder de GDPR",
  "We may process Personal Data under the following conditions:": "We kunnen persoonsgegevens verwerken onder de volgende voorwaarden:",
  "Consent:": "Toestemming:",
  "You have given Your consent for processing Personal Data for one or more specific purposes.": "U heeft uw toestemming gegeven voor de verwerking van persoonsgegevens voor een of meer specifieke doeleinden.",
  "Performance of a contract:": "Uitvoering van een overeenkomst:",
  "Provision of Personal Data is necessary for the performance of an agreement with You and/or for any pre-contractual obligations thereof.": "Het verstrekken van persoonsgegevens is noodzakelijk voor de uitvoering van een overeenkomst met u en/of voor eventuele precontractuele verplichtingen daarvan.",
  "Legal obligations:": "Wettelijke verplichtingen:",
  "Processing Personal Data is necessary for compliance with a legal obligation to which the DAO is subject.": "Het verwerken van persoonsgegevens is noodzakelijk voor de naleving van een wettelijke verplichting waaraan de DAO is onderworpen.",
  "Vital interests:": "Vitale belangen:",
  "Processing Personal Data is necessary in order to protect Your vital interests or of another natural person.": "Het verwerken van persoonsgegevens is noodzakelijk om uw vitale belangen of die van een andere natuurlijke persoon te beschermen.",
  "Public interests:": "Algemeen belang:",
  "Processing Personal Data is related to a task that is carried out in the public interest or in the exercise of official authority vested in the DAO.": "Het verwerken van persoonsgegevens heeft betrekking op een taak die wordt uitgevoerd in het algemeen belang of in de uitoefening van officiële bevoegdheid die aan de DAO is toegekend.",
  "Legitimate interests:": "Legitieme belangen:",
  "Processing Personal Data is necessary for the purposes of the legitimate interests pursued by the DAO.": "Het verwerken van persoonsgegevens is noodzakelijk voor de doeleinden van de legitieme belangen die worden nagestreefd door de DAO.",
  "In any case, the DAO will gladly help to clarify the specific legal basis that applies to the processing, and in particular whether the provision of Personal Data is a statutory or contractual requirement, or a requirement necessary to enter into a contract.": "In elk geval zal de DAO graag helpen om de specifieke juridische basis te verduidelijken die van toepassing is op de verwerking, en met name of het verstrekken van persoonsgegevens een wettelijke of contractuele verplichting is, of een vereiste om een overeenkomst aan te gaan.",
  "Your Rights under the GDPR": "Uw rechten onder de GDPR",
  "The DAO undertakes to respect the confidentiality of Your Personal Data and to guarantee You can exercise Your rights.": "De DAO verbindt zich ertoe de vertrouwelijkheid van uw persoonsgegevens te respecteren en u in staat te stellen uw rechten uit te oefenen.",
  "You have the right under this Privacy Policy, and by law if You are within the EU, to:": "U heeft het recht onder dit privacybeleid, en volgens de wet als u binnen de EU bent, om:",
  "Request access to Your Personal Data.": "Verzoek om toegang tot uw persoonsgegevens.",
  "The right to access, update or delete the information We have on You. Whenever made possible, you can access, update or request deletion of Your Personal Data directly within Your account settings section. If you are unable to perform these actions yourself, please contact Us to assist You. This also enables You to receive a copy of the Personal Data We hold about You.": "Het recht om de informatie die wij over u hebben te bekijken, bij te werken of te verwijderen. Indien mogelijk kunt u toegang krijgen tot, bijwerken of verzoeken om verwijdering van uw persoonsgegevens rechtstreeks binnen de instellingen van uw account. Als u deze acties niet zelf kunt uitvoeren, neem dan contact met ons op om u te helpen. Dit stelt u ook in staat om een kopie te ontvangen van de persoonsgegevens die wij over u bewaren.",
  "Request correction of the Personal Data that We hold about You.": "Verzoek om correctie van de persoonsgegevens die wij over u bewaren.",
  "You have the right to have any incomplete or inaccurate information We hold about You corrected.": "U heeft het recht om onvolledige of onjuiste informatie die wij over u bewaren te laten corrigeren.",
  "Object to processing of Your Personal Data.": "Bezwaar maken tegen de verwerking van uw persoonsgegevens.",
  "This right exists where We are relying on a legitimate interest as the legal basis for Our processing and there is something about Your particular situation, which makes You want to object to our processing of Your Personal Data on this ground. You also have the right to object where We are processing Your Personal Data for direct marketing purposes.": "Dit recht bestaat wanneer wij vertrouwen op een legitiem belang als de juridische basis voor onze verwerking en er iets is aan uw specifieke situatie waardoor u bezwaar wilt maken tegen onze verwerking van uw persoonsgegevens op deze grond. U heeft ook het recht om bezwaar te maken wanneer wij uw persoonsgegevens verwerken voor direct marketingdoeleinden.",
  "Request erasure of Your Personal Data.": "Verzoek om verwijdering van uw persoonsgegevens.",
  "You have the right to ask Us to delete or remove Personal Data when there is no good reason for Us to continue processing it.": "U heeft het recht om ons te vragen uw persoonsgegevens te verwijderen of te verwijderen wanneer er geen goede reden is voor ons om door te gaan met de verwerking ervan.",
  "Request the transfer of Your Personal Data.": "Verzoek om overdracht van uw persoonsgegevens.",
  "We will provide to You, or to a third-party You have chosen, Your Personal Data in a structured, commonly used, machine-readable format. Please note that this right only applies to automated information which You initially provided consent for Us to use or where We used the information to perform a contract with You.": "Wij zullen u, of een door u gekozen derde, uw persoonsgegevens verstrekken in een gestructureerd, veelgebruikt, machinaal leesbaar formaat. Houd er rekening mee dat dit recht alleen van toepassing is op geautomatiseerde informatie waarvoor u aanvankelijk toestemming heeft gegeven om deze te gebruiken of waar wij de informatie hebben gebruikt om een overeenkomst met u uit te voeren.",
  "Withdraw Your consent.": "Uw toestemming intrekken.",
  "You have the right to withdraw Your consent on using your Personal Data. If You withdraw Your consent, We may not be able to provide You with access to certain specific functionalities of the Service.": "U heeft het recht om uw toestemming voor het gebruik van uw persoonsgegevens in te trekken. Als u uw toestemming intrekt, kunnen wij u mogelijk geen toegang verlenen tot bepaalde specifieke functionaliteiten van de Service.",
  "Exercising of Your GDPR Data Protection Rights": "Uitoefening van uw GDPR-gegevensbeschermingsrechten",
  "You may exercise Your rights of access, rectification, cancellation and opposition by contacting Us. Please note that we may ask You to verify Your identity before responding to such requests. If You make a request, We will try our best to respond to You as soon as possible.": "U kunt uw rechten van toegang, rectificatie, annulering en verzet uitoefenen door contact met ons op te nemen. Houd er rekening mee dat we u kunnen vragen uw identiteit te verifiëren voordat we op dergelijke verzoeken reageren. Als u een verzoek indient, zullen we ons best doen om zo snel mogelijk op uw verzoek te reageren.",
  "You have the right to complain to a Data Protection Authority about Our collection and use of Your Personal Data. For more information, if You are in the European Economic Area (EEA), please contact Your local data protection authority in the EEA.": "U heeft het recht om een klacht in te dienen bij een toezichthoudende autoriteit voor gegevensbescherming over onze verzameling en gebruik van uw persoonsgegevens. Voor meer informatie, als u zich in de Europese Economische Ruimte (EER) bevindt, neem dan contact op met uw lokale toezichthoudende autoriteit voor gegevensbescherming in de EER.",
  "Children's Privacy": "Privacy van kinderen",
  "Our Service does not address anyone under the age of 13. We do not knowingly collect personally identifiable information from anyone under the age of 13. If You are a parent or guardian and You are aware that Your child has provided Us with Personal Data, please contact Us. If We become aware that We have collected Personal Data from anyone under the age of 13 without verification of parental consent, We take steps to remove that information from Our servers.": "Onze Service is niet gericht op personen jonger dan 13 jaar. We verzamelen niet bewust persoonlijk identificeerbare informatie van personen jonger dan 13 jaar. Als u een ouder of voogd bent en u weet dat uw kind ons persoonsgegevens heeft verstrekt, neem dan contact met ons op. Als we ons ervan bewust worden dat we persoonsgegevens hebben verzameld van personen jonger dan 13 jaar zonder verificatie van ouderlijke toestemming, nemen we stappen om die informatie van onze servers te verwijderen.",
  "If We need to rely on consent as a legal basis for processing Your information and Your country requires consent from a parent, We may require Your parent's consent before We collect and use that information.": "Als we moeten vertrouwen op toestemming als juridische basis voor de verwerking van uw informatie en uw land toestemming van een ouder vereist, kunnen we toestemming van uw ouder vereisen voordat we die informatie verzamelen en gebruiken.",
  "Links to Other Websites": "Links naar andere websites",
  "Our Service may contain links to other websites that are not operated by Us. If You click on a third party link, You will be directed to that third party's site. We strongly advise You to review the Privacy Policy of every site You visit.": "Onze Service kan links bevatten naar andere websites die niet door ons worden beheerd. Als u op een link van een derde partij klikt, wordt u doorgestuurd naar de site van die derde partij. We raden u ten zeerste aan het privacybeleid van elke site die u bezoekt te bekijken.",
  "We have no control over and assume no responsibility for the content, privacy policies or practices of any third party sites or services.": "We hebben geen controle over en aanvaarden geen verantwoordelijkheid voor de inhoud, privacybeleid of praktijken van websites of diensten van derden.",
  "Changes to this Privacy Policy": "Wijzigingen in dit privacybeleid",
  "We may update Our Privacy Policy from time to time. We will notify You of any changes by posting the new Privacy Policy on this page.": "We kunnen ons privacybeleid van tijd tot tijd bijwerken. We zullen u op de hoogte stellen van eventuele wijzigingen door het nieuwe privacybeleid op deze pagina te plaatsen.",
  "We will let You know via email and/or a prominent notice on Our Service, prior to the change becoming effective and update the \"Last updated\" date at the top of this Privacy Policy.": "We zullen u op de hoogte stellen via e-mail en/of een opvallende mededeling op onze service, voordat de wijziging van kracht wordt en de datum van de laatste update bovenaan dit privacybeleid bijwerken.",
  "You are advised to review this Privacy Policy periodically for any changes. Changes to this Privacy Policy are effective when they are posted on this page.": "U wordt geadviseerd om dit privacybeleid regelmatig te controleren op eventuele wijzigingen. Wijzigingen in dit privacybeleid zijn van kracht wanneer ze op deze pagina worden geplaatst.",
  "Contact Us": "Neem contact met ons op",
  "If you have any questions about this Privacy Policy, You can contact us:": "Als u vragen heeft over dit privacybeleid, kunt u contact met ons opnemen:",
  "By visiting this page on our website:": "Door deze pagina op onze website te bezoeken:",
  "This Agreement is originally written in English. This AI translation is provided for your reference only.": "Dit akkoord is oorspronkelijk geschreven in het Engels. Deze AI-vertaling wordt alleen ter referentie verstrekt.",
  "Demo academic apps": "Demo academische apps",
  "Here are some demonstrational applications for academic needs. Some of them can be active, some of them not.": "Hier zijn enkele demonstratie-applicaties voor academische behoeften. Sommige kunnen actief zijn, andere niet.",
  "Hack Johnny's lab": "Hack Johnny's lab",
  "Johny's crypto lab is a cutting-edge hub filled with all sorts of smart gadgets, including a TurtleBot 4 robot that is known as a base for an iRobot vacuum. But imagine the thrill—and the risk—if someone managed to hack into the robot's camera. Ready to dive into the world of cybersecurity and test your hacking skills? See what you can uncover!": "Johny's crypto lab is een geavanceerd centrum vol met allerlei slimme gadgets, waaronder een TurtleBot 4 robot die bekend staat als basis voor een iRobot-stofzuiger. Maar stel je de opwinding - en het risico - voor als iemand erin slaagde om in de camera van de robot te hacken. Klaar om in de wereld van cyberbeveiliging te duiken en je hackvaardigheden te testen? Kijk wat je kunt ontdekken!",
  "Rules of the game": "Spelregels",
  "Unisender": "Unisender",
  "To provide You": "Om u te voorzien",
  "with news, special offers and general information about other goods, services and events which we offer that are similar to those that you have already purchased or enquired about unless You have opted not to receive such information.": "met nieuws, speciale aanbiedingen en algemene informatie over andere goederen, diensten en evenementen die wij aanbieden en die vergelijkbaar zijn met de goederen, diensten en evenementen die u al hebt gekocht of waarnaar u hebt geïnformeerd, tenzij u hebt aangegeven dat u dergelijke informatie niet wilt ontvangen.",
  "To manage Your requests": "Om uw verzoeken te beheren",
  "To attend and manage Your requests to Us.": "Om uw verzoeken aan ons te behandelen en te beheren.",
  "For other purposes": "Voor andere doeleinden",
  "We may use Your information for other purposes, such as data analysis, identifying usage trends, determining the effectiveness of our promotional campaigns and to evaluate and improve our Service, products, services, marketing and your experience.": "Wij kunnen uw gegevens gebruiken voor andere doeleinden, zoals gegevensanalyse, het identificeren van gebruikstrends, het bepalen van de effectiviteit van onze promotiecampagnes en om onze service, producten, diensten, marketing en uw ervaring te evalueren en te verbeteren.:",
  "We may share Your personal information in the following situations:": "Wij kunnen uw persoonlijke gegevens delen in de volgende situaties:",
  "With Service Providers": "Met serviceproviders",
  "We may share Your personal information with Service Providers to monitor and analyze the use of our Service, to contact You.": "We kunnen uw persoonlijke informatie delen met serviceproviders om het gebruik van onze service te monitoren en analyseren, om contact met u op te nemen.",
  "With Your consent": "Met uw toestemming",
  "We may disclose Your personal information for any other purpose with Your consent.": "We kunnen uw persoonlijke informatie voor elk ander doel openbaar maken met uw toestemming.",
  "Retention of Your Personal Data": "Bewaring van uw persoonlijke gegevens",
  "Security of Your Personal Data": "Beveiliging van uw persoonlijke gegevens",
  "The security of Your Personal Data is important to Us, but remember that no method of transmission over the Internet, or method of electronic storage is 100% secure. While We strive to use commercially acceptable means to protect Your Personal Data, We cannot guarantee its absolute security.": "De beveiliging van uw persoonlijke gegevens is belangrijk voor ons, maar onthoud dat geen enkele methode van verzending via internet of elektronische opslag 100% veilig is. Hoewel we streven naar het gebruik van commercieel aanvaardbare middelen om uw persoonlijke gegevens te beschermen, kunnen we de absolute beveiliging ervan niet garanderen."
}