{
  "404": "404",
  "Complexity:": "Complexiteit:",
  "Tags:": "Tags:",
  "Authors:": "Auteurs:",
  "Apply": "Toepassen",
  "Clear all": "Alles wissen",
  "Spring school 2023": "Spring school 2023",
  "ROS": "ROS",
  "Raspberry Pi": "Raspberry Pi",
  "ai": "ai",
  "Spot": "Spot",
  "Multi-Agent Systems": "Multi-Agent Systems",
  "Industrial": "Industrieel",
  "World computer": "Wereldcomputer",
  "Privacy Policy": "Privacybeleid",
  "Learn": "Leren",
  "Robonomics website": "Robonomics-website",
  "Tell us more": "Vertel ons meer",
  "Send": "Verzenden",
  "Sending your info...": "Uw informatie verzenden...",
  "Thanks": "Bedankt",
  "we’ll keep in touch": "we houden contact",
  "Results": "Resultaten",
  "Previous Lesson": "Vorige Les",
  "Previous Page": "Vorige Pagina",
  "Next Lesson": "Volgende Les",
  "Next Page": "Volgende Pagina",
  "You are currently opted out. Click here to opt in": "U bent momenteel afgemeld. Klik hier om u aan te melden",
  "You may choose not to have a unique web analytics cookie identification number assigned to your computer to avoid the aggregation and analysis of data collected on this website.": "U kunt ervoor kiezen om geen uniek cookie-identificatienummer voor webanalyse toe te wijzen aan uw computer om de verzameling en analyse van gegevens die op deze website zijn verzameld te vermijden.",
  "To make that choice, please click below to receive an opt-out cookie": "Om die keuze te maken, klik hieronder om een opt-out-cookie te ontvangen",
  "You are currently opted out. Click here to opt in.": "U bent momenteel afgemeld. Klik hier om u aan te melden.",
  "Opt-out complete; your visits to this website will not be recorded by the Web Analytics tool. Note that if you clear your cookies, delete the opt-out cookie, or if you change computers or Web browsers, you will need to perform the opt-out procedure again.": "Opt-out voltooid; uw bezoeken aan deze website worden niet geregistreerd door de Web Analytics-tool. Let op dat als u uw cookies wist, de opt-out-cookie verwijdert, of als u van computer of webbrowser verandert, u de opt-out-procedure opnieuw moet uitvoeren.",
  "Please click below to opt in:": "Klik hieronder om u aan te melden:",
  "You are currently opted in. Click here to opt out.": "U bent momenteel aangemeld. Klik hier om u af te melden.",
  "Latest update": "Laatste update",
  "on (date of commit)": "op (datum van commit)",
  "by (author of commit)": "door (auteur van commit)",
  "Completed the Course?": "Cursus voltooid?",
  "You can apply for a certificate of completion, after which you will be able to:": "U kunt een certificaat van voltooiing aanvragen, waarna u in staat zult zijn om:",
  "add certificate to your LinkedIn profile": "certificaat toevoegen aan uw LinkedIn-profiel",
  "apply for": "aanvragen voor",
  "Robonomics Ambassador Program": "Robonomics Ambassador Programma",
  "print the certificate and hang it on the wall.": "het certificaat afdrukken en aan de muur hangen.",
  "Apply for Certificate": "Certificaat aanvragen",
  "Ask question on GitHub": "Vraag stellen op GitHub",
  "Get Notifications & Updates": "Ontvang meldingen & updates",
  "You've come to the wrong classroom": "U bent in het verkeerde klaslokaal beland",
  "Return to main campus": "Terug naar de hoofdcampus",
  "Welcome to Our Online School!": "Welkom op onze online school!",
  "The core developers of the Robonomics project, robotics specialists and PhD research scientists offer to pass through compendious experience based on 7 years of work with web 3.0 projects.": "De kernontwikkelaars van het Robonomics-project, roboticaspecialisten en PhD-onderzoekswetenschappers bieden een beknopte ervaring op basis van 7 jaar werk met web 3.0-projecten.",
  "What can you discover for yourself in the academy?": "Wat kun je ontdekken in de academie?",
  "Web3 Advanced Applications": "Web3 Geavanceerde Toepassingen",
  "Find out how cutting-edge web3 technologies can be integrated into personal, city, or corporate settings on examples with practical uses in real-life scenarios.": "Ontdek hoe geavanceerde web3-technologieën kunnen worden geïntegreerd in persoonlijke, stedelijke of bedrijfsomgevingen aan de hand van voorbeelden met praktische toepassingen in realistische scenario's.",
  "Focus on decentralized IoT strategies that provide greater safety and flexibility compared to their centralized counterparts.": "Richt u op gedecentraliseerde IoT-strategieën die meer veiligheid en flexibiliteit bieden in vergelijking met hun gecentraliseerde tegenhangers.",
  "Study new robotics frameworks and SDKs and apply them to your projects.": "Bestudeer nieuwe robotica-frameworks en SDK's en pas ze toe op uw projecten.",
  "Peep insights how Norbert Wiener's principles of cybernetics are applied to modern autonomous systems.": "Kijk hoe de principes van cybernetica van Norbert Wiener worden toegepast op moderne autonome systemen.",
  "Discover new mechanisms of techno-economic communication between machines and humans.": "Ontdek nieuwe mechanismen van techno-economische communicatie tussen machines en mensen.",
  "Learn how to work with single board computers, sensors, smart devices and complex robots.": "Leer hoe u kunt werken met single board computers, sensoren, slimme apparaten en complexe robots.",
  "What is Robonomics?": "Wat is Robonomics?",
  "Robonomics is a secure, serverless and futuristic IoT platform that connects users and smart devices. It enables the exchange of technical and economic information in the form of atomic transactions between user applications, IoT services, and complex robotics.": "Robonomics is een veilig, serverloos en futuristisch IoT-platform dat gebruikers en slimme apparaten met elkaar verbindt. Het maakt de uitwisseling van technische en economische informatie mogelijk in de vorm van atomaire transacties tussen gebruikersapplicaties, IoT-services en complexe robotica.",
  "Learn more on Robonomics website": "Meer informatie op de Robonomics-website",
  "User Dapp": "Gebruikers-Dapp",
  "Function Request": "Functieverzoek",
  "Report": "Rapport",
  "Digital Twin": "Digitaal tweeling",
  "Control": "Controle",
  "Log": "Log",
  "IoT Device": "IoT-apparaat",
  "Learn and practice web3": "Leer en oefen web3",
  "Discover our expanding selection of hands-on exercises, tutorials, and online courses for free. The core developers and researchers at Robonomics invite you to enter the world of web3 and gain practical and theoretical skills through quizzes, device simulations, and even real-life setups using Robonomics Parachain (Polkadot), IPFS, and other web3 tools.": "Ontdek ons groeiende aanbod van praktische oefeningen, tutorials en online cursussen gratis. De kernontwikkelaars en onderzoekers bij Robonomics nodigen u uit om de wereld van web3 binnen te gaan en praktische en theoretische vaardigheden op te doen via quizzen, apparaatsimulaties en zelfs real-life opstellingen met behulp van Robonomics Parachain (Polkadot), IPFS en andere web3-tools.",
  "No courses were found with such filters.": "Er zijn geen cursussen gevonden met dergelijke filters.",
  "Try again": "Probeer opnieuw",
  "This Policy describes the information we collect from you, how we use that information and our legal basis for doing so. It also covers whether and how that information may be shared and your rights and choices regarding the information you provide to us.": "Dit beleid beschrijft de informatie die we van u verzamelen, hoe we die informatie gebruiken en onze wettelijke basis daarvoor. Het behandelt ook of en hoe die informatie kan worden gedeeld en uw rechten en keuzes met betrekking tot de informatie die u ons verstrekt.",
  "Where are those annoying cookie consent pop-ups?": "Waar zijn die vervelende cookie-toestemmingspop-ups?",
  "We don't need cookie consent is needed because:": "We hebben geen cookie-toestemming nodig omdat:",
  "Tracking cookies are not used": "Trackingcookies worden niet gebruikt",
  "The data is not used for any other purpose than analytics": "De gegevens worden niet voor een ander doel dan analyse gebruikt",
  "Visitors aren’t tracked across websites": "Bezoekers worden niet gevolgd over websites",
  "A user cannot be tracked across days within the same website": "Een gebruiker kan niet worden gevolgd over dagen binnen dezelfde website",
  "What We Collect and Receive": "Wat we verzamelen en ontvangen",
  "In order for us to provide you the best possible experience on our websites, we need to collect and process certain information. Depending on your use of the Services, that may include:": "Om u de best mogelijke ervaring op onze websites te bieden, moeten we bepaalde informatie verzamelen en verwerken. Afhankelijk van uw gebruik van de diensten kan dat omvatten:",
  "Contact us via email": "Neem contact met ons op via e-mail",
  "for example, when you submit our forms, send us questions or comments, or report a problem, we will collect your name, email address, message, etc. We use this data solely in connection with answering the queries we receive.": "bijvoorbeeld, wanneer u onze formulieren indient, ons vragen of opmerkingen stuurt, of een probleem meldt, zullen we uw naam, e-mailadres, bericht, etc. verzamelen. We gebruiken deze gegevens uitsluitend in verband met het beantwoorden van de vragen die we ontvangen.",
  "Usage data": "Gebruiksgegevens",
  "other": "anders",
  "non-personal data. We process this usage data only on our server, not passing it to third-parties with": "niet-persoonlijke gegevens. We verwerken deze gebruiksgegevens alleen op onze server, zonder deze door te geven aan derden met",
  "Matomo": "Matomo",
  "web analytics platform that gives us 100% data ownership. This analytics helps us to improve user experience with our website and to recognize and stop any misuse.": "webanalyseplatform dat ons 100% eigendom van gegevens geeft. Deze analyse helpt ons om de gebruikerservaring met onze website te verbeteren en om elk misbruik te herkennen en te stoppen.",
  "Non-personalized cookies": "Niet-gepersonaliseerde cookies",
  "we use non-tracking cookies (small data files transferred onto computers or devices by sites) for record-keeping purposes and to enhance functionality on our website. You may deactivate or restrict the transmission of these cookies by changing the settings of your web browser or by opt-out on this page in the form below. Cookies that are already stored may be deleted at any time.": "we gebruiken niet-trackende cookies (kleine gegevensbestanden die door sites op computers of apparaten worden overgebracht) voor het bijhouden van gegevens en om de functionaliteit op onze website te verbeteren. U kunt de overdracht van deze cookies deactiveren of beperken door de instellingen van uw webbrowser te wijzigen of door hieronder op deze pagina af te melden. Cookies die al zijn opgeslagen, kunnen op elk moment worden verwijderd.",
  "Opt-out of website tracking": "Opt-out van website tracking",
  "You can opt out of being tracked by our Matomo Analytics instance below:": "U kunt hieronder afmelden voor het volgen van onze Matomo Analytics-instantie:",
  "Your Rights": "Uw rechten",
  "You have the right to be informed of Personal Data processed by Matomo, a right to rectification/correction, erasure and restriction of processing. You also have the right to ask from us a structured, common and machine-readable format of Personal Data you provided to us.": "U heeft het recht om geïnformeerd te worden over persoonsgegevens die door Matomo worden verwerkt, het recht op rectificatie/correctie, verwijdering en beperking van verwerking. U heeft ook het recht om van ons een gestructureerd, gemeenschappelijk en machinaal leesbaar formaat van persoonsgegevens te vragen die u aan ons heeft verstrekt.",
  "We can only identify you via your email address and we can only adhere to your request and provide information if we have Personal Data about you through you having made contact with us directly and/or you using our site and/or service. We cannot provide, rectify or delete any data that we store on behalf of our users or customers.": "We kunnen u alleen identificeren via uw e-mailadres en we kunnen alleen voldoen aan uw verzoek en informatie verstrekken als we persoonsgegevens over u hebben doordat u rechtstreeks contact met ons heeft opgenomen en/of onze site en/of service heeft gebruikt. Wij kunnen geen gegevens verstrekken, corrigeren of verwijderen die wij namens onze gebruikers of klanten opslaan.",
  "To exercise any of the rights mentioned in this Privacy Policy and/or in the event of questions or comments relating to the use of Personal Data you may contact us.": "Om een van de in dit privacybeleid genoemde rechten uit te oefenen en/of in geval van vragen of opmerkingen met betrekking tot het gebruik van persoonsgegevens kunt u contact met ons opnemen.",
  "In addition, you have the right to lodge a complaint with the data protection authority in your jurisdiction.": "Bovendien heeft u het recht om een klacht in te dienen bij de gegevensbeschermingsautoriteit in uw rechtsgebied.",
  "Retention of data": "Bewaring van gegevens",
  "We will retain your information as long as necessary to provide you with the services or as otherwise set forth in this Policy. We will also retain and use this information as necessary for the purposes set out in this Policy and to the extent necessary to comply with our legal obligations, resolve disputes, enforce our agreements and protect Robonomics Academy legal rights.": "Wij zullen uw informatie bewaren zolang als nodig is om u de diensten te verlenen of zoals anders uiteengezet in dit beleid. We zullen ook deze informatie bewaren en gebruiken zoals nodig voor de doeleinden uiteengezet in dit beleid en voor zover nodig om te voldoen aan onze wettelijke verplichtingen, geschillen op te lossen, onze overeenkomsten af te dwingen en de juridische rechten van Robonomics Academy te beschermen.",
  "We also collect and maintain aggregated, anonymized or pseudonymized information which we may retain indefinitely to protect the safety and security of our Site, improve our Services or comply with legal obligations.": "We verzamelen en onderhouden ook geaggregeerde, geanonimiseerde of gepseudonimiseerde informatie die we mogelijk onbeperkt zullen bewaren om de veiligheid en beveiliging van onze site te beschermen, onze diensten te verbeteren of te voldoen aan wettelijke verplichtingen.",
  "This page has moved to a": "Deze pagina is verplaatst naar een",
  "Automatic redirecting": "Automatische doorverwijzing",
  "when you visit our website, we will store: the URL from which you visited us from, web pages of our website you visit, the date and duration of your visit, your anonymized IP address, the device specifications (device type, operating system, screen resolution, language, country you are located in, and web browser type) you used during your visit, and": "wanneer u onze website bezoekt, slaan we op: de URL van waaruit u ons heeft bezocht, de webpagina's van onze website die u bezoekt, de datum en duur van uw bezoek, uw geanonimiseerde IP-adres, de specificaties van het apparaat (apparaattype, besturingssysteem, schermresolutie, taal, land waarin u zich bevindt, en het type webbrowser) dat u heeft gebruikt tijdens uw bezoek, en",
  "Sending your request": "Uw verzoek wordt verzonden",
  "You are in the list": "U staat op de lijst",
  "By submitting this form you agree to receive emails with notifications and updates from the Robonomics Network team": "Door dit formulier in te dienen gaat u akkoord met het ontvangen van e-mails met meldingen en updates van het Robonomics Network team",
  "Strategies for IoT Decentralization": "Strategieën voor IoT decentralisatie",
  "Latest Robotics Tools": "Laatste robotica tools",
  "Modern Cybernetics": "Moderne cybernetica",
  "Economic Processes for Robots": "Economische processen voor robots",
  "Engineering Skills": "Engineering vaardigheden",
  "Your email": "Jouw e-mail",
  "Submit": "Verzenden",
  "course": "cursus",
  "guide": "gids",
  "launch simulation": "lancering simulatie",
  "real-life setup": "real-life setup",
  "Introduction to the ideas of Robonomics": "Kennismaking met de ideeën van Robonomics",
  "Broadcasting Through the Black Mirror": "Uitzenden via de Black Mirror",
  "At the Intersection of Cybernetics and Economics": "Op het snijvlak van cybernetica en economie",
  "Polkadot Ecosystem for Home IoT Infrastructure": "Polkadot-ecosysteem voor thuis-IoT-infrastructuur",
  "IoT Subscriptions Using Robonomics Parachain": "IoT-abonnementen met behulp van Robonomics Parachain",
  "Sovereign Smart Home with Robonomics and Home Assistant": "Soevereine slimme woning met Robonomics en Home Assistant",
  "Raspberry Pi Setup": "Raspberry Pi-installatie",
  "MQTT Broker Setup and Home Assistant Init": "MQTT Broker-installatie en Home Assistant Init",
  "Gateway Setup: Zigbee2MQTT": "Gateway-installatie: Zigbee2MQTT",
  "Gateway Setup: Robonomics SLS Gateway": "Gateway-installatie: Robonomics SLS Gateway",
  "Robonomics IoT Subscription Setup": "Robonomics IoT-abonnementinstallatie",
  "Robonomics Integration Setup": "Robonomics integratie-installatie",
  "Sensors Connectivity & Decentralized Sensors Network": "Sensorenconnectiviteit & Gedecentraliseerd sensorennetwerk",
  "Sensor Hardware": "Sensorhardware",
  "Setting up and connecting sensors": "Opzetten en verbinden van sensoren",
  "Sensors connectivity module": "Sensorenconnectiviteitsmodule",
  "Sensors connectivity config options": "Sensorenconnectiviteitsconfiguratieopties",
  "Sensor map deployment": "Sensor kaart implementatie",
  "Robonomics sensors measure analytics and archive mode": "Robonomics sensoren meetanalyse en archiefmodus",
  "Connect Mars Curiosity Rover": "Mars Curiosity Rover verbinden",
  "Connect ROS-compatible drone": "ROS-compatibele drone verbinden",
  "Connect Kuka manipulator": "Kuka manipulator verbinden",
  "Connect unmanned aerial vehicle": "Onbemand luchtvaartuig verbinden",
  "Control Baxter robot": "Baxter-robot bedienen",
  "ROS-based projects for smart spaces": "ROS-gebaseerde projecten voor slimme ruimtes",
  "Operate Boston Dynamics Spot": "Boston Dynamics Spot bedienen",
  "Quickstart Your Bachelor's Thesis with AI-powered Tools": "Snelstart van je bachelorscriptie met door AI aangedreven tools",
  "Introduction": "Introductie",
  "Literature Review": "Literatuuroverzicht",
  "Methods": "Methoden",
  "Conclusion": "Conclusie",
  "OpenGov for managing the IoT infrastructure": "OpenGov voor het beheren van de IoT-infrastructuur",
  "The Shadow of AdCorp's Intrusion": "De schaduw van de indringing van AdCorp",
  "Introduction to open source solution for private smart homes": "Introductie tot open source oplossing voor privé slimme woningen",
  "New Home, New Habits": "Nieuw huis, nieuwe gewoonten",
  "Assembling Smart Home Board": "Monteren van Smart Home Board",
  "Unleash Automation Potential": "Automatiseringspotentieel ontketenen",
  "Escape from Black Mirror": "Ontsnappen uit Black Mirror",
  "The story of a girl named Trinity": "Het verhaal van een meisje genaamd Trinity",
  "Fake Housewife & AI research Smart Home Solution": "Nep-huisvrouw & AI-onderzoek Slimme Huisoplossing",
  "Meet Fake Housewife Zoe and her story": "Ontmoet nep-huisvrouw Zoe en haar verhaal",
  "Risks of standard Smart Home solutions and the Home Assistant": "Risico's van standaard Slimme Huisoplossingen en de Home Assistant",
  "Blockchain-based Smart home solutions": "Blockchain-gebaseerde slimme huisoplossingen",
  "Home Assistant + blockchain+Web3": "Home Assistant + blockchain+Web3",
  "Studying the Sovereign smart home course at the academy and WIKI instructions": "Studeren van de soevereine slimme woning cursus aan de academie en WIKI-instructies",
  "Fake Housewife & AI is researching devices to install": "Nep-huisvrouw & AI is apparaten aan het onderzoeken om te installeren",
  "Fake Housewife & AI is installing a Smart Home Robonomics": "Nep-huisvrouw & AI installeert een Slimme Huis Robonomics",
  "AI scenario of the Relax zone for the Fake Housewife": "AI-scenario van de Relax-zone voor de nep-huisvrouw",
  "Software Developing for Boston Dynamics Spot": "Software ontwikkelen voor Boston Dynamics Spot",
  "Emergency Stop, Initialization, Body Position Control": "Noodstop, initialisatie, lichaamspositiecontrole",
  "Getting Used to Feecc": "Wennen aan Feecc",
  "Architecture": "Architectuur",
  "Overview": "Overzicht",
  "Demo of Feecc": "Demo van Feecc",
  "Deployment of Engineer Workbench": "Implementatie van Engineer Workbench",
  "Deployment of Analytics": "Implementatie van Analyse",
  "World computer in your home": "Wereldcomputer in je huis",
  "Part 1: The Idea of a World Computer": "Deel 1: Het idee van een wereldcomputer",
  "Part 2: The Heart of the World Computer": "Deel 2: Het hart van de wereldcomputer",
  "Part 3: Emergence of the World Computer": "Deel 3: Opkomst van de wereldcomputer",
  "Part 4: The Path of a New Block of Information in the World Computer": "Deel 4: Het pad van een nieuw blok informatie in de wereldcomputer",
  "Ivan Berman": "Ivan Berman",
  "Leemo": "Leemo",
  "Vadim Manaenko": "Vadim Manaenko",
  "Sergei Lonshakov": "Sergei Lonshakov",
  "Anna Wimmer-Savinova": "Anna Wimmer-Savinova",
  "Pavel Tarasov": "Pavel Tarasov",
  "Alexander Smekhnov": "Alexander Smekhnov",
  "Filter": "Filteren",
  "Note: you need to pass all lessons from course with one Polkadot.js account to apply for certificate": "Opmerking: je moet alle lessen van de cursus met één Polkadot.js-account halen om in aanmerking te komen voor een certificaat"
}