{
  "404": "404",
  "Complexity:": "Complexité:",
  "Tags:": "Balises:",
  "Authors:": "Auteurs:",
  "Apply": "Appliquer",
  "Clear all": "Effacer tout",
  "Spring school 2023": "École de printemps 2023",
  "ROS": "ROS",
  "Raspberry Pi": "Raspberry Pi",
  "ai": "ia",
  "Spot": "Spot",
  "Multi-Agent Systems": "Systèmes Multi-Agents",
  "Industrial": "Industriel",
  "World computer": "Ordinateur mondial",
  "Privacy Policy": "Politique de confidentialité",
  "Learn": "Apprendre",
  "Robonomics website": "Site web Robonomics",
  "Tell us more": "Dites-nous en plus",
  "Send": "Envoyer",
  "Sending your info...": "Envoi de vos informations...",
  "Thanks": "Merci",
  "we’ll keep in touch": "nous resterons en contact",
  "Results": "Résultats",
  "Previous Lesson": "Leçon précédente",
  "Previous Page": "Page précédente",
  "Next Lesson": "Leçon suivante",
  "Next Page": "Page suivante",
  "You are currently opted out. Click here to opt in": "Vous avez actuellement choisi de ne pas participer. Cliquez ici pour participer",
  "You may choose not to have a unique web analytics cookie identification number assigned to your computer to avoid the aggregation and analysis of data collected on this website.": "Vous pouvez choisir de ne pas avoir de numéro d'identification de cookie d'analyse Web unique attribué à votre ordinateur pour éviter l'agrégation et l'analyse des données collectées sur ce site Web.",
  "To make that choice, please click below to receive an opt-out cookie": "Pour faire ce choix, veuillez cliquer ci-dessous pour recevoir un cookie de désactivation",
  "You are currently opted out. Click here to opt in.": "Vous avez actuellement choisi de ne pas participer. Cliquez ici pour participer.",
  "Opt-out complete; your visits to this website will not be recorded by the Web Analytics tool. Note that if you clear your cookies, delete the opt-out cookie, or if you change computers or Web browsers, you will need to perform the opt-out procedure again.": "Désinscription terminée; vos visites sur ce site Web ne seront pas enregistrées par l'outil d'analyse Web. Notez que si vous effacez vos cookies, supprimez le cookie de désactivation ou si vous changez d'ordinateur ou de navigateur Web, vous devrez effectuer à nouveau la procédure de désinscription.",
  "Please click below to opt in:": "Veuillez cliquer ci-dessous pour participer:",
  "You are currently opted in. Click here to opt out.": "Vous avez actuellement choisi de participer. Cliquez ici pour vous désinscrire.",
  "Latest update": "Dernière mise à jour",
  "on (date of commit)": "le (date de validation)",
  "by (author of commit)": "par (auteur de validation)",
  "Completed the Course?": "Avez-vous terminé le cours?",
  "You can apply for a certificate of completion, after which you will be able to:": "Vous pouvez demander un certificat de réussite, après quoi vous pourrez:",
  "add certificate to your LinkedIn profile": "ajouter un certificat à votre profil LinkedIn",
  "apply for": "postuler pour",
  "Robonomics Ambassador Program": "Programme Ambassadeur Robonomics",
  "print the certificate and hang it on the wall.": "imprimer le certificat et l'accrocher au mur.",
  "Apply for Certificate": "Demander un certificat",
  "Ask question on GitHub": "Poser une question sur GitHub",
  "Get Notifications & Updates": "Recevoir des notifications et des mises à jour",
  "You've come to the wrong classroom": "Vous êtes dans la mauvaise salle de classe",
  "Return to main campus": "Retour au campus principal",
  "Welcome to Our Online School!": "Bienvenue dans notre école en ligne!",
  "The core developers of the Robonomics project, robotics specialists and PhD research scientists offer to pass through compendious experience based on 7 years of work with web 3.0 projects.": "Les développeurs principaux du projet Robonomics, des spécialistes de la robotique et des chercheurs en doctorat vous proposent de passer une expérience condensée basée sur 7 ans de travail avec des projets web 3.0.",
  "What can you discover for yourself in the academy?": "Que pouvez-vous découvrir par vous-même à l'académie?",
  "Web3 Advanced Applications": "Applications avancées Web3",
  "Find out how cutting-edge web3 technologies can be integrated into personal, city, or corporate settings on examples with practical uses in real-life scenarios.": "Découvrez comment les technologies de pointe Web3 peuvent être intégrées dans des environnements personnels, urbains ou d'entreprise sur des exemples avec des utilisations pratiques dans des scénarios de la vie réelle.",
  "Focus on decentralized IoT strategies that provide greater safety and flexibility compared to their centralized counterparts.": "Concentrez-vous sur les stratégies IoT décentralisées qui offrent une plus grande sécurité et flexibilité par rapport à leurs homologues centralisés.",
  "Study new robotics frameworks and SDKs and apply them to your projects.": "Étudiez de nouveaux cadres et SDK de robotique et appliquez-les à vos projets.",
  "Peep insights how Norbert Wiener's principles of cybernetics are applied to modern autonomous systems.": "Jetez un œil sur la manière dont les principes de cybernétique de Norbert Wiener sont appliqués aux systèmes autonomes modernes.",
  "Discover new mechanisms of techno-economic communication between machines and humans.": "Découvrez de nouveaux mécanismes de communication techno-économique entre les machines et les humains.",
  "Learn how to work with single board computers, sensors, smart devices and complex robots.": "Apprenez à travailler avec des ordinateurs à carte unique, des capteurs, des appareils intelligents et des robots complexes.",
  "What is Robonomics?": "Qu'est-ce que Robonomics?",
  "Robonomics is a secure, serverless and futuristic IoT platform that connects users and smart devices. It enables the exchange of technical and economic information in the form of atomic transactions between user applications, IoT services, and complex robotics.": "Robonomics est une plateforme IoT sécurisée, sans serveur et futuriste qui connecte les utilisateurs et les appareils intelligents. Il permet l'échange d'informations techniques et économiques sous forme de transactions atomiques entre les applications utilisateur, les services IoT et les robots complexes.",
  "Learn more on Robonomics website": "En savoir plus sur le site Web Robonomics",
  "User Dapp": "Dapp utilisateur",
  "Function Request": "Demande de fonction",
  "Report": "Rapport",
  "Digital Twin": "Jumeau numérique",
  "Control": "Contrôle",
  "Log": "Journal",
  "IoT Device": "Appareil IoT",
  "Learn and practice web3": "Apprendre et pratiquer le web3",
  "Discover our expanding selection of hands-on exercises, tutorials, and online courses for free. The core developers and researchers at Robonomics invite you to enter the world of web3 and gain practical and theoretical skills through quizzes, device simulations, and even real-life setups using Robonomics Parachain (Polkadot), IPFS, and other web3 tools.": "Découvrez notre sélection croissante d'exercices pratiques, de tutoriels et de cours en ligne gratuits. Les développeurs principaux et les chercheurs de Robonomics vous invitent à entrer dans le monde du web3 et à acquérir des compétences pratiques et théoriques grâce à des quiz, des simulations d'appareils et même des configurations réelles en utilisant Robonomics Parachain (Polkadot), IPFS et d'autres outils web3.",
  "No courses were found with such filters.": "Aucun cours n'a été trouvé avec de tels filtres.",
  "Try again": "Réessayer",
  "This Policy describes the information we collect from you, how we use that information and our legal basis for doing so. It also covers whether and how that information may be shared and your rights and choices regarding the information you provide to us.": "Cette politique décrit les informations que nous collectons auprès de vous, comment nous utilisons ces informations et notre base légale pour le faire. Elle couvre également si et comment ces informations peuvent être partagées et vos droits et choix concernant les informations que vous nous fournissez.",
  "Where are those annoying cookie consent pop-ups?": "Où sont ces pop-ups de consentement aux cookies ennuyeux?",
  "We don't need cookie consent is needed because:": "Nous n'avons pas besoin de consentement aux cookies car:",
  "Tracking cookies are not used": "Les cookies de suivi ne sont pas utilisés",
  "The data is not used for any other purpose than analytics": "Les données ne sont pas utilisées à d'autres fins que l'analyse",
  "Visitors aren’t tracked across websites": "Les visiteurs ne sont pas suivis sur différents sites Web",
  "A user cannot be tracked across days within the same website": "Un utilisateur ne peut pas être suivi sur plusieurs jours au sein du même site Web",
  "What We Collect and Receive": "Ce que nous collectons et recevons",
  "In order for us to provide you the best possible experience on our websites, we need to collect and process certain information. Depending on your use of the Services, that may include:": "Pour que nous puissions vous offrir la meilleure expérience possible sur nos sites Web, nous devons collecter et traiter certaines informations. Selon votre utilisation des Services, cela peut inclure:",
  "Contact us via email": "Contactez-nous par e-mail",
  "for example, when you submit our forms, send us questions or comments, or report a problem, we will collect your name, email address, message, etc. We use this data solely in connection with answering the queries we receive.": "par exemple, lorsque vous soumettez nos formulaires, nous envoyez des questions ou des commentaires, ou signalez un problème, nous collecterons votre nom, votre adresse e-mail, votre message, etc. Nous utilisons ces données uniquement en relation avec la réponse aux demandes que nous recevons.",
  "Usage data": "Données d'utilisation",
  "other": "autres",
  "non-personal data. We process this usage data only on our server, not passing it to third-parties with": "données non personnelles. Nous traitons ces données d'utilisation uniquement sur notre serveur, sans les transmettre à des tiers avec",
  "Matomo": "Matomo",
  "web analytics platform that gives us 100% data ownership. This analytics helps us to improve user experience with our website and to recognize and stop any misuse.": "plateforme d'analyse Web qui nous donne une propriété à 100% des données. Cette analyse nous aide à améliorer l'expérience utilisateur avec notre site Web et à reconnaître et arrêter tout abus.",
  "Non-personalized cookies": "Cookies non personnalisés",
  "we use non-tracking cookies (small data files transferred onto computers or devices by sites) for record-keeping purposes and to enhance functionality on our website. You may deactivate or restrict the transmission of these cookies by changing the settings of your web browser or by opt-out on this page in the form below. Cookies that are already stored may be deleted at any time.": "Nous utilisons des cookies non traçables (petits fichiers de données transférés sur les ordinateurs ou les appareils par les sites) à des fins d'enregistrement et pour améliorer la fonctionnalité de notre site web. Vous pouvez désactiver ou restreindre la transmission de ces cookies en modifiant les paramètres de votre navigateur web ou en vous désinscrivant sur cette page dans le formulaire ci-dessous. Les cookies déjà stockés peuvent être supprimés à tout moment.",
  "Opt-out of website tracking": "Désinscription du suivi du site web",
  "You can opt out of being tracked by our Matomo Analytics instance below:": "Vous pouvez vous désinscrire du suivi de notre instance d'analyse Matomo ci-dessous :",
  "Your Rights": "Vos droits",
  "You have the right to be informed of Personal Data processed by Matomo, a right to rectification/correction, erasure and restriction of processing. You also have the right to ask from us a structured, common and machine-readable format of Personal Data you provided to us.": "Vous avez le droit d'être informé des données personnelles traitées par Matomo, un droit de rectification/correction, d'effacement et de limitation du traitement. Vous avez également le droit de nous demander un format structuré, commun et lisible par machine des données personnelles que vous nous avez fournies.",
  "We can only identify you via your email address and we can only adhere to your request and provide information if we have Personal Data about you through you having made contact with us directly and/or you using our site and/or service. We cannot provide, rectify or delete any data that we store on behalf of our users or customers.": "Nous ne pouvons vous identifier que via votre adresse e-mail et nous ne pouvons adhérer à votre demande et fournir des informations que si nous avons des données personnelles vous concernant par le biais de votre contact direct avec nous et/ou de votre utilisation de notre site et/ou service. Nous ne pouvons pas fournir, rectifier ou supprimer des données que nous stockons pour le compte de nos utilisateurs ou clients.",
  "To exercise any of the rights mentioned in this Privacy Policy and/or in the event of questions or comments relating to the use of Personal Data you may contact us.": "Pour exercer l'un des droits mentionnés dans cette politique de confidentialité et/ou en cas de questions ou de commentaires concernant l'utilisation des données personnelles, vous pouvez nous contacter.",
  "In addition, you have the right to lodge a complaint with the data protection authority in your jurisdiction.": "De plus, vous avez le droit de déposer une plainte auprès de l'autorité de protection des données de votre juridiction.",
  "Retention of data": "Conservation des données",
  "We will retain your information as long as necessary to provide you with the services or as otherwise set forth in this Policy. We will also retain and use this information as necessary for the purposes set out in this Policy and to the extent necessary to comply with our legal obligations, resolve disputes, enforce our agreements and protect Robonomics Academy legal rights.": "Nous conserverons vos informations aussi longtemps que nécessaire pour vous fournir les services ou comme indiqué dans cette politique. Nous conserverons et utiliserons également ces informations dans la mesure nécessaire pour respecter nos obligations légales, résoudre les litiges, faire respecter nos accords et protéger les droits légaux de Robonomics Academy.",
  "We also collect and maintain aggregated, anonymized or pseudonymized information which we may retain indefinitely to protect the safety and security of our Site, improve our Services or comply with legal obligations.": "Nous collectons et conservons également des informations agrégées, anonymisées ou pseudonymisées que nous pouvons conserver indéfiniment pour protéger la sécurité de notre site, améliorer nos services ou respecter nos obligations légales.",
  "This page has moved to a": "Cette page a été déplacée vers un",
  "Automatic redirecting": "Redirection automatique",
  "when you visit our website, we will store: the URL from which you visited us from, web pages of our website you visit, the date and duration of your visit, your anonymized IP address, the device specifications (device type, operating system, screen resolution, language, country you are located in, and web browser type) you used during your visit, and": "lorsque vous visitez notre site web, nous stockerons : l'URL à partir de laquelle vous nous avez visité, les pages web de notre site que vous visitez, la date et la durée de votre visite, votre adresse IP anonymisée, les spécifications de l'appareil (type d'appareil, système d'exploitation, résolution d'écran, langue, pays dans lequel vous vous trouvez, et type de navigateur web) que vous avez utilisées lors de votre visite, et",
  "Sending your request": "Envoi de votre demande",
  "You are in the list": "Vous êtes dans la liste",
  "By submitting this form you agree to receive emails with notifications and updates from the Robonomics Network team": "En soumettant ce formulaire, vous acceptez de recevoir des e-mails avec des notifications et des mises à jour de l'équipe du réseau Robonomics",
  "Strategies for IoT Decentralization": "Stratégies pour la décentralisation de l'IoT",
  "Latest Robotics Tools": "Derniers outils de robotique",
  "Modern Cybernetics": "Cybernétique moderne",
  "Economic Processes for Robots": "Processus économiques pour les robots",
  "Engineering Skills": "Compétences en ingénierie",
  "Your email": "Votre email",
  "Submit": "Soumettre",
  "course": "cours",
  "guide": "guide",
  "launch simulation": "lancer la simulation",
  "real-life setup": "configuration en temps réel",
  "Introduction to the ideas of Robonomics": "Introduction aux idées de Robonomics",
  "Broadcasting Through the Black Mirror": "Diffusion à travers le Miroir Noir",
  "At the Intersection of Cybernetics and Economics": "À l'intersection de la cybernétique et de l'économie",
  "Polkadot Ecosystem for Home IoT Infrastructure": "Écosystème Polkadot pour l'infrastructure IoT domestique",
  "IoT Subscriptions Using Robonomics Parachain": "Abonnements IoT en utilisant Robonomics Parachain",
  "Sovereign Smart Home with Robonomics and Home Assistant": "Maison intelligente souveraine avec Robonomics et Home Assistant",
  "Raspberry Pi Setup": "Configuration de Raspberry Pi",
  "MQTT Broker Setup and Home Assistant Init": "Configuration du courtier MQTT et initialisation de Home Assistant",
  "Gateway Setup: Zigbee2MQTT": "Configuration de la passerelle: Zigbee2MQTT",
  "Gateway Setup: Robonomics SLS Gateway": "Configuration de la passerelle: Robonomics SLS Gateway",
  "Robonomics IoT Subscription Setup": "Configuration de l'abonnement IoT Robonomics",
  "Robonomics Integration Setup": "Configuration de l'intégration Robonomics",
  "Sensors Connectivity & Decentralized Sensors Network": "Connectivité des capteurs et réseau de capteurs décentralisé",
  "Sensor Hardware": "Matériel de capteur",
  "Setting up and connecting sensors": "Configuration et connexion des capteurs",
  "Sensors connectivity module": "Module de connectivité des capteurs",
  "Sensors connectivity config options": "Options de configuration de connectivité des capteurs",
  "Sensor map deployment": "Déploiement de la carte des capteurs",
  "Robonomics sensors measure analytics and archive mode": "Analyse des mesures et mode d'archivage des capteurs Robonomics",
  "Connect Mars Curiosity Rover": "Connecter le rover Curiosity de Mars",
  "Connect ROS-compatible drone": "Connecter un drone compatible ROS",
  "Connect Kuka manipulator": "Connecter le manipulateur Kuka",
  "Connect unmanned aerial vehicle": "Connecter un véhicule aérien sans pilote",
  "Control Baxter robot": "Contrôler le robot Baxter",
  "ROS-based projects for smart spaces": "Projets basés sur ROS pour les espaces intelligents",
  "Operate Boston Dynamics Spot": "Utiliser Boston Dynamics Spot",
  "Quickstart Your Bachelor's Thesis with AI-powered Tools": "Démarrer rapide de votre thèse de licence avec des outils alimentés par l'IA",
  "Introduction": "Introduction",
  "Literature Review": "Revue de la littérature",
  "Methods": "Méthodes",
  "Conclusion": "Conclusion",
  "OpenGov for managing the IoT infrastructure": "OpenGov pour la gestion de l'infrastructure IoT",
  "The Shadow of AdCorp's Intrusion": "L'ombre de l'intrusion d'AdCorp",
  "Introduction to open source solution for private smart homes": "Introduction à la solution open source pour les maisons intelligentes privées",
  "New Home, New Habits": "Nouvelle maison, nouvelles habitudes",
  "Assembling Smart Home Board": "Assemblage de la carte de la maison intelligente",
  "Unleash Automation Potential": "Libérer le potentiel d'automatisation",
  "Escape from Black Mirror": "Échapper au Miroir Noir",
  "The story of a girl named Trinity": "L'histoire d'une fille nommée Trinity",
  "Fake Housewife & AI research Smart Home Solution": "Fausse femme au foyer et solution de maison intelligente à base d'IA",
  "Meet Fake Housewife Zoe and her story": "Rencontrez la fausse femme au foyer Zoe et son histoire",
  "Risks of standard Smart Home solutions and the Home Assistant": "Risques des solutions standard de maison intelligente et de l'assistant domestique",
  "Blockchain-based Smart home solutions": "Solutions de maison intelligente basées sur la blockchain",
  "Home Assistant + blockchain+Web3": "Assistant domestique + blockchain+Web3",
  "Studying the Sovereign smart home course at the academy and WIKI instructions": "Étude du cours de maison intelligente souveraine à l'académie et instructions WIKI",
  "Fake Housewife & AI is researching devices to install": "La fausse femme au foyer et l'IA recherchent des appareils à installer",
  "Fake Housewife & AI is installing a Smart Home Robonomics": "La fausse femme au foyer et l'IA installent un Robonomics de maison intelligente",
  "AI scenario of the Relax zone for the Fake Housewife": "Scénario d'IA de la zone de relaxation pour la fausse femme au foyer",
  "Software Developing for Boston Dynamics Spot": "Développement de logiciels pour Boston Dynamics Spot",
  "Emergency Stop, Initialization, Body Position Control": "Arrêt d'urgence, initialisation, contrôle de la position du corps",
  "Getting Used to Feecc": "S'habituer à Feecc",
  "Architecture": "Architecture",
  "Overview": "Aperçu",
  "Demo of Feecc": "Démo de Feecc",
  "Deployment of Engineer Workbench": "Déploiement de l'établi d'ingénieur",
  "Deployment of Analytics": "Déploiement de l'analytique",
  "World computer in your home": "Ordinateur mondial dans votre maison",
  "Part 1: The Idea of a World Computer": "Partie 1: L'idée d'un ordinateur mondial",
  "Part 2: The Heart of the World Computer": "Partie 2: Le cœur de l'ordinateur mondial",
  "Part 3: Emergence of the World Computer": "Partie 3: Émergence de l'ordinateur mondial",
  "Part 4: The Path of a New Block of Information in the World Computer": "Partie 4: Le chemin d'un nouveau bloc d'informations dans l'ordinateur mondial",
  "Ivan Berman": "Ivan Berman",
  "Leemo": "Leemo",
  "Vadim Manaenko": "Vadim Manaenko",
  "Sergei Lonshakov": "Sergei Lonshakov",
  "Anna Wimmer-Savinova": "Anna Wimmer-Savinova",
  "Pavel Tarasov": "Pavel Tarasov",
  "Alexander Smekhnov": "Alexander Smekhnov",
  "Filter": "Filtre"
}