{
  "404": "404",
  "Welcome to Our Online School!": "Willkommen in unserer Online-Schule",
  "What is Robonomics?": "Was ist Robonomics?",
  "User Dapp": "Anwender (D)app",
  "Function Request": "Funktionsanforderung",
  "Report": "Berichte",
  "Digital Twin": "Digital twin",
  "Control": "Steuerung",
  "Log": "Protokoll",
  "IoT Device": "IoT Gerät",
  "Complexity:": "Komplexität:",
  "Tags:": "Tags:",
  "Authors:": "Autoren:",
  "Apply": "Anwenden",
  "Clear all": "Alle löschen",
  "Spring school 2023": "Frühjahrsschule 2023",
  "ROS": "ROS",
  "Raspberry Pi": "Raspberry Pi",
  "ai": "ki",
  "Spot": "Spot",
  "Multi-Agent Systems": "Multi-Agenten-Systeme",
  "Industrial": "Industrie",
  "World computer": "Weltcomputer",
  "Privacy Policy": "Datenschutzrichtlinie",
  "Learn": "Lernen",
  "Robonomics website": "Robonomics-Website",
  "Tell us more": "Erzählen Sie uns mehr",
  "Send": "Senden",
  "Sending your info...": "Ihre Informationen werden gesendet...",
  "Thanks": "Danke",
  "we’ll keep in touch": "wir bleiben in Kontakt",
  "Results": "Ergebnisse",
  "Previous Lesson": "Vorherige Lektion",
  "Previous Page": "Vorherige Seite",
  "Next Lesson": "Nächste Lektion",
  "Next Page": "Nächste Seite",
  "You are currently opted out. Click here to opt in": "Sie haben derzeit die Zustimmung abgelehnt. Klicken Sie hier, um zuzustimmen",
  "You may choose not to have a unique web analytics cookie identification number assigned to your computer to avoid the aggregation and analysis of data collected on this website.": "Sie können sich dafür entscheiden, dass Ihrem Computer keine eindeutige Webanalyse-Cookie-Identifikationsnummer zugewiesen wird, um die Aggregation und Analyse der auf dieser Website gesammelten Daten zu vermeiden.",
  "To make that choice, please click below to receive an opt-out cookie": "Um diese Wahl zu treffen, klicken Sie bitte unten, um ein Opt-Out-Cookie zu erhalten",
  "You are currently opted out. Click here to opt in.": "Sie haben derzeit die Zustimmung abgelehnt. Klicken Sie hier, um zuzustimmen.",
  "Opt-out complete; your visits to this website will not be recorded by the Web Analytics tool. Note that if you clear your cookies, delete the opt-out cookie, or if you change computers or Web browsers, you will need to perform the opt-out procedure again.": "Opt-out abgeschlossen; Ihre Besuche auf dieser Website werden nicht vom Webanalyse-Tool aufgezeichnet. Beachten Sie, dass Sie, wenn Sie Ihre Cookies löschen, das Opt-Out-Cookie löschen oder Ihren Computer oder Webbrowser ändern, den Opt-Out-Vorgang erneut durchführen müssen.",
  "Please click below to opt in:": "Bitte klicken Sie unten, um zuzustimmen:",
  "You are currently opted in. Click here to opt out.": "Sie haben derzeit zugestimmt. Klicken Sie hier, um abzulehnen.",
  "Latest update": "Neuestes Update",
  "on (date of commit)": "am (Commit-Datum)",
  "by (author of commit)": "von (Autor des Commits)",
  "Completed the Course?": "Kurs abgeschlossen?",
  "You can apply for a certificate of completion, after which you will be able to:": "Sie können ein Abschlusszertifikat beantragen, nachdem Sie:",
  "add certificate to your LinkedIn profile": "Zertifikat zu Ihrem LinkedIn-Profil hinzufügen",
  "apply for": "bewerben für",
  "Robonomics Ambassador Program": "Robonomics-Botschafterprogramm",
  "print the certificate and hang it on the wall.": "das Zertifikat drucken und an die Wand hängen.",
  "Apply for Certificate": "Zertifikat beantragen",
  "Ask question on GitHub": "Frage auf GitHub stellen",
  "Get Notifications & Updates": "Benachrichtigungen & Updates erhalten",
  "You've come to the wrong classroom": "Sie sind in den falschen Klassenraum gekommen",
  "Return to main campus": "Zurück zum Hauptcampus",
  "The core developers of the Robonomics project, robotics specialists and PhD research scientists offer to pass through compendious experience based on 7 years of work with web 3.0 projects.": "Die Kernentwickler des Robonomics-Projekts, Robotikspezialisten und PhD-Forschungswissenschaftler bieten an, auf der Grundlage von 7 Jahren Arbeit an Web-3.0-Projekten eine kompakte Erfahrung zu durchlaufen.",
  "What can you discover for yourself in the academy?": "Was können Sie in der Akademie selbst entdecken?",
  "Web3 Advanced Applications": "Web3 Advanced Applications",
  "Find out how cutting-edge web3 technologies can be integrated into personal, city, or corporate settings on examples with practical uses in real-life scenarios.": "Erfahren Sie, wie modernste Web3-Technologien anhand von Beispielen mit praktischen Anwendungen in realen Szenarien in persönlichen, städtischen oder Unternehmensumgebungen integriert werden können.",
  "Focus on decentralized IoT strategies that provide greater safety and flexibility compared to their centralized counterparts.": "Fokus auf dezentralisierte IoT-Strategien, die im Vergleich zu ihren zentralisierten Gegenstücken eine höhere Sicherheit und Flexibilität bieten.",
  "Study new robotics frameworks and SDKs and apply them to your projects.": "Studieren Sie neue Robotik-Frameworks und SDKs und wenden Sie sie auf Ihre Projekte an.",
  "Peep insights how Norbert Wiener's principles of cybernetics are applied to modern autonomous systems.": "Erhalten Sie Einblicke, wie Norbert Wieners Prinzipien der Kybernetik auf moderne autonome Systeme angewendet werden.",
  "Discover new mechanisms of techno-economic communication between machines and humans.": "Entdecken Sie neue Mechanismen der technisch-wirtschaftlichen Kommunikation zwischen Maschinen und Menschen.",
  "Learn how to work with single board computers, sensors, smart devices and complex robots.": "Lernen Sie, wie Sie mit Einplatinencomputern, Sensoren, intelligenten Geräten und komplexen Robotern arbeiten.",
  "Robonomics is a secure, serverless and futuristic IoT platform that connects users and smart devices. It enables the exchange of technical and economic information in the form of atomic transactions between user applications, IoT services, and complex robotics.": "Robonomics ist eine sichere, serverlose und futuristische IoT-Plattform, die Benutzer und intelligente Geräte verbindet. Es ermöglicht den Austausch von technischen und wirtschaftlichen Informationen in Form atomarer Transaktionen zwischen Benutzeranwendungen, IoT-Diensten und komplexen Robotern.",
  "Learn more on Robonomics website": "Erfahren Sie mehr auf der Robonomics-Website",
  "Learn and practice web3": "Lernen und üben Sie Web3",
  "Discover our expanding selection of hands-on exercises, tutorials, and online courses for free. The core developers and researchers at Robonomics invite you to enter the world of web3 and gain practical and theoretical skills through quizzes, device simulations, and even real-life setups using Robonomics Parachain (Polkadot), IPFS, and other web3 tools.": "Entdecken Sie unsere wachsende Auswahl an praktischen Übungen, Tutorials und Online-Kursen kostenlos. Die Kernentwickler und Forscher von Robonomics laden Sie ein, in die Welt von Web3 einzutreten und praktische und theoretische Fähigkeiten durch Quizfragen, Gerätesimulationen und sogar reale Setups mit Robonomics Parachain (Polkadot), IPFS und anderen Web3-Tools zu erlangen.",
  "No courses were found with such filters.": "Es wurden keine Kurse mit solchen Filtern gefunden.",
  "Try again": "Versuchen Sie es erneut",
  "This Policy describes the information we collect from you, how we use that information and our legal basis for doing so. It also covers whether and how that information may be shared and your rights and choices regarding the information you provide to us.": "Diese Richtlinie beschreibt die Informationen, die wir von Ihnen sammeln, wie wir diese Informationen verwenden und unsere rechtliche Grundlage dafür. Es wird auch behandelt, ob und wie diese Informationen geteilt werden können und Ihre Rechte und Möglichkeiten in Bezug auf die Informationen, die Sie uns zur Verfügung stellen.",
  "Where are those annoying cookie consent pop-ups?": "Wo sind diese nervigen Cookie-Einwilligungs-Pop-ups?",
  "We don't need cookie consent is needed because:": "Wir benötigen keine Cookie-Einwilligung, weil:",
  "Tracking cookies are not used": "Tracking-Cookies werden nicht verwendet",
  "The data is not used for any other purpose than analytics": "Die Daten werden nicht für andere Zwecke als die Analyse verwendet",
  "Visitors aren’t tracked across websites": "Besucher werden nicht über Websites hinweg verfolgt",
  "A user cannot be tracked across days within the same website": "Ein Benutzer kann nicht über Tage hinweg innerhalb derselben Website verfolgt werden",
  "What We Collect and Receive": "Was wir sammeln und erhalten",
  "In order for us to provide you the best possible experience on our websites, we need to collect and process certain information. Depending on your use of the Services, that may include:": "Um Ihnen das bestmögliche Erlebnis auf unseren Websites zu bieten, müssen wir bestimmte Informationen sammeln und verarbeiten. Je nach Ihrer Nutzung der Dienste kann dies Folgendes umfassen:",
  "Contact us via email": "Kontaktieren Sie uns per E-Mail",
  "for example, when you submit our forms, send us questions or comments, or report a problem, we will collect your name, email address, message, etc. We use this data solely in connection with answering the queries we receive.": "zum Beispiel, wenn Sie unsere Formulare absenden, uns Fragen oder Kommentare senden oder ein Problem melden, werden wir Ihren Namen, Ihre E-Mail-Adresse, Ihre Nachricht usw. sammeln. Wir verwenden diese Daten ausschließlich im Zusammenhang mit der Beantwortung der Anfragen, die wir erhalten.",
  "Usage data": "Nutzungsdaten",
  "other": "andere",
  "non-personal data. We process this usage data only on our server, not passing it to third-parties with": "nicht personenbezogene Daten. Wir verarbeiten diese Nutzungsdaten nur auf unserem Server und geben sie nicht an Dritte weiter mit",
  "Matomo": "Matomo",
  "web analytics platform that gives us 100% data ownership. This analytics helps us to improve user experience with our website and to recognize and stop any misuse.": "Webanalyseplattform, die uns 100% Datenbesitz bietet. Diese Analyse hilft uns, die Benutzererfahrung auf unserer Website zu verbessern und Missbrauch zu erkennen und zu stoppen.",
  "Non-personalized cookies": "Nicht personalisierte Cookies",
  "we use non-tracking cookies (small data files transferred onto computers or devices by sites) for record-keeping purposes and to enhance functionality on our website. You may deactivate or restrict the transmission of these cookies by changing the settings of your web browser or by opt-out on this page in the form below. Cookies that are already stored may be deleted at any time.": "Wir verwenden nicht nachverfolgende Cookies (kleine Daten, die von Websites auf Computer oder Geräte übertragen werden) zu Aufzeichnungszwecken und zur Verbesserung der Funktionalität auf unserer Website. Sie können die Übertragung dieser Cookies deaktivieren oder einschränken, indem Sie die Einstellungen Ihres Webbrowsers ändern oder sich auf dieser Seite im untenstehenden Formular abmelden. Bereits gespeicherte Cookies können jederzeit gelöscht werden.",
  "Opt-out of website tracking": "Opt-out der Website-Verfolgung",
  "You can opt out of being tracked by our Matomo Analytics instance below:": "Sie können sich unten von unserer Matomo Analytics-Instanz verfolgen lassen:",
  "Your Rights": "Ihre Rechte",
  "You have the right to be informed of Personal Data processed by Matomo, a right to rectification/correction, erasure and restriction of processing. You also have the right to ask from us a structured, common and machine-readable format of Personal Data you provided to us.": "Sie haben das Recht, über die von Matomo verarbeiteten personenbezogenen Daten informiert zu werden, ein Recht auf Berichtigung/Löschung, Löschung und Einschränkung der Verarbeitung. Sie haben auch das Recht, von uns ein strukturiertes, gemeinsames und maschinenlesbares Format der personenbezogenen Daten anzufordern, die Sie uns zur Verfügung gestellt haben.",
  "We can only identify you via your email address and we can only adhere to your request and provide information if we have Personal Data about you through you having made contact with us directly and/or you using our site and/or service. We cannot provide, rectify or delete any data that we store on behalf of our users or customers.": "Wir können Sie nur anhand Ihrer E-Mail-Adresse identifizieren und wir können nur Ihrem Wunsch entsprechen und Informationen bereitstellen, wenn wir personenbezogene Daten über Sie haben, die Sie direkt mit uns in Kontakt gebracht haben und/oder unsere Website und/oder unseren Service nutzen. Wir können keine Daten bereitstellen, berichtigen oder löschen, die wir im Auftrag unserer Benutzer oder Kunden speichern.",
  "To exercise any of the rights mentioned in this Privacy Policy and/or in the event of questions or comments relating to the use of Personal Data you may contact us.": "Um eines der in dieser Datenschutzrichtlinie genannten Rechte auszuüben und/oder bei Fragen oder Kommentaren zur Verwendung personenbezogener Daten können Sie uns kontaktieren.",
  "In addition, you have the right to lodge a complaint with the data protection authority in your jurisdiction.": "Darüber hinaus haben Sie das Recht, eine Beschwerde bei der Datenschutzbehörde in Ihrer Gerichtsbarkeit einzureichen.",
  "Retention of data": "Datenspeicherung",
  "We will retain your information as long as necessary to provide you with the services or as otherwise set forth in this Policy. We will also retain and use this information as necessary for the purposes set out in this Policy and to the extent necessary to comply with our legal obligations, resolve disputes, enforce our agreements and protect Robonomics Academy legal rights.": "Wir werden Ihre Informationen so lange aufbewahren, wie es zur Bereitstellung der Dienste erforderlich ist oder wie es in dieser Richtlinie festgelegt ist. Wir werden diese Informationen auch so lange aufbewahren und verwenden, wie es zur Erfüllung der in dieser Richtlinie festgelegten Zwecke und zur Erfüllung unserer rechtlichen Verpflichtungen, zur Beilegung von Streitigkeiten, zur Durchsetzung unserer Vereinbarungen und zum Schutz der rechtlichen Rechte der Robonomics Academy erforderlich ist.",
  "We also collect and maintain aggregated, anonymized or pseudonymized information which we may retain indefinitely to protect the safety and security of our Site, improve our Services or comply with legal obligations.": "Wir sammeln und speichern auch aggregierte, anonymisierte oder pseudonymisierte Informationen, die wir unbegrenzt aufbewahren können, um die Sicherheit und den Schutz unserer Website zu gewährleisten, unsere Dienste zu verbessern oder rechtliche Verpflichtungen zu erfüllen.",
  "This page has moved to a": "Diese Seite wurde verschoben nach",
  "Automatic redirecting": "Automatische Weiterleitung",
  "when you visit our website, we will store: the URL from which you visited us from, web pages of our website you visit, the date and duration of your visit, your anonymized IP address, the device specifications (device type, operating system, screen resolution, language, country you are located in, and web browser type) you used during your visit, and": "Wenn Sie unsere Website besuchen, speichern wir: die URL, von der aus Sie uns besucht haben, die Webseiten unserer Website, die Sie besuchen, das Datum und die Dauer Ihres Besuchs, Ihre anonymisierte IP-Adresse, die Gerätespezifikationen (Gerätetyp, Betriebssystem, Bildschirmauflösung, Sprache, Land, in dem Sie sich befinden, und Browsertyp) während Ihres Besuchs verwendet wurden, und",
  "Sending your request": "Senden Ihrer Anfrage",
  "You are in the list": "Sie sind in der Liste",
  "By submitting this form you agree to receive emails with notifications and updates from the Robonomics Network team": "Durch das Absenden dieses Formulars stimmen Sie zu, E-Mails mit Benachrichtigungen und Updates vom Robonomics Network-Team zu erhalten",
  "Strategies for IoT Decentralization": "Strategien für die Dezentralisierung des IoT",
  "Latest Robotics Tools": "Neueste Robotik-Tools",
  "Modern Cybernetics": "Moderne Kybernetik",
  "Economic Processes for Robots": "Wirtschaftsprozesse für Roboter",
  "Engineering Skills": "Ingenieurwissenschaftliche Fähigkeiten",
  "Your email": "Ihre E-Mail",
  "Submit": "Absenden",
  "course": "Kurs",
  "guide": "Anleitung",
  "launch simulation": "Start der Simulation",
  "real-life setup": "Einrichtung im echten Leben",
  "Introduction to the ideas of Robonomics": "Einführung in die Ideen von Robonomics",
  "Broadcasting Through the Black Mirror": "Übertragung durch den Schwarzen Spiegel",
  "At the Intersection of Cybernetics and Economics": "An der Schnittstelle von Kybernetik und Wirtschaft",
  "Polkadot Ecosystem for Home IoT Infrastructure": "Polkadot-Ökosystem für die Heim-IoT-Infrastruktur",
  "IoT Subscriptions Using Robonomics Parachain": "IoT-Abonnements mit Robonomics-Parachain",
  "Sovereign Smart Home with Robonomics and Home Assistant": "Souveränes Smart Home mit Robonomics und Home Assistant",
  "Raspberry Pi Setup": "Raspberry Pi Einrichtung",
  "MQTT Broker Setup and Home Assistant Init": "MQTT-Broker Einrichtung und Home Assistant Init",
  "Gateway Setup: Zigbee2MQTT": "Gateway-Einrichtung: Zigbee2MQTT",
  "Gateway Setup: Robonomics SLS Gateway": "Gateway-Einrichtung: Robonomics SLS Gateway",
  "Robonomics IoT Subscription Setup": "Robonomics IoT-Abonnement-Einrichtung",
  "Robonomics Integration Setup": "Robonomics-Integrations-Einrichtung",
  "Sensors Connectivity & Decentralized Sensors Network": "Sensoren-Konnektivität & Dezentrales Sensorennetzwerk",
  "Sensor Hardware": "Sensor-Hardware",
  "Setting up and connecting sensors": "Einrichten und Verbinden von Sensoren",
  "Sensors connectivity module": "Sensoren-Konnektivitätsmodul",
  "Sensors connectivity config options": "Sensoren-Konnektivität Konfigurationsoptionen",
  "Sensor map deployment": "Sensor-Kartenbereitstellung",
  "Robonomics sensors measure analytics and archive mode": "Robonomics-Sensoren messen Analytik und Archivmodus",
  "Connect Mars Curiosity Rover": "Mars Curiosity Rover verbinden",
  "Connect ROS-compatible drone": "ROS-kompatiblen Drohne verbinden",
  "Connect Kuka manipulator": "Kuka-Manipulator verbinden",
  "Connect unmanned aerial vehicle": "Unbemanntes Luftfahrzeug verbinden",
  "Control Baxter robot": "Baxter-Roboter steuern",
  "ROS-based projects for smart spaces": "ROS-basierte Projekte für intelligente Räume",
  "Operate Boston Dynamics Spot": "Boston Dynamics Spot bedienen",
  "Quickstart Your Bachelor's Thesis with AI-powered Tools": "Schnellstart Ihrer Bachelorarbeit mit KI-gestützten Tools",
  "Introduction": "Einführung",
  "Literature Review": "Literaturübersicht",
  "Methods": "Methoden",
  "Conclusion": "Fazit",
  "OpenGov for managing the IoT infrastructure": "OpenGov zur Verwaltung der IoT-Infrastruktur",
  "The Shadow of AdCorp's Intrusion": "Der Schatten von AdCorps Eindringen",
  "Introduction to open source solution for private smart homes": "Einführung in die Open-Source-Lösung für private Smart Homes",
  "New Home, New Habits": "Neues Zuhause, neue Gewohnheiten",
  "Assembling Smart Home Board": "Zusammenbau der Smart Home-Platine",
  "Unleash Automation Potential": "Automatisierungspotenzial entfesseln",
  "Escape from Black Mirror": "Flucht aus dem Schwarzen Spiegel",
  "The story of a girl named Trinity": "Die Geschichte eines Mädchens namens Trinity",
  "Fake Housewife & AI research Smart Home Solution": "Falsche Hausfrau & KI-Forschungslösung für Smart Home",
  "Meet Fake Housewife Zoe and her story": "Treffen Sie die falsche Hausfrau Zoe und ihre Geschichte",
  "Risks of standard Smart Home solutions and the Home Assistant": "Risiken von Standard-Smart-Home-Lösungen und dem Home Assistant",
  "Blockchain-based Smart home solutions": "Blockchain-basierte Smart-Home-Lösungen",
  "Home Assistant + blockchain+Web3": "Home Assistant + Blockchain + Web3",
  "Studying the Sovereign smart home course at the academy and WIKI instructions": "Studium des Souveränen Smart Home-Kurses an der Akademie und WIKI-Anweisungen",
  "Fake Housewife & AI is researching devices to install": "Falsche Hausfrau & KI untersucht Geräte zur Installation",
  "Fake Housewife & AI is installing a Smart Home Robonomics": "Falsche Hausfrau & KI installiert ein Smart Home Robonomics",
  "AI scenario of the Relax zone for the Fake Housewife": "KI-Szenario der Entspannungszone für die falsche Hausfrau",
  "Software Developing for Boston Dynamics Spot": "Softwareentwicklung für Boston Dynamics Spot",
  "Emergency Stop, Initialization, Body Position Control": "Not-Aus, Initialisierung, Körperpositionskontrolle",
  "Getting Used to Feecc": "Anpassung an Feecc",
  "Architecture": "Architektur",
  "Overview": "Übersicht",
  "Demo of Feecc": "Demo von Feecc",
  "Deployment of Engineer Workbench": "Bereitstellung der Ingenieurwerkbank",
  "Deployment of Analytics": "Bereitstellung von Analysen",
  "World computer in your home": "Weltcomputer in Ihrem Zuhause",
  "Part 1: The Idea of a World Computer": "Teil 1: Die Idee eines Weltcomputers",
  "Part 2: The Heart of the World Computer": "Teil 2: Das Herz des Weltcomputers",
  "Part 3: Emergence of the World Computer": "Teil 3: Entstehung des Weltcomputers",
  "Part 4: The Path of a New Block of Information in the World Computer": "Teil 4: Der Weg eines neuen Informationsblocks im Weltcomputer",
  "Ivan Berman": "Ivan Berman",
  "Leemo": "Leemo",
  "Vadim Manaenko": "Vadim Manaenko",
  "Sergei Lonshakov": "Sergei Lonshakov",
  "Anna Wimmer-Savinova": "Anna Wimmer-Savinova",
  "Pavel Tarasov": "Pavel Tarasov",
  "Alexander Smekhnov": "Alexander Smekhnov",
  "Filter": "Filter"
}