{
  "404": "404",
  "Learn": "सीखें",
  "Welcome to Our Online School!": "हमारे ऑनलाइन स्कूल में आपका स्वागत है!",
  "The core developers of the Robonomics project, robotics specialists and PhD research scientists offer to pass through compendious experience based on 7 years of work with web 3.0 projects.": "रोबोनॉमिक्स परियोजना के मूल डेवलपर, रोबोटिक्स विशेषज्ञ और डॉक्टरेट शोध वैज्ञानिक आपको वेब 3.0 परियोजनाओं के साथ 7 साल के काम के आधार पर संक्षेपित अनुभव पारित करने का प्रस्ताव करते हैं।",
  "What can you discover for yourself in the academy?": "आप अकादमी में खुद के लिए क्या खोज सकते हैं?",
  "Web3 Advanced Applications": "वेब3 उन्नत एप्लिकेशन",
  "Find out how cutting-edge web3 technologies can be integrated into personal, city, or corporate settings on examples with practical uses in real-life scenarios.": "जानें कैसे कटिंग-एज वेब3 प्रौद्योगिकियों को व्यक्तिगत, शहरी या कॉर्पोरेट सेटिंग में एकीकृत किया जा सकता है उदाहरणों के साथ जीवन के वास्तविक स्थितियों में उपयोग के प्रायोगिक उदाहरणों पर।",
  "Strategies for IoT Decentralization": "आईओटी डीसेंट्रलाइजेशन के लिए रणनीतिया",
  "Focus on decentralized IoT strategies that provide greater safety and flexibility compared to their centralized counterparts.": "केंद्रीकृत समकक्षों की तुलना में अधिक सुरक्षा और लचीलाई प्रदान करने वाली डीसेंट्रलाइज्ड आईओटी रणनीतियों पर ध्यान केंद्रित करें।",
  "Latest Robotics Tools": "नवीनतम रोबोटिक्स उपकरण",
  "Study new robotics frameworks and SDKs and apply them to your projects.": "नए रोबोटिक्स फ्रेमवर्क और एसडीकेस का अध्ययन करें और उन्हें अपने परियोजनाओं में लागू करें।",
  "Modern Cybernetics": "आधुनिक साइबरनेटिक्स",
  "Peep insights how Norbert Wiener's principles of cybernetics are applied to modern autonomous systems.": "नोर्बर्ट विनर के साइबरनेटिक्स के सिद्धांतों को आधुनिक स्वतंत्र प्रणालियों पर कैसे लागू किया जाता है, इसके अंदर झांकियां डालें।",
  "Economic Processes for Robots": "रोबोटों के लिए आर्थिक प्रक्रियाएँ",
  "Discover new mechanisms of techno-economic communication between machines and humans.": "मशीनों और मानवों के बीच नई तकनीकी-आर्थिक संचार के नए तंत्र खोजें।",
  "Engineering Skills": "इंजीनियरिंग कौशल",
  "Learn how to work with single board computers, sensors, smart devices and complex robots.": "सिंगल बोर्ड कंप्यूटर, सेंसर, स्मार्ट डिवाइस और जटिल रोबोटों के साथ कैसे काम करना सीखें।",
  "What is Robonomics?": "रोबोनमिक्स क्या है?",
  "Robonomics is a secure, serverless and futuristic IoT platform that connects users and smart devices. It enables the exchange of technical and economic information in the form of atomic transactions between user applications, IoT services, and complex robotics.": "रोबोनॉमिक्स एक सुरक्षित, सर्वरलेस और भविष्यवाणी आईओटी प्लेटफॉर्म है जो उपयोगकर्ताओं और स्मार्ट डिवाइस को जोड़ता है। यह यूजर एप्लिकेशन, आईओटी सेवाएं और जटिल रोबोटिक्स के बीच एटॉमिक लेनदेन के रूप में तकनीकी और आर्थिक जानकारी का विनिमय संभव बनाता है।",
  "Learn more on Robonomics website": "रोबोनॉमिक्स वेबसाइट पर अधिक जानें",
  "User Dapp": "उपयोगकर्ता डैप",
  "Function Request": "कार्य अनुरोध",
  "Report": "रिपोर्ट",
  "Digital Twin": "डिजिटल ट्विन",
  "Control": "नियंत्रण",
  "Log": "लॉग",
  "IoT Device": "आईओटी डिवाइस",
  "Learn and practice web3": "वेब3 सीखें और अभ्यास करें",
  "Discover our expanding selection of hands-on exercises, tutorials, and online courses for free. The core developers and researchers at Robonomics invite you to enter the world of web3 and gain practical and theoretical skills through quizzes, device simulations, and even real-life setups using Robonomics Parachain (Polkadot), IPFS, and other web3 tools.": "हमारे विस्तारित हाथों-से-हाथ अभ्यास, ट्यूटोरियल्स, और ऑनलाइन कोर्स की मुफ्त चयन की खोज करें। Robonomics के मुख्य डेवलपर्स और शोधकर्ता आपको वेब3 की दुनिया में प्रवेश करने और Robonomics Parachain (Polkadot), IPFS, और अन्य वेब3 उपकरणों का उपयोग करके प्रायोगिक और सिद्धांतिक कौशल प्राप्त करने के लिए आमंत्रित करते हैं।",
  "No courses were found with such filters.": "इस तरह के फ़िल्टर के साथ कोई कोर्स नहीं मिला।",
  "Try again": "फिर से कोशिश करें",
  "Introduction to the ideas of Robonomics": "Robonomics के विचारों का परिचय",
  "Broadcasting Through the Black Mirror": "काले दर्पण के माध्यम से प्रसारण",
  "At the Intersection of Cybernetics and Economics": "साइबरनेटिक्स और अर्थशास्त्र के संगम पर",
  "Polkadot Ecosystem for Home IoT Infrastructure": "होम आईओटी इंफ्रास्ट्रक्चर के लिए पॉलकाडॉट इकोसि्टम",
  "IoT Subscriptions Using Robonomics Parachain": "Robonomics Parachain का उपयोग करके आईओटी सब्सक्रिप्शन",
  "Sovereign Smart Home with Robonomics and Home Assistant": "Robonomics और होम असिस्टेंट के साथ सुवेरिन स्मार्ट होम",
  "Raspberry Pi Setup": "रैस्पबेरी पाई सेटअप",
  "MQTT Broker Setup and Home Assistant Init": "MQTT ब्रोकर सेटअप और होम असिस्टेंट इनिट",
  "Gateway Setup: Zigbee2MQTT": "गेटवे सेटअप: Zigbee2MQTT",
  "Gateway Setup: Robonomics SLS Gateway": "गेटवे सेटअप: Robonomics SLS गेटवे",
  "Robonomics IoT Subscription Setup": "Robonomics आईओटी सब्सक्रिप्शन सेटअप",
  "Robonomics Integration Setup": "Robonomics एकीकरण सेटअप",
  "Sensors Connectivity & Decentralized Sensors Network": "सेंसर कनेक्टिविटी और डिसेंट्रलाइज्ड सेंसर नेटवर्क",
  "Sensor Hardware": "सेंसर हार्डवेयर",
  "Setting up and connecting sensors": "सेटअप और सेंसर कनेक्ट करना",
  "Sensors connectivity module": "सेंसर कनेक्टिविटी मॉड्यूल",
  "Sensors connectivity config options": "सेंसर कनेक्टिविटी कॉन्फ़िग विकल्प",
  "Sensor map deployment": "सेंसर मैप डिप्लॉयमेंट",
  "Robonomics sensors measure analytics and archive mode": "Robonomics सेंसर मापन विश्लेषण और संग्रह मोड",
  "Connect Mars Curiosity Rover": "मार्स क्यूरिओसिटी रोवर कनेक्ट करं",
  "Connect ROS-compatible drone": "ROS-संगत ड्रोन कनेक्ट करें",
  "Connect Kuka manipulator": "कुका मैनिपुलेटर कनेक्ट करें",
  "Connect unmanned aerial vehicle": "निर्माणहीन वायुयान कनेक्ट करें",
  "Control Baxter robot": "बैक्स्टर रोबोट को नियंत्रित करें",
  "ROS-based projects for smart spaces": "स्मार्ट स्पेस के लिए ROS आधारित परियोजनाएँ",
  "Operate Boston Dynamics Spot": "बॉस्टन डायनामिक्स स्पॉट का ऑपरेट करें",
  "Quickstart Your Bachelor's Thesis with AI-powered Tools": "एआई-पावर्ड टूल्स के साथ अपने बैचलर थीसिस की त्वरित शुरुआत",
  "Introduction": "परिचय",
  "Literature Review": "साहित्य समीक्षा",
  "Methods": "तरीके",
  "Results": "परिणाम",
  "Conclusion": "निष्कर्ष",
  "OpenGov for managing the IoT infrastructure": "आईओटी इंफ्रास्ट्रक्चर का प्रबंधन के लिए ओपनगव",
  "The Shadow of AdCorp's Intrusion": "एडकॉर्प के अतिक्रमण की छाया",
  "Introduction to open source solution for private smart homes": "निजी स्मार्ट होम के लिए ओपन सोर्स समाधान का परिचय",
  "New Home, New Habits": "नया घर, नई आदतें",
  "Assembling Smart Home Board": "स्मार्ट होम बोर्ड को एकत्र करना",
  "Unleash Automation Potential": "ऑटोमेशन की संभवनाओं को उजागर करें",
  "Escape from Black Mirror": "काले दर्पण से बचना",
  "The story of a girl named Trinity": "एक लड़की नामक ट्रिनिटी की कहानी",
  "Fake Housewife & AI research Smart Home Solution": "फेक हाउसवाइफ और एआई रिसर्च स्मार्ट होम समाधान",
  "Meet Fake Housewife Zoe and her story": "फेक हाउसवाइफ जोए और उसकी कहानी से मिलें",
  "Risks of standard Smart Home solutions and the Home Assistant": "मानक स्मार्ट होम समाधानों और होम असिस्टेंट के खतरे",
  "Blockchain-based Smart home solutions": "ब्लॉकचेन-आधारित स्मार्ट होम समाधान",
  "Home Assistant + blockchain+Web3": "होम असिस्टेंट + ब्लॉकचेन+वेब3",
  "Studying the Sovereign smart home course at the academy and WIKI instructions": "एकेडमी में सुवेरिन स्मार्ट होम कोर्स का अध्ययन करना और विकि निर्देश",
  "Fake Housewife & AI is researching devices to install": "फेक हाउसवाइफ और एआई उस्ताद डिवाइस को इंस्टॉल करने की रिसर्च कर रहे हैं",
  "Fake Housewife & AI is installing a Smart Home Robonomics": "फेक हाउसवाइफ और एआई एक स्मार्ट होम Robonomics को इंस्टॉल कर रहे हैं",
  "AI scenario of the Relax zone for the Fake Housewife": "फेक हाउसवाइफ के लिए रिलैक्स जोन की एआई सीनारियो",
  "Software Developing for Boston Dynamics Spot": "बॉस्टन डायनामिक्स स्पॉट के लिए सॉफ़्टवेयर डेवलपिंग",
  "Emergency Stop, Initialization, Body Position Control": "आपातकालीन रोक, प्रारंभीकरण, बॉडी पोजीशन नियंत्रण",
  "Getting Used to Feecc": "फीस का उपयोग करना",
  "Architecture": "वास्तुकला",
  "Overview": "अवलोकन",
  "Demo of Feecc": "फीस का डेमो",
  "Deployment of Engineer Workbench": "इंजीनियर वर्कबेंच का डिप्लॉयमेंट",
  "Deployment of Analytics": "एनालिटिक्स का डिप्लॉयमेंट",
  "World computer in your home": "आपके घर में विश्व कंप्यूटर",
  "Part 1: The Idea of a World Computer": "भाग 1: एक विश्व कंप्यूटर की विचारधारा",
  "Part 2: The Heart of the World Computer": "भाग 2: विश्व कंप्यूटर का ह्रदय",
  "Part 3: Emergence of the World Computer": "भाग 3: विश्व कंप्यूटर का उदय",
  "Part 4: The Path of a New Block of Information in the World Computer": "भाग 4: विश्व कंप्यूटर में नई जानकारी के ब्लॉक का मार्ग",
  "Ivan Berman": "इवान बर्मान",
  "Leemo": "लीमो",
  "Vadim Manaenko": "वदीम मानाएंको",
  "Sergei Lonshakov": "सर्गी लोन्शाकोव",
  "Anna Wimmer-Savinova": "अन्ना विम्मर-साविनोवा",
  "Pavel Tarasov": "पावेल तारासोव",
  "Alexander Smekhnov": "अलेक्जेंडर स्मेखनोव",
  "Privacy Policy": "गोपनीता नीति",
  "This Policy describes the information we collect from you, how we use that information and our legal basis for doing so. It also covers whether and how that information may be shared and your rights and choices regarding the information you provide to us.": "यह नीति वर्णित करती है कि हम आपसे कैसी जानकारी एकत्र करते हैं, हम उस जानकारी का कैसे उपयोग करते हैं और हमारा कानूनी कारण क्या है। यह भी यह शामिल करता है कि क्या और कैसे वह जानकारी साझा की जा सकती है और आपके द्वारा हमें प्रदान की गई जानकारी के संबंध में आपके अधिकार और विकल्प।",
  "Where are those annoying cookie consent pop-ups?": "वे उतावले कुकी सहमति पॉप-अप कहां हैं?",
  "We don't need cookie consent is needed because:": "हमें कुकी सहमति की आवश्यकता नहीं है क्योंकि:",
  "Tracking cookies are not used": "ट्रैकिंग कुकीज़ का उपयोग नहीं होता है",
  "The data is not used for any other purpose than analytics": "डेटा केवल विश्लेषण के लिए उपयोग किया जाता है",
  "Visitors aren’t tracked across websites": "आगंतुकों को वेबसाइटों के बीच ट्रैक नहीं किया जाता है",
  "A user cannot be tracked across days within the same website": "एक उपयोगकर्त को एक ही वेबसाइट के भीतर दिनों के बीच ट्रैक नहीं किया जा सकता है",
  "What We Collect and Receive": "हम क्या एकत्रित और प्राप्त करते हैं",
  "In order for us to provide you the best possible experience on our websites, we need to collect and process certain information. Depending on your use of the Services, that may include:": "हमें आपको हमारी वेबसाइटों पर सर्वोत्तम संभावित अनुभव प्रदान करने के लिए कुछ जानकारी एकत्र करने और प्रसंस्करण करने की आवश्यकता है। सेवाओं का उपयोग करने के आपके आधार पर, वह शामिल हो सकता है:",
  "Contact us via email": "हमसे मेल के माध्यम से संपर्क करें",
  "for example, when you submit our forms, send us questions or comments, or report a problem, we will collect your name, email address, message, etc. We use this data solely in connection with answering the queries we receive.": "उदाहरण के लिए, जब आप हमारे फॉर्म सबमिट करते हैं, हमें सवाल या टिप्पणियाँ भेजते हैं, या किसी समस्या की रिपोर्ट करते हैं, हम आपका नाम, ईमेल पता, संदेश आदि जुटाएंगे। हम इस डेटा का केवल उत्तर देने के संदर्भ में उपयोग करते हैं जो हमें मिलते हैं।",
  "Usage data": "उपयोग डेटा",
  "when you visit our website, we will store: the URL from which you visited us from, web pages of our website you visit, the date and duration of your visit, your anonymized IP address, the device specifications (device type, operating system, screen resolution, language, country you are located in, and web browser type) you used during your visit, and": "जब आप हमारी वेबसाइट पर जाते हैं, हम स्टोर करेंगे: उस URL को जिससे आप हमें आए हैं, हमारी वेबसाइट की वेब पेज जो आप देखते हैं, आपके दौरे की तारीख और अवधि, आपका अनामित आईपी पता, डिवाइस की विशेषताएं (डिवाइस प्रकार, ऑपरेटिंग सिस्टम, स्क्रीन रिज़ॉल्यूशन, भाा, देश जिसमें आप स्थित हैं, और वेब ब्राउज़र प्रकार) जो आपके दौरे के दौरान उपयोग किया गया, और",
  "other": "अन्य",
  "non-personal data. We process this usage data only on our server, not passing it to third-parties with": "गैर-व्यक्तिगत डेटा। हम इस उपयोग डेटा को केवल हमारे सर्वर पर प्रोसेस करते हैं, इसे तीसरे पक्षों को नहीं पास करते हैं।",
  "Matomo": "Matomo",
  "web analytics platform that gives us 100% data ownership. This analytics helps us to improve user experience with our website and to recognize and stop any misuse.": "वेब विश्लेषण प्लेटफॉर्म जो हमें 100% डेटा स्वामित्व देता है। यह विश्लेषण हमें हमारी वेबसाइट के साथ उपयोगकर्ता अनुभव को सुधारने में मदद करता है और किसी भी दुरुपयोग को पहचानने और रोकने में मदद करता है।",
  "Non-personalized cookies": "गैर-व्यक्तिगत कुकीज़",
  "we use non-tracking cookies (small data files transferred onto computers or devices by sites) for record-keeping purposes and to enhance functionality on our website. You may deactivate or restrict the transmission of these cookies by changing the settings of your web browser or by opt-out on this page in the form below. Cookies that are already stored may be deleted at any time.": "हम रिकॉर्ड-रखने के उद्देश्य से गैर-ट्रैकिंग कुकीज़ (साइटों द्वारा कंप्यूटर या िवाइस पर स्थानांतरित छोटे डेटा फ़ाइलें) का उपयोग करते हैं और हमारी वेबसाइट पर कार्यक्षमता को बढ़ाने के लिए। आप इन कुकीज़ के प्रसारण को निष्क्रिय कर सकते हैं या प्रतिबंधित कर सकते हैं अपने वेब ब्राउज़र की सेटिंग्स बदलकर या इस पृष्ठ पर नीचे दिए गए फ़ॉर्म में ऑप्ट-आउट करके। पहले से स्टोर की गई कुकीज़ किसी भी समय हटा दी जा सकती हैं।",
  "Opt-out of website tracking": "वेबसइट ट्रैकिंग से ऑप्ट-आउट करें",
  "You can opt out of being tracked by our Matomo Analytics instance below:": "आप नीचे हमारे Matomo Analytics उदाहरण के द्वारा ट्रैक किए जाने से ऑप्ट आउट कर सकते हैं:",
  "Your Rights": "आपका अधिकार",
  "You have the right to be informed of Personal Data processed by Matomo, a right to rectification/correction, erasure and restriction of processing. You also have the right to ask from us a structured, common and machine-readable format of Personal Data you provided to us.": "आपको Matomo द्वारा प्रसंस्कृत किए जाने वाले व्यक्तिगत डेटा की सूचना प्राप्त करने का अधिकार है, सुधार/सहीकरण, मिटाने और प्रसंस्करण की प्रतिबंधिता का अधिकार है। आपके पास हमसे उपलब्ध किए गए व्यक्तिगत डेटा का एक संरचित, सामान्य और मशीन-पठनीय प्रारूप मांगने का अधिकार भी है।",
  "We can only identify you via your email address and we can only adhere to your request and provide information if we have Personal Data about you through you having made contact with us directly and/or you using our site and/or service. We cannot provide, rectify or delete any data that we store on behalf of our users or customers.": "हम आपको केवल आपके ईमेल पते के माध्यम से पहचान सकते हैं और हम आपकी अनुरोध का पालन कर सकते हैं और सूचना प्रदान कर सकते हैं अगर हमारे पास आके बारे में व्यक्तिगत डेटा है जिसे आपने सीधे हमसे संपर्क करके या हमारी साइट और/या सेवा का उपयोग करके प्राप्त किया है। हम हमारे उपयोगकर्ताओं या ग्राहकों के लिए संभालते हुए किसी भी डेटा को प्रदान, सुधार या मिटा नहीं सकते।",
  "To exercise any of the rights mentioned in this Privacy Policy and/or in the event of questions or comments relating to the use of Personal Data you may contact us.": "इस गोपनीयता नीति में उल्लिखित किसी भी अधिकार का प्रयोग करने के लिए या व्यक्तिगत डेटा के उपयोग से संबंधित सवाल या टिप्पणियों के मामले में हमसे संपर्क कर सकते हैं।",
  "In addition, you have the right to lodge a complaint with the data protection authority in your jurisdiction.": "इसके अतिरिक्त, आपको अपने क्षेत्र में डेटा संरक्षण प्राधिकरण के पास शिकायत दर्ज करने का अधिकार है।",
  "Retention of data": "डेटा की रखरखाव",
  "We will retain your information as long as necessary to provide you with the services or as otherwise set forth in this Policy. We will also retain and use this information as necessary for the purposes set out in this Policy and to the extent necessary to comply with our legal obligations, resolve disputes, enforce our agreements and protect Robonomics Academy legal rights.": "हम आपकी जानकारी को उस मय तक रखेंगे जब तक हम आपको सेवाएं प्रदान करने के लिए आवश्यक हो या इस नीति में अन्यथा निर्धारित किया गया हो। हम इस जानकारी को भी रखेंगे और उसे इस नीति में निर्धारित उद्देश्यों के लिए और हमारी कानूनी अभिबाधानों का पालन करने के लिए, विवादों को सुलझाने के लिए, हमारे समझौतों को प्रवर्तित करने के लिए और Robonomics Academy के कानूनी अधिकारों की सुरक्षा के लिए आवश्यक होने पर इस जानकारी को भी रखेंगे और उपयोग करेंगे।",
  "We also collect and maintain aggregated, anonymized or pseudonymized information which we may retain indefinitely to protect the safety and security of our Site, improve our Services or comply with legal obligations.": "हम संग्रहित, अनामित या प्सडोनिमाइज्ड जानकारी भी जमा करते हैं जिसे हम सुरक्षा और सुरक्षा की रक्षा के लिए अंतर्निहित रख सकते हैं, हमारी साइट की सुरक्षा और सुरक्षा को बेहतर बनाने के लिए हमारी सेवाओं को सुधारने के लिए या कानूनी अभिबाधानों का पालन करने के लिए अंतर्निहित रख सकते हैं।",
  "Filter": "फ़िल्टर",
  "Complexity:": "जटिलता:",
  "Tags:": "टैग:",
  "Authors:": "लेखक:",
  "Apply": "लागू करें",
  "Clear all": "सभी को साफ करें",
  "Spring school 2023": "स्प्रिंग स्कूल 2023",
  "ROS": "ROS",
  "Raspberry Pi": "रस्पबेरी पाई",
  "ai": "एआई",
  "Spot": "स्पॉट",
  "Multi-Agent Systems": "मल्टी-एजेंट सिस्टम्स",
  "Industrial": "औद्योगिक",
  "World computer": "वर्ल्ड कंप्यूटर",
  "Robonomics website": "रोबोनॉमिक्स वेबसाइट",
  "Tell us more": "हमें अधिक बताएं",
  "Send": "भेजें",
  "Sending your info...": "आपकी जानकारी भेजी जा रही है...",
  "Thanks": "धन्यवाद",
  "we’ll keep in touch": "हम संपर्क में रहेंगे",
  "Note: you need to pass all lessons from course with one Polkadot.js account to apply for certificate": "नोट: प्रमाणपत्र के लिए आवेदन करने के लिए आपको कोर्स से सभी सबक पास करने की आवश्यकता है एक पॉल्काडॉट.जेएस खाता",
  "Previous Lesson": "पिछला सबक",
  "Previous Page": "पिछला पेज",
  "Next Lesson": "अगला सबक",
  "Next Page": "अगला पेज",
  "You are currently opted out. Click here to opt in": "आप वर्तमान में विकल्पित नहीं हैं। यहाँ क्लिक करें और विकल्पित करें",
  "You may choose not to have a unique web analytics cookie identification number assigned to your computer to avoid the aggregation and analysis of data collected on this website.": "आप अपने कंप्यूटर को एक अद्वितीय ेब विश्लेषिकी कुकी पहचान संख्या निर्धारित करने के लिए चुन सकते हैं ताकि इस वेबसाइट पर एकत्रित और विश्लेषित किए गए डेटा से बच सकें।",
  "To make that choice, please click below to receive an opt-out cookie": "उस विकल्प को चुनने के लिए, कृपया नीचे क्लिक करें और एक विकल्पित कुकी प्राप्त करें",
  "You are currently opted out. Click here to opt in.": "आप वर्तमान में विकल्पित नहीं हैं। यहाँ क्लिक करें और विकल्पित करें।",
  "Opt-out complete; your visits to this website will not be recorded by the Web Analytics tool. Note that if you clear your cookies, delete the opt-out cookie, or if you change computers or Web browsers, you will need to perform the opt-out procedure again.": "विकल्पित होने का पूरा हो गया है; वेब विश्लेषिकी उपकरण द्वारा आपकी इस वेबसाइट पर यात्राएँ नहीं दर्ज की जाएंगी। ध्यान दें कि यदि आप अपने कुकी हटा देते हैं, विकल्पित कुकी को हटा देते हैं, या यदि आप कंप्यूटर या वेब ब्राउज़र बदलते हैं, तो आपको फर से विकल्पित प्रक्रिया करनी होगी।",
  "Please click below to opt in:": "विकल्पित होने के लिए कृपया नीचे क्लिक करें:",
  "You are currently opted in. Click here to opt out.": "आप वर्तमान में विकल्पित हैं। यहाँ क्लिक करें और विकल्पित करें।",
  "Latest update": "नवीनतम अपडेट",
  "on (date of commit)": "पर (कमिट की तारीख)",
  "by (author of commit)": "द्वारा (कमिट के लेखक)",
  "Completed the Course?": "कोर्स पूरा किया?",
  "You can apply for a certificate of completion, after which you will be able to:": "पूर्णता प्रमाणपत्र के लिए आवेदन कर सकते हैं, जिसके बाद आप कर सकेंगे:",
  "add certificate to your LinkedIn profile": "प्रमाणपत्र को अपने LinkedIn प्रोफ़ाइल में जोड़ें",
  "apply for": "के लिए आवेदन करें",
  "Robonomics Ambassador Program": "रोबोनॉमिक्स एम्बेसडर प्रोग्राम",
  "print the certificate and hang it on the wall.": "प्रमणपत्र प्रिंट करें और दीवार पर लगाएं।",
  "Apply for Certificate": "प्रमाणपत्र प्रिंट करें और दीवार पर लगाएं।",
  "Ask question on GitHub": "GitHub पर सवाल पूछें",
  "Get Notifications & Updates": "सूचनाएँ और पडेट प्राप्त करें",
  "Your email": "आपका ईमेल",
  "Submit": "प्रस्तुत करें",
  "Sending your request": "आपका अनुरोध भेजा जा रहा है",
  "You are in the list": "आप सूची में हैं",
  "By submitting this form you agree to receive emails with notifications and updates from the Robonomics Network team": "इस फॉर्म को सबमिट करके आप सहमत होते हैं कि आपको रोबोनॉमिक्स नेटवर्क टीम से सूचनाएँ और अपडेट वाले ईमेल प्राप्त करने की अनुमति है",
  "course": "कोर्स",
  "guide": "गाइड",
  "launch simulation": "सिमुलेशन लॉन्च करें",
  "real-life setup": "वास्तविक जीवन सेटअप",
  "You've come to the wrong classroom": "आप गलत कक्षा में आ गए हैं",
  "Return to main campus": "मुख्य कैंपस पर वापस जाएं",
  "This page has moved to a": "यह पृष्ठ एक",
  "Automatic redirecting": "स्वचालित पुनर्निर्देशन",
  "Robonomics School 2024 / IoT is More Dangerous Than AI": "रोबोनॉमिक्स स्कूल 2024 / आईओटी एआई से अधिक खतरनाक है।",
  "Robonomics School 2024 / Privacy Insights for Smart Homes": "रोबोॉमिक्स स्कूल 2024 / स्मार्ट होम्स के लिए गोपनीयता इंसाइट्स",
  "Robonomics School 2024 / Cyprus Relocant Manual: Smart Home": "रोबोनॉमिक्स स्कूल 2024 / साइप्रस रिलोकेंट मैनुअल: स्मार्ट होम"
}