{
  "404": "404",
  "Welcome to Our Online School!": "Benvenuti nella nostra scuola online!",
  "What is Robonomics?": "Cos'è Robonomics?",
  "User Dapp": "Utente (D)app",
  "Function Request": "Richiesta di funzione",
  "Report": "Rapporto",
  "Digital Twin": "Digital twin",
  "Control": "Controllo",
  "Log": "Log",
  "IoT Device": "Dispositivo IoT",
  "Complexity:": "Complessità:",
  "Tags:": "Tag:",
  "Authors:": "Autori:",
  "Apply": "Applica",
  "Clear all": "Cancella tutto",
  "Spring school 2023": "Scuola primaverile 2023",
  "ROS": "ROS",
  "Raspberry Pi": "Raspberry Pi",
  "ai": "ai",
  "Spot": "Spot",
  "Multi-Agent Systems": "Sistemi Multi-Agenti",
  "Industrial": "Industriale",
  "World computer": "Computer mondiale",
  "Privacy Policy": "Informativa sulla privacy",
  "Learn": "Impara",
  "Robonomics website": "Sito web di Robonomics",
  "Tell us more": "Raccontaci di più",
  "Send": "Invia",
  "Sending your info...": "Invio delle tue informazioni...",
  "Thanks": "Grazie",
  "we’ll keep in touch": "rimarremo in contatto",
  "Results": "Risultati",
  "Previous Lesson": "Lezione precedente",
  "Previous Page": "Pagina precedente",
  "Next Lesson": "Lezione successiva",
  "Next Page": "Pagina successiva",
  "You are currently opted out. Click here to opt in": "Attualmente sei escluso. Clicca qui per optare in",
  "You may choose not to have a unique web analytics cookie identification number assigned to your computer to avoid the aggregation and analysis of data collected on this website.": "Puoi scegliere di non avere un numero di identificazione cookie di analisi web univoco assegnato al tuo computer per evitare l'aggregazione e l'analisi dei dati raccolti su questo sito web.",
  "To make that choice, please click below to receive an opt-out cookie": "Per fare questa scelta, fai clic di seguito per ricevere un cookie di opt-out",
  "You are currently opted out. Click here to opt in.": "Attualmente sei escluso. Clicca qui per optare in.",
  "Opt-out complete; your visits to this website will not be recorded by the Web Analytics tool. Note that if you clear your cookies, delete the opt-out cookie, or if you change computers or Web browsers, you will need to perform the opt-out procedure again.": "Opt-out completato; le tue visite a questo sito web non verranno registrate dallo strumento di analisi web. Nota che se cancelli i tuoi cookie, elimini il cookie di opt-out o se cambi computer o browser Web, dovrai eseguire nuovamente la procedura di opt-out.",
  "Please click below to opt in:": "Fai clic di seguito per optare in:",
  "You are currently opted in. Click here to opt out.": "Attualmente sei optato in. Clicca qui per optare out.",
  "Latest update": "Ultimo aggiornamento",
  "on (date of commit)": "il (data del commit)",
  "by (author of commit)": "da (autore del commit)",
  "Completed the Course?": "Hai completato il corso?",
  "You can apply for a certificate of completion, after which you will be able to:": "Puoi richiedere un certificato di completamento, dopo di che sarai in grado di:",
  "add certificate to your LinkedIn profile": "aggiungere il certificato al tuo profilo LinkedIn",
  "apply for": "richiedere",
  "Robonomics Ambassador Program": "Programma Ambasciatore Robonomics",
  "print the certificate and hang it on the wall.": "stampare il certificato e appenderlo al muro.",
  "Apply for Certificate": "Richiedi il certificato",
  "Ask question on GitHub": "Fai una domanda su GitHub",
  "Get Notifications & Updates": "Ricevi notifiche e aggiornamenti",
  "You've come to the wrong classroom": "Sei arrivato nella classe sbagliata",
  "Return to main campus": "Torna al campus principale",
  "The core developers of the Robonomics project, robotics specialists and PhD research scientists offer to pass through compendious experience based on 7 years of work with web 3.0 projects.": "Gli sviluppatori principali del progetto Robonomics, specialisti in robotica e scienziati ricercatori PhD offrono di passare attraverso un'esperienza compendiata basata su 7 anni di lavoro con progetti web 3.0.",
  "What can you discover for yourself in the academy?": "Cosa puoi scoprire tu stesso nell'accademia?",
  "Web3 Advanced Applications": "Applicazioni avanzate Web3",
  "Find out how cutting-edge web3 technologies can be integrated into personal, city, or corporate settings on examples with practical uses in real-life scenarios.": "Scopri come le tecnologie web3 all'avanguardia possono essere integrate in contesti personali, cittadini o aziendali su esempi con utilizzi pratici in scenari di vita reale.",
  "Focus on decentralized IoT strategies that provide greater safety and flexibility compared to their centralized counterparts.": "Concentrati sulle strategie IoT decentralizzate che offrono maggiore sicurezza e flessibilità rispetto ai loro omologhi centralizzati.",
  "Study new robotics frameworks and SDKs and apply them to your projects.": "Studia nuovi framework e SDK di robotica e applicali ai tuoi progetti.",
  "Peep insights how Norbert Wiener's principles of cybernetics are applied to modern autonomous systems.": "Scopri come i principi di cibernetica di Norbert Wiener vengono applicati ai moderni sistemi autonomi.",
  "Discover new mechanisms of techno-economic communication between machines and humans.": "Scopri nuovi meccanismi di comunicazione tecno-economica tra macchine e esseri umani.",
  "Learn how to work with single board computers, sensors, smart devices and complex robots.": "Impara a lavorare con computer a scheda singola, sensori, dispositivi intelligenti e robot complessi.",
  "Robonomics is a secure, serverless and futuristic IoT platform that connects users and smart devices. It enables the exchange of technical and economic information in the form of atomic transactions between user applications, IoT services, and complex robotics.": "Robonomics è una piattaforma IoT sicura, senza server e futuristica che collega gli utenti e i dispositivi intelligenti. Consente lo scambio di informazioni tecniche ed economiche sotto forma di transazioni atomiche tra applicazioni utente, servizi IoT e robot complessi.",
  "Learn more on Robonomics website": "Scopri di più sul sito web di Robonomics",
  "Learn and practice web3": "Impara e pratica web3",
  "Discover our expanding selection of hands-on exercises, tutorials, and online courses for free. The core developers and researchers at Robonomics invite you to enter the world of web3 and gain practical and theoretical skills through quizzes, device simulations, and even real-life setups using Robonomics Parachain (Polkadot), IPFS, and other web3 tools.": "Scopri la nostra crescente selezione di esercizi pratici, tutorial e corsi online gratuiti. Gli sviluppatori principali e i ricercatori di Robonomics ti invitano a entrare nel mondo del web3 e acquisire competenze pratiche e teoriche attraverso quiz, simulazioni di dispositivi e persino configurazioni reali utilizzando Robonomics Parachain (Polkadot), IPFS e altri strumenti web3.",
  "No courses were found with such filters.": "Nessun corso è stato trovato con tali filtri.",
  "Try again": "Riprova",
  "This Policy describes the information we collect from you, how we use that information and our legal basis for doing so. It also covers whether and how that information may be shared and your rights and choices regarding the information you provide to us.": "Questa politica descrive le informazioni che raccogliamo da te, come utilizziamo tali informazioni e la nostra base legale per farlo. Copre anche se e come tali informazioni possono essere condivise e i tuoi diritti e scelte riguardo alle informazioni che ci fornisci.",
  "Where are those annoying cookie consent pop-ups?": "Dove sono quei fastidiosi pop-up di consenso sui cookie?",
  "We don't need cookie consent is needed because:": "Non è necessario il consenso sui cookie perché:",
  "Tracking cookies are not used": "I cookie di tracciamento non vengono utilizzati",
  "The data is not used for any other purpose than analytics": "I dati non vengono utilizzati per scopi diversi dall'analisi",
  "Visitors aren’t tracked across websites": "I visitatori non vengono tracciati tra i siti web",
  "A user cannot be tracked across days within the same website": "Un utente non può essere tracciato tra i giorni all'interno dello stesso sito web",
  "What We Collect and Receive": "Cosa raccogliamo e riceviamo",
  "In order for us to provide you the best possible experience on our websites, we need to collect and process certain information. Depending on your use of the Services, that may include:": "Per poterti offrire la migliore esperienza possibile sui nostri siti web, dobbiamo raccogliere e elaborare determinate informazioni. A seconda del tuo utilizzo dei Servizi, ciò potrebbe includere:",
  "Contact us via email": "Contattaci via email",
  "for example, when you submit our forms, send us questions or comments, or report a problem, we will collect your name, email address, message, etc. We use this data solely in connection with answering the queries we receive.": "ad esempio, quando invii i nostri moduli, ci invii domande o commenti o segnali un problema, raccoglieremo il tuo nome, indirizzo email, messaggio, ecc. Utilizziamo questi dati esclusivamente in relazione alla risposta alle query che riceviamo.",
  "Usage data": "Dati di utilizzo",
  "other": "altro",
  "non-personal data. We process this usage data only on our server, not passing it to third-parties with": "dati non personali. Elaboriamo questi dati di utilizzo solo sul nostro server, non passandoli a terzi con",
  "Matomo": "Matomo",
  "web analytics platform that gives us 100% data ownership. This analytics helps us to improve user experience with our website and to recognize and stop any misuse.": "piattaforma di analisi web che ci dà il 100% di proprietà dei dati. Questa analisi ci aiuta a migliorare l'esperienza dell'utente con il nostro sito web e a riconoscere e fermare qualsiasi abuso.",
  "Non-personalized cookies": "Cookie non personalizzati",
  "we use non-tracking cookies (small data files transferred onto computers or devices by sites) for record-keeping purposes and to enhance functionality on our website. You may deactivate or restrict the transmission of these cookies by changing the settings of your web browser or by opt-out on this page in the form below. Cookies that are already stored may be deleted at any time.": "Utilizziamo cookie non traccianti (piccoli file di dati trasferiti su computer o dispositivi dai siti) per scopi di registrazione e per migliorare la funzionalità sul nostro sito web. È possibile disattivare o limitare la trasmissione di questi cookie modificando le impostazioni del proprio browser web o optando per l'esclusione in questa pagina nel modulo sottostante. I cookie già memorizzati possono essere eliminati in qualsiasi momento.",
  "Opt-out of website tracking": "Opt-out del tracciamento del sito web",
  "You can opt out of being tracked by our Matomo Analytics instance below:": "È possibile optare per non essere tracciati dalla nostra istanza di Matomo Analytics di seguito:",
  "Your Rights": "I tuoi diritti",
  "You have the right to be informed of Personal Data processed by Matomo, a right to rectification/correction, erasure and restriction of processing. You also have the right to ask from us a structured, common and machine-readable format of Personal Data you provided to us.": "Hai il diritto di essere informato sui Dati Personali elaborati da Matomo, il diritto di rettifica/correzione, cancellazione e limitazione del trattamento. Hai anche il diritto di richiedere da noi un formato strutturato, comune e leggibile da macchina dei Dati Personali che ci hai fornito.",
  "We can only identify you via your email address and we can only adhere to your request and provide information if we have Personal Data about you through you having made contact with us directly and/or you using our site and/or service. We cannot provide, rectify or delete any data that we store on behalf of our users or customers.": "Possiamo identificarti solo tramite il tuo indirizzo email e possiamo aderire alla tua richiesta e fornire informazioni solo se abbiamo Dati Personali su di te attraverso il contatto diretto con noi e/o l'uso del nostro sito e/o servizio. Non possiamo fornire, rettificare o eliminare alcun dato che conserviamo per conto dei nostri utenti o clienti.",
  "To exercise any of the rights mentioned in this Privacy Policy and/or in the event of questions or comments relating to the use of Personal Data you may contact us.": "Per esercitare uno qualsiasi dei diritti menzionati in questa Informativa sulla privacy e/o in caso di domande o commenti relativi all'uso dei Dati Personali, è possibile contattarci.",
  "In addition, you have the right to lodge a complaint with the data protection authority in your jurisdiction.": "Inoltre, hai il diritto di presentare reclamo all'autorità di protezione dei dati del tuo territorio.",
  "Retention of data": "Conservazione dei dati",
  "We will retain your information as long as necessary to provide you with the services or as otherwise set forth in this Policy. We will also retain and use this information as necessary for the purposes set out in this Policy and to the extent necessary to comply with our legal obligations, resolve disputes, enforce our agreements and protect Robonomics Academy legal rights.": "Conserveremo le tue informazioni per il tempo necessario a fornirti i servizi o come altrimenti stabilito in questa Policy. Conserveremo e utilizzeremo anche queste informazioni come necessario per gli scopi stabiliti in questa Policy e nella misura necessaria per adempiere ai nostri obblighi legali, risolvere dispute, far rispettare i nostri accordi e proteggere i diritti legali di Robonomics Academy.",
  "We also collect and maintain aggregated, anonymized or pseudonymized information which we may retain indefinitely to protect the safety and security of our Site, improve our Services or comply with legal obligations.": "Raccogliamo e conserviamo anche informazioni aggregate, anonimizzate o pseudonimizzate che potremmo conservare indefinitamente per proteggere la sicurezza del nostro sito, migliorare i nostri servizi o adempiere agli obblighi legali.",
  "This page has moved to a": "Questa pagina è stata spostata su",
  "Automatic redirecting": "Reindirizzamento automatico",
  "when you visit our website, we will store: the URL from which you visited us from, web pages of our website you visit, the date and duration of your visit, your anonymized IP address, the device specifications (device type, operating system, screen resolution, language, country you are located in, and web browser type) you used during your visit, and": "quando visiti il nostro sito web, memorizzeremo: l'URL da cui ci hai visitato, le pagine web del nostro sito che visiti, la data e la durata della tua visita, il tuo indirizzo IP anonimizzato, le specifiche del dispositivo (tipo di dispositivo, sistema operativo, risoluzione dello schermo, lingua, paese in cui ti trovi e tipo di browser web) che hai utilizzato durante la tua visita, e",
  "Sending your request": "Invio della tua richiesta",
  "You are in the list": "Sei nella lista",
  "By submitting this form you agree to receive emails with notifications and updates from the Robonomics Network team": "Inviando questo modulo accetti di ricevere email con notifiche e aggiornamenti dal team di Robonomics Network",
  "Strategies for IoT Decentralization": "Strategie per la decentralizzazione dell'IoT",
  "Latest Robotics Tools": "Ultimi strumenti di robotica",
  "Modern Cybernetics": "Cibernetica moderna",
  "Economic Processes for Robots": "Processi economici per i robot",
  "Engineering Skills": "Competenze ingegneristiche",
  "Your email": "La tua email",
  "Submit": "Invia",
  "course": "corso",
  "guide": "guida",
  "launch simulation": "simulazione di lancio",
  "real-life setup": "configurazione della vita reale",
  "Introduction to the ideas of Robonomics": "Introduzione alle idee di Robonomics",
  "Broadcasting Through the Black Mirror": "Trasmissione attraverso lo specchio nero",
  "At the Intersection of Cybernetics and Economics": "All'incrocio tra cibernetica ed economia",
  "Polkadot Ecosystem for Home IoT Infrastructure": "Ecosistema Polkadot per l'infrastruttura IoT domestica",
  "IoT Subscriptions Using Robonomics Parachain": "Abbonamenti IoT utilizzando Robonomics Parachain",
  "Sovereign Smart Home with Robonomics and Home Assistant": "Casa intelligente sovrana con Robonomics e Home Assistant",
  "Raspberry Pi Setup": "Configurazione Raspberry Pi",
  "MQTT Broker Setup and Home Assistant Init": "Configurazione del broker MQTT e inizializzazione di Home Assistant",
  "Gateway Setup: Zigbee2MQTT": "Configurazione del gateway: Zigbee2MQTT",
  "Gateway Setup: Robonomics SLS Gateway": "Configurazione del gateway: Robonomics SLS Gateway",
  "Robonomics IoT Subscription Setup": "Configurazione dell'abbonamento IoT di Robonomics",
  "Robonomics Integration Setup": "Configurazione di integrazione di Robonomics",
  "Sensors Connectivity & Decentralized Sensors Network": "Connessione dei sensori e rete decentralizzata di sensori",
  "Sensor Hardware": "Hardware del sensore",
  "Setting up and connecting sensors": "Configurazione e connessione dei sensori",
  "Sensors connectivity module": "Modulo di connettività dei sensori",
  "Sensors connectivity config options": "Opzioni di configurazione della connettività dei sensori",
  "Sensor map deployment": "Implementazione della mappa dei sensori",
  "Robonomics sensors measure analytics and archive mode": "Modalità di misurazione, analisi e archiviazione dei sensori di Robonomics",
  "Connect Mars Curiosity Rover": "Connetti il rover Curiosity di Marte",
  "Connect ROS-compatible drone": "Connetti il drone compatibile con ROS",
  "Connect Kuka manipulator": "Connetti il manipolatore Kuka",
  "Connect unmanned aerial vehicle": "Connetti il veicolo aereo senza pilota",
  "Control Baxter robot": "Controlla il robot Baxter",
  "ROS-based projects for smart spaces": "Progetti basati su ROS per spazi intelligenti",
  "Operate Boston Dynamics Spot": "Operare il Boston Dynamics Spot",
  "Quickstart Your Bachelor's Thesis with AI-powered Tools": "Avvia rapido la tua tesi di laurea con strumenti alimentati da intelligenza artificiale",
  "Introduction": "Introduzione",
  "Literature Review": "Revisione della letteratura",
  "Methods": "Metodi",
  "Conclusion": "Conclusione",
  "OpenGov for managing the IoT infrastructure": "OpenGov per la gestione dell'infrastruttura IoT",
  "The Shadow of AdCorp's Intrusion": "L'ombra dell'intrusione di AdCorp",
  "Introduction to open source solution for private smart homes": "Introduzione alla soluzione open source per le case intelligenti private",
  "New Home, New Habits": "Nuova casa, nuove abitudini",
  "Assembling Smart Home Board": "Assemblaggio della scheda Smart Home",
  "Unleash Automation Potential": "Sfrutta il potenziale dell'automazione",
  "Escape from Black Mirror": "Fuga dallo specchio nero",
  "The story of a girl named Trinity": "La storia di una ragazza di nome Trinity",
  "Fake Housewife & AI research Smart Home Solution": "Casalinga finta e soluzione Smart Home di ricerca AI",
  "Meet Fake Housewife Zoe and her story": "Incontra la casalinga finta Zoe e la sua storia",
  "Risks of standard Smart Home solutions and the Home Assistant": "Rischi delle soluzioni standard per le case intelligenti e l'Home Assistant",
  "Blockchain-based Smart home solutions": "Soluzioni per case intelligenti basate su blockchain",
  "Home Assistant + blockchain+Web3": "Home Assistant + blockchain+Web3",
  "Studying the Sovereign smart home course at the academy and WIKI instructions": "Studiare il corso di casa intelligente sovrana presso l'accademia e le istruzioni WIKI",
  "Fake Housewife & AI is researching devices to install": "La casalinga finta e l'IA stanno cercando dispositivi da installare",
  "Fake Housewife & AI is installing a Smart Home Robonomics": "La casalinga finta e l'IA stanno installando un Smart Home Robonomics",
  "AI scenario of the Relax zone for the Fake Housewife": "Scenario AI della zona Relax per la casalinga finta",
  "Software Developing for Boston Dynamics Spot": "Sviluppo software per il Boston Dynamics Spot",
  "Emergency Stop, Initialization, Body Position Control": "Stop di emergenza, inizializzazione, controllo della posizione del corpo",
  "Getting Used to Feecc": "Abituarsi a Feecc",
  "Architecture": "Architettura",
  "Overview": "Panoramica",
  "Demo of Feecc": "Demo di Feecc",
  "Deployment of Engineer Workbench": "Implementazione della postazione di lavoro dell'ingegnere",
  "Deployment of Analytics": "Implementazione dell'analisi",
  "World computer in your home": "Computer mondiale nella tua casa",
  "Part 1: The Idea of a World Computer": "Parte 1: L'idea di un computer mondiale",
  "Part 2: The Heart of the World Computer": "Parte 2: Il cuore del computer mondiale",
  "Part 3: Emergence of the World Computer": "Parte 3: Emergenza del computer mondiale",
  "Part 4: The Path of a New Block of Information in the World Computer": "Parte 4: Il percorso di un nuovo blocco di informazioni nel computer mondiale",
  "Ivan Berman": "Ivan Berman",
  "Leemo": "Leemo",
  "Vadim Manaenko": "Vadim Manaenko",
  "Sergei Lonshakov": "Sergei Lonshakov",
  "Anna Wimmer-Savinova": "Anna Wimmer-Savinova",
  "Pavel Tarasov": "Pavel Tarasov",
  "Alexander Smekhnov": "Alexander Smekhnov",
  "Filter": "Filtro"
}