{
  "404": "404",
  "Complexity:": "複雑さ：",
  "Tags:": "タグ：",
  "Authors:": "著者：",
  "Apply": "適用",
  "Clear all": "すべてクリア",
  "Spring school 2023": "2023年春学校",
  "ROS": "ROS",
  "Raspberry Pi": "Raspberry Pi",
  "ai": "ai",
  "Spot": "スポット",
  "Multi-Agent Systems": "マルチエージェントシステム",
  "Industrial": "産業",
  "World computer": "ワールドコンピュータ",
  "Privacy Policy": "プライバシーポリシー",
  "Learn": "学ぶ",
  "Robonomics website": "Robonomicsウェブサイト",
  "Tell us more": "もっと教えてください",
  "Send": "送信",
  "Sending your info...": "情報を送信中...",
  "Thanks": "ありがとう",
  "we’ll keep in touch": "連絡を取り合います",
  "Results": "結果",
  "Previous Lesson": "前のレッスン",
  "Previous Page": "前のページ",
  "Next Lesson": "次のレッスン",
  "Next Page": "次のページ",
  "You are currently opted out. Click here to opt in": "現在オプトアウト中です。オプトインするにはここをクリックしてください",
  "You may choose not to have a unique web analytics cookie identification number assigned to your computer to avoid the aggregation and analysis of data collected on this website.": "このウェブサイトで収集されたデータの集約と分析を避けるために、コンピュータに一意のウェブ解析クッキー識別番号を割り当てないように選択することができます。",
  "To make that choice, please click below to receive an opt-out cookie": "その選択を行うには、以下をクリックしてオプトアウトクッキーを受け取ってください",
  "You are currently opted out. Click here to opt in.": "現在オプトアウト中です。オプトインするにはここをクリックしてください。",
  "Opt-out complete; your visits to this website will not be recorded by the Web Analytics tool. Note that if you clear your cookies, delete the opt-out cookie, or if you change computers or Web browsers, you will need to perform the opt-out procedure again.": "オプトアウトが完了しました。このウェブサイトへの訪問はWeb Analyticsツールによって記録されません。クッキーをクリアしたり、オプトアウトクッキーを削除したり、コンピュータやWebブラウザを変更した場合は、再度オプトアウト手続きを行う必要があります。",
  "Please click below to opt in:": "オプトインするには、以下をクリックしてください：",
  "You are currently opted in. Click here to opt out.": "現在オプトイン中です。オプトアウトするにはここをクリックしてください。",
  "Latest update": "最新の更新",
  "on (date of commit)": "（コミット日）に",
  "by (author of commit)": "（コミットの著者）によって",
  "Completed the Course?": "コースを完了しましたか？",
  "You can apply for a certificate of completion, after which you will be able to:": "修了証の申請ができます。その後、次のことができます：",
  "add certificate to your LinkedIn profile": "修了証をLinkedInプロフィールに追加",
  "apply for": "申請する",
  "Robonomics Ambassador Program": "Robonomicsアンバサダープログラム",
  "print the certificate and hang it on the wall.": "修了証を印刷して壁に掛ける。",
  "Apply for Certificate": "証明書の申請",
  "Ask question on GitHub": "GitHubで質問する",
  "Get Notifications & Updates": "通知と更新を受け取る",
  "You've come to the wrong classroom": "間違った教室に来ました",
  "Return to main campus": "メインキャンパスに戻る",
  "Welcome to Our Online School!": "オンラインスクールへようこそ！",
  "The core developers of the Robonomics project, robotics specialists and PhD research scientists offer to pass through compendious experience based on 7 years of work with web 3.0 projects.": "Robonomicsプロジェクトの中核開発者、ロボティクス専門家、PhD研究科学者が、Web 3.0プロジェクトとの7年間の作業に基づいた簡潔な経験を通過することを提案します。",
  "What can you discover for yourself in the academy?": "アカデミーで自分自身を発見でるものは何ですか？",
  "Web3 Advanced Applications": "Web3の高度なアプリケーション",
  "Find out how cutting-edge web3 technologies can be integrated into personal, city, or corporate settings on examples with practical uses in real-life scenarios.": "最先端のWeb3テクノロジーが個人、都市、または企業の環境にどのように統合されるかを、実生活のシナリオでの実用例を通じて学びます。",
  "Focus on decentralized IoT strategies that provide greater safety and flexibility compared to their centralized counterparts.": "中央集権化された対応物と比較して、より安全性と柔軟性を提供する分散型IoT戦略に焦点を当てます。",
  "Study new robotics frameworks and SDKs and apply them to your projects.": "新しいロボティクスフレームワークとSDKを学び、プロジェクトに適用します。",
  "Peep insights how Norbert Wiener's principles of cybernetics are applied to modern autonomous systems.": "Norbert Wienerのサイバネティクス原則が現代の自律システムにどのように適用されるかをのぞいてください。",
  "Discover new mechanisms of techno-economic communication between machines and humans.": "機械と人間の間の技術経済コミュニケーションの新しいメカニズムを発見します。",
  "Learn how to work with single board computers, sensors, smart devices and complex robots.": "シングルボードコンピュータ、センサー、スマートデバイス、複雑なロボットとの作業方法を学びます。",
  "What is Robonomics?": "Robonomicsとは何ですか？",
  "Robonomics is a secure, serverless and futuristic IoT platform that connects users and smart devices. It enables the exchange of technical and economic information in the form of atomic transactions between user applications, IoT services, and complex robotics.": "Robonomicsは、ユーザーとスマートデバイスを接続する安全でサーバーレスで未来志向のIoTプラットフォームです。ユーザーアプリケーション、IoTサービス、複雑なロボティクス間で、技術的および経済的情報を原子トランザクションの形式で交換できるようにします。",
  "Learn more on Robonomics website": "Robonomicsウェブサイトで詳細を学ぶ",
  "User Dapp": "ユーザーDapp",
  "Function Request": "機能リクエスト",
  "Report": "レポート",
  "Digital Twin": "デジタルツイン",
  "Control": "コントロール",
  "Log": "ログ",
  "IoT Device": "IoTデバイス",
  "Learn and practice web3": "Web3を学び実践する",
  "Discover our expanding selection of hands-on exercises, tutorials, and online courses for free. The core developers and researchers at Robonomics invite you to enter the world of web3 and gain practical and theoretical skills through quizzes, device simulations, and even real-life setups using Robonomics Parachain (Polkadot), IPFS, and other web3 tools.": "無料の実習、チュートリアル、オンラインコースの拡大する選択肢を発見してください。Robonomicsの中核開発者や研究者は、クイズ、デバイスシミュレーション、Robonomics Parachain（Polkadot）、IPFS、その他のWeb3ツールを使用した実際のセットアップを通じて、Web3の世界に入り、実践的な理論的スキルを獲得するようお誘いします。",
  "No courses were found with such filters.": "そのようなフィルターで見つかるコースはありませんでした。",
  "Try again": "もう一度やり直してください",
  "This Policy describes the information we collect from you, how we use that information and our legal basis for doing so. It also covers whether and how that information may be shared and your rights and choices regarding the information you provide to us.": "このポリシーでは、お客様から収集した情報、その情報の使用方法、およびその情報を使用するための法的根拠について説明します。また、その情報がどのように共有されるか、提供された情報に関するお客様の権利と選択肢についてもカバーしています。",
  "Where are those annoying cookie consent pop-ups?": "うるさいクッキーコンセントポップアップはどこにありますか？",
  "We don't need cookie consent is needed because:": "クッキーコンセントは必要ありません：",
  "Tracking cookies are not used": "トラッキングクッキーは使用されていません",
  "The data is not used for any other purpose than analytics": "データは分析以外の目的で用されていません",
  "Visitors aren’t tracked across websites": "訪問者は他のウェブサイトを追跡されていません",
  "A user cannot be tracked across days within the same website": "ユーザーは同じウェブサイト内で複数の日にわたって追跡されません",
  "What We Collect and Receive": "収集および受信する情報",
  "In order for us to provide you the best possible experience on our websites, we need to collect and process certain information. Depending on your use of the Services, that may include:": "当社のウェブサイトで最高の体験を提供するために、特定の情報を収集および処理する必要があります。サービスの使用に応じて、それには次のものが含まれる場合があります：",
  "Contact us via email": "メールでお問い合わせ",
  "for example, when you submit our forms, send us questions or comments, or report a problem, we will collect your name, email address, message, etc. We use this data solely in connection with answering the queries we receive.": "たとえば、フォームを送信したり、質問やコメントを送信したり、問題を報告したりする場合、お名前、メールアドレス、メッセージなどを収集します。このデータは、受信したクエリに回答するためにのみ使用します。",
  "Usage data": "使用データ",
  "other": "その他",
  "non-personal data. We process this usage data only on our server, not passing it to third-parties with": "非個人データ。この使用データは、サーバー上でのみ処理し、第三者には提供しません。",
  "Matomo": "Matomo",
  "web analytics platform that gives us 100% data ownership. This analytics helps us to improve user experience with our website and to recognize and stop any misuse.": "Web解析プラットフォームは、100％のデータ所有権を提供します。この分析は、当社のウェブサイトのユーザーエクスペリエンスを向上させ、誤用を認識して停止するのに役立ちます。",
  "Non-personalized cookies": "個人情報を識別しないクッキー",
  "we use non-tracking cookies (small data files transferred onto computers or devices by sites) for record-keeping purposes and to enhance functionality on our website. You may deactivate or restrict the transmission of these cookies by changing the settings of your web browser or by opt-out on this page in the form below. Cookies that are already stored may be deleted at any time.": "私たちは、記録目的およびウェブサイトの機能を向上させるために、非トラッキングクッキー（サイトによってコンピュータやデバイスに転送される小さなデータファイル）を使用しています。これらのクッキーの送信を無効にしたり制限したりするには、ウェブブラウザの設定を変更するか、以下のフォームでこのページからオプトアウトしてください。既に保存されているクッキーはいつでも削除できます。",
  "Opt-out of website tracking": "ウェブサイトのトラッキングをオプトアウト",
  "You can opt out of being tracked by our Matomo Analytics instance below:": "以下のMatomo Analyticsインスタンスのトラッキングをオプトアウトすることができます。",
  "Your Rights": "あなたの権利",
  "You have the right to be informed of Personal Data processed by Matomo, a right to rectification/correction, erasure and restriction of processing. You also have the right to ask from us a structured, common and machine-readable format of Personal Data you provided to us.": "Matomoによって処理される個人データについて通知を受ける権利、訂正/修正、消去および処理の制限を求める権利があります。また、当社に提供した個人データの構造化された、一般的で機械可読な形式を要求する権利もあります。",
  "We can only identify you via your email address and we can only adhere to your request and provide information if we have Personal Data about you through you having made contact with us directly and/or you using our site and/or service. We cannot provide, rectify or delete any data that we store on behalf of our users or customers.": "あなたを識別することはメールアドレスを通じてのみ可能であり、直接当社と連絡を取ったり、当社のサイトやサービスを使用したりしたことによて、あなたに関する個人データを持っている場合にのみ、あなたのリクエストに従い情報を提供することができます。当社がユーザーや顧客の代わりに保存しているデータを提供、訂正、削除することはできません。",
  "To exercise any of the rights mentioned in this Privacy Policy and/or in the event of questions or comments relating to the use of Personal Data you may contact us.": "本プライバシーポリシーに記載されている権利のいずれかを行使する場合や個人データの使用に関する質問やコメントがある場合は、お問い合わせください。",
  "In addition, you have the right to lodge a complaint with the data protection authority in your jurisdiction.": "さらに、あなたは所轄のデータ保護当局に苦情を申し立てる権利があります。",
  "Retention of data": "データの保持",
  "We will retain your information as long as necessary to provide you with the services or as otherwise set forth in this Policy. We will also retain and use this information as necessary for the purposes set out in this Policy and to the extent necessary to comply with our legal obligations, resolve disputes, enforce our agreements and protect Robonomics Academy legal rights.": "本ポリシーに従ってサービスを提供するために必要な期間だけ情報を保持します。また、本ポリシーに記載された目的のためにこの情報を保持し使用し、法的義務を遵守し、紛争を解決し、契約を強制し、Robonomics Academyの法的権利を保護するために必要な範囲でこの情報を保持および使用します。",
  "We also collect and maintain aggregated, anonymized or pseudonymized information which we may retain indefinitely to protect the safety and security of our Site, improve our Services or comply with legal obligations.": "また、サイトの安全性とセキュリティを保護し、サービスを改善し、法的義務を遵守するために、集計された匿名化または擬似化された情報を永続的に保持することがあります。",
  "This page has moved to a": "このページは次の場所に移動しました",
  "Automatic redirecting": "自動リダイレクト中",
  "when you visit our website, we will store: the URL from which you visited us from, web pages of our website you visit, the date and duration of your visit, your anonymized IP address, the device specifications (device type, operating system, screen resolution, language, country you are located in, and web browser type) you used during your visit, and": "当社のウェブサイトを訪れる際に、以下の情報を保存します：当社を訪れたURL、当社のウェブサイトのページ、訪問日時と滞在時間、匿名化されたIPアドレス、訪問時に使用したデバイスの仕様（デバイスタイプ、オペレーティングシステム、画面解像度、言語、所在国、およびウェブブラウザタイプ）",
  "Sending your request": "リクエストを送信中です",
  "You are in the list": "リストに登録されました",
  "By submitting this form you agree to receive emails with notifications and updates from the Robonomics Network team": "このフォームを送信することで、Robonomics Networkチームからの通知や更新を含むメールを受け取ることに同意します",
  "Strategies for IoT Decentralization": "IoTの分散化のための戦略",
  "Latest Robotics Tools": "最新のロボティクスツール",
  "Modern Cybernetics": "現代のサイバネティクス",
  "Economic Processes for Robots": "ロボットのための経済プロセス",
  "Engineering Skills": "エンジニアリングスキル",
  "Your email": "あなたのメール",
  "Submit": "送信",
  "course": "コース",
  "guide": "ガイド",
  "launch simulation": "シミュレーションの開始",
  "real-life setup": "現実のセットアップ",
  "Introduction to the ideas of Robonomics": "Robonomicsのアイデアへの導入",
  "Broadcasting Through the Black Mirror": "ブラックミラーを通じた放送",
  "At the Intersection of Cybernetics and Economics": "サイバネティクスと経済学の交差点で",
  "Polkadot Ecosystem for Home IoT Infrastructure": "ホームIoTインフラストラクチャーのPolkadotエコシステム",
  "IoT Subscriptions Using Robonomics Parachain": "Robonomics Parachainを使用したIoTサブスクリプション",
  "Sovereign Smart Home with Robonomics and Home Assistant": "RobonomicsとHome Assistantを使用した主権スマートホーム",
  "Raspberry Pi Setup": "Raspberry Piのセットアップ",
  "MQTT Broker Setup and Home Assistant Init": "MQTTブローカーのセットアップとHome Assistantの初期化",
  "Gateway Setup: Zigbee2MQTT": "ゲートウェイのセットアップ：Zigbee2MQTT",
  "Gateway Setup: Robonomics SLS Gateway": "ゲートウェイのセットアップ：Robonomics SLSゲートウェイ",
  "Robonomics IoT Subscription Setup": "Robonomics IoTサブスクリプションのセットアップ",
  "Robonomics Integration Setup": "Robonomics統合のセットアップ",
  "Sensors Connectivity & Decentralized Sensors Network": "センサーの接続と分散型センサーネットワーク",
  "Sensor Hardware": "センサーハードウェア",
  "Setting up and connecting sensors": "センサーのセットアップと接続",
  "Sensors connectivity module": "センサー接続モジュール",
  "Sensors connectivity config options": "センサー接続の構成オプション",
  "Sensor map deployment": "センサーマップの展開",
  "Robonomics sensors measure analytics and archive mode": "Robonomicsセンサーの測定分析とアーカイブモード",
  "Connect Mars Curiosity Rover": "火星探査ローバーの接続",
  "Connect ROS-compatible drone": "ROS互換のドローンの接続",
  "Connect Kuka manipulator": "Kukaマニピュレータの接続",
  "Connect unmanned aerial vehicle": "無人空機の接続",
  "Control Baxter robot": "Baxterロボットの制御",
  "ROS-based projects for smart spaces": "スマートスペース向けのROSベースのプロジェクト",
  "Operate Boston Dynamics Spot": "Boston Dynamics Spotの操作",
  "Quickstart Your Bachelor's Thesis with AI-powered Tools": "AIパワードツールを使用した学士論文のクイックスタート",
  "Introduction": "導入",
  "Literature Review": "文献レビュー",
  "Methods": "方法",
  "Conclusion": "結論",
  "OpenGov for managing the IoT infrastructure": "IoTインフラストラクチャーの管理のためのOpenGov",
  "The Shadow of AdCorp's Intrusion": "AdCorpの侵入の影",
  "Introduction to open source solution for private smart homes": "プライベートスマートホーム向けのオープンソースソリューションへの導入",
  "New Home, New Habits": "新しい家、新しい習慣",
  "Assembling Smart Home Board": "スマートホームボードの組み立て",
  "Unleash Automation Potential": "自動化の潜在能力を解放する",
  "Escape from Black Mirror": "ブラックミラーからの脱出",
  "The story of a girl named Trinity": "トリニティという名前の少女の物語",
  "Fake Housewife & AI research Smart Home Solution": "フェイク主婦＆AI研究スマートホームソリューション",
  "Meet Fake Housewife Zoe and her story": "フェイク主婦ゾーイと彼女の物語に会う",
  "Risks of standard Smart Home solutions and the Home Assistant": "標準スマートホームソリューションとHome Assistantのリスク",
  "Blockchain-based Smart home solutions": "ブロックチェーンベースのスマートホームソリューション",
  "Home Assistant + blockchain+Web3": "Home Assistant + blockchain+Web3",
  "Studying the Sovereign smart home course at the academy and WIKI instructions": "アカデミーとWIKIの指示で主権スマートホームコースを学ぶ",
  "Fake Housewife & AI is researching devices to install": "フェイク主婦＆AIがインストールするデバイスを研究中",
  "Fake Housewife & AI is installing a Smart Home Robonomics": "フェイク主婦＆AIがスマートホームRobonomicsをインストール中",
  "AI scenario of the Relax zone for the Fake Housewife": "フェイク主婦のリラックスゾーンのAIシナリ",
  "Software Developing for Boston Dynamics Spot": "Boston Dynamics Spot用のソフトウェア開発",
  "Emergency Stop, Initialization, Body Position Control": "緊急停止、初期化、ボディポジション制御",
  "Getting Used to Feecc": "Feeccに慣れる",
  "Architecture": "アーキテクチャ",
  "Overview": "概要",
  "Demo of Feecc": "Feeccのデモ",
  "Deployment of Engineer Workbench": "エンジニア作業台の展開",
  "Deployment of Analytics": "分析の展開",
  "World computer in your home": "あなたの家に世界コンピューター",
  "Part 1: The Idea of a World Computer": "第1部：世界コンピューターのアイデア",
  "Part 2: The Heart of the World Computer": "第2部：世界コンピューターの中心",
  "Part 3: Emergence of the World Computer": "第3部：世界コンピューターの出現",
  "Part 4: The Path of a New Block of Information in the World Computer": "第4部：世界コンピューターでの新しい情報ブロックの経路",
  "Ivan Berman": "イヴァン・バーマン",
  "Leemo": "リーモ",
  "Vadim Manaenko": "ヴァディム・マナエンコ",
  "Sergei Lonshakov": "セルゲイ・ロンシャコフ",
  "Anna Wimmer-Savinova": "アンナ・ヴィンマー・サヴィノワ",
  "Pavel Tarasov": "パベル・タラソフ",
  "Alexander Smekhnov": "アレクサンダー・スメフノフ",
  "Filter": "フィルター",
  "Note: you need to pass all lessons from course with one Polkadot.js account to apply for certificate": "注意：証明書を申請するには、1つのPolkadot.jsアカウントでコースのすべてのレッスンを合格する必要があります",
  "Robonomics School 2024 / IoT is More Dangerous Than AI": "Robonomics School 2024 / IoTはAIよりも危険です",
  "Robonomics School 2024 / Privacy Insights for Smart Homes": "Robonomics School 2024 / スマートホームのプライバシーインサイト",
  "Robonomics School 2024 / Cyprus Relocant Manual: Smart Home": "Robonomics School 2024 / キプロス移住者マニュアル：スマートホーム"
}