{
  "404": "404",
  "Complexity:": "복잡성:",
  "Tags:": "태그:",
  "Authors:": "저자:",
  "Apply": "적용",
  "Clear all": "모두 지우기",
  "Spring school 2023": "2023 봄 학교",
  "ROS": "ROS",
  "Raspberry Pi": "라즈베리 파이",
  "ai": "ai",
  "Spot": "스팟",
  "Multi-Agent Systems": "다중 에이전트 시스템",
  "Industrial": "산업",
  "World computer": "세계 컴퓨터",
  "Privacy Policy": "개인정보 보호 정책",
  "Learn": "배우다",
  "Robonomics website": "로보노믹스 웹사이트",
  "Tell us more": "더 말해주세요",
  "Send": "보내기",
  "Sending your info...": "정보를 보내는 중...",
  "Thanks": "감사합니다",
  "we’ll keep in touch": "우리는 연락을 유지할 것입니다",
  "Results": "결과",
  "Previous Lesson": "이전 레슨",
  "Previous Page": "이전 페이지",
  "Next Lesson": "다음 레슨",
  "Next Page": "다음 페이지",
  "You are currently opted out. Click here to opt in": "현재 선택하지 않은 상태입니다. 여기를 클릭하여 선택하십시오",
  "You may choose not to have a unique web analytics cookie identification number assigned to your computer to avoid the aggregation and analysis of data collected on this website.": "고유한 웹 분석 쿠키 식별 번호가 컴퓨터에 할당되지 않도록 선택할 수 있습니다. 이 웹사이트에서 수집된 데이터의 집계 및 분석을 피하려면",
  "To make that choice, please click below to receive an opt-out cookie": "그 선택을 하려면 아래를 클릭하여 선택하십시오",
  "You are currently opted out. Click here to opt in.": "현재 선택하지 않은 상태입니다. 여기를 클릭하여 선택하십시오.",
  "Opt-out complete; your visits to this website will not be recorded by the Web Analytics tool. Note that if you clear your cookies, delete the opt-out cookie, or if you change computers or Web browsers, you will need to perform the opt-out procedure again.": "옵트 아웃이 완료되었습니다. 이 웹이트 방문 기록은 웹 분석 도구에 의해 기록되지 않습니다. 쿠키를 지우거나 옵트 아웃 쿠키를 삭제하거나 컴퓨터나 웹 브라우저를 변경하면 옵트 아웃 절차를 다시 수행해야 합니다.",
  "Please click below to opt in:": "옵트 인하려면 아래를 클릭하십시오:",
  "You are currently opted in. Click here to opt out.": "현재 선택된 상태입니다. 여기를 클릭하여 선택을 취소하십시오.",
  "Latest update": "최신 업데이트",
  "on (date of commit)": "(커밋 날짜)",
  "by (author of commit)": "(커밋 작성자)에 의해",
  "Completed the Course?": "코스를 완료했습니까?",
  "You can apply for a certificate of completion, after which you will be able to:": "완료증을 신청할 수 있으며, 이후에 다음을 할 수 있습니다:",
  "add certificate to your LinkedIn profile": "LinkedIn 프로필에 인증서 추가",
  "apply for": "신청하다",
  "Robonomics Ambassador Program": "로보노믹스 대사 프로그램",
  "print the certificate and hang it on the wall.": "인쇄하고 벽에 걸다.",
  "Apply for Certificate": "인증서 신청",
  "Ask question on GitHub": "GitHub에서 질문하기",
  "Get Notifications & Updates": "알림 및 업데이트 받기",
  "You've come to the wrong classroom": "잘못된 교실에 오셨습니다",
  "Return to main campus": "주요 캠퍼스로 돌아가기",
  "Welcome to Our Online School!": "온라인 학교에 오신 것을 환영합니다!",
  "The core developers of the Robonomics project, robotics specialists and PhD research scientists offer to pass through compendious experience based on 7 years of work with web 3.0 projects.": "로보노믹스 프로젝트의 핵심 개발자, 로봇 전문가 및 박사 연구과학자들이 웹 3.0 프로젝트와의 7년 경력을 기반으로 간결한 경험을 거치도록 제안합니다.",
  "What can you discover for yourself in the academy?": "학원에서 스스로 발견할 수 있는 것은 무엇인가요?",
  "Web3 Advanced Applications": "Web3 고급 응용 프로그램",
  "Find out how cutting-edge web3 technologies can be integrated into personal, city, or corporate settings on examples with practical uses in real-life scenarios.": "최첨단 웹3 기술이 개인, 도시 또는 기업 환경에 통합되는 방법을 실제 사용 사를 통해 알아보세요.",
  "Focus on decentralized IoT strategies that provide greater safety and flexibility compared to their centralized counterparts.": "중앙 집중식 대비 안전성과 유연성을 제공하는 분산 IoT 전략에 초점을 맞추세요.",
  "Study new robotics frameworks and SDKs and apply them to your projects.": "새로운 로봇 프레임워크 및 SDK를 공부하고 프로젝트에 적용하세요.",
  "Peep insights how Norbert Wiener's principles of cybernetics are applied to modern autonomous systems.": "노버트 위너의 사이버네틱스 원칙이 현대 자율 시스템에 어떻게 적용되는지 엿보세요.",
  "Discover new mechanisms of techno-economic communication between machines and humans.": "기계와 인간 간의 기술 경제적 소통의 새로운 메커니즘을 발견하세요.",
  "Learn how to work with single board computers, sensors, smart devices and complex robots.": "싱글 보드 컴퓨터, 센서, 스마트 기기 및 복잡한 로봇과 작업하는 방법을 배우세요.",
  "What is Robonomics?": "로보노믹스란 무엇인가요?",
  "Robonomics is a secure, serverless and futuristic IoT platform that connects users and smart devices. It enables the exchange of technical and economic information in the form of atomic transactions between user applications, IoT services, and complex robotics.": "로보노믹스는 사용자와 스마트 기기를 연결하는 안전하고 서버리스이며 미래 지향적인 IoT 플랫폼입니다. 이를 통해 사용자 응용 프로그램, IoT 서비스 및 복잡한 로봇 간의 기술 및 경제적 정보를 원자적 거래 형태로 교환할 수 있습니다.",
  "Learn more on Robonomics website": "로보노믹스 웹사이트에서 자세히 알아보기",
  "User Dapp": "사용자 Dapp",
  "Function Request": "기능 요청",
  "Report": "보고서",
  "Digital Twin": "디지털 트윈",
  "Control": "제어",
  "Log": "로그",
  "IoT Device": "IoT 장치",
  "Learn and practice web3": "웹3을 배우고 실습하세요",
  "Discover our expanding selection of hands-on exercises, tutorials, and online courses for free. The core developers and researchers at Robonomics invite you to enter the world of web3 and gain practical and theoretical skills through quizzes, device simulations, and even real-life setups using Robonomics Parachain (Polkadot), IPFS, and other web3 tools.": "무료로 확장되는 실습, 튜토리얼 및 온라인 코스의 선택을 발견하세요. 로보노믹스의 핵심 개발자와 연구원은 웹3의 세계로 진입하고 퀴즈, 장치 시뮬레이션 및 실제 Robonomics Parachain (Polkadot), IPFS 및 기타 웹3 도구를 사용하여 실제 및 이론적 기술을 습득하도록 초대합니다.",
  "No courses were found with such filters.": "해당 필터로 찾은 코스가 없습니다.",
  "Try again": "다시 시도해보세요",
  "This Policy describes the information we collect from you, how we use that information and our legal basis for doing so. It also covers whether and how that information may be shared and your rights and choices regarding the information you provide to us.": "이 정책은 귀하로부터 수집한 정보, 해당 정보를 어떻게 사용하고 있는지, 그에 대한 법적 근거를 설명합니다. 또한 그 정보가 어떻게 공유될 수 있고 귀하가 제공한 정보에 대한 권리 및 선택 사항을 다룹니다.",
  "Where are those annoying cookie consent pop-ups?": "귀찮은 쿠키 동의 팝업이 어디에 있나요?",
  "We don't need cookie consent is needed because:": "쿠키 동의가 필요하지 않은 이유:",
  "Tracking cookies are not used": "추적 쿠키가 사용되지 않음",
  "The data is not used for any other purpose than analytics": "데이터는 분석 외의 다른 목적으로 사용되지 않음",
  "Visitors aren’t tracked across websites": "방문자는 웹사이트 간에 추적되지 않음",
  "A user cannot be tracked across days within the same website": "사용자는 동일한 웹사이트 내에서 여러 날짜에 걸쳐 추적되지 않음",
  "What We Collect and Receive": "우리가 수집하고 받는 것",
  "In order for us to provide you the best possible experience on our websites, we need to collect and process certain information. Depending on your use of the Services, that may include:": "우리가 웹사이트에서 최상의 경험을 제공하기 위해 귀하로부터 일정한 정보를 수집하고 처리해야 합니다. 서비스 사용에 따라 그것은 다음을 포함할 수 있습니다:",
  "Contact us via email": "이메일을 통해 연락하기",
  "for example, when you submit our forms, send us questions or comments, or report a problem, we will collect your name, email address, message, etc. We use this data solely in connection with answering the queries we receive.": "예를 들어, 양식을 제출하거나 질문이나 의견을 보내거나 문제를 신고할 때 이름, 이메일 주소, 메시지 등을 수집합니다. 우리는 이 데이터를 받은 질문 대한 연결로만 사용합니다.",
  "Usage data": "사용 데이터",
  "other": "기타",
  "non-personal data. We process this usage data only on our server, not passing it to third-parties with": "비개인적 데이터. 이 사용 데이터는 서버에서만 처리되며",
  "Matomo": "Matomo",
  "web analytics platform that gives us 100% data ownership. This analytics helps us to improve user experience with our website and to recognize and stop any misuse.": "웹 분석 플랫폼을 통해 제3자에게 전달되지 않습니다. 이 분석은 웹사이트의 사용자 경험을 개선하고 잘못 사용을 인식하고 막는 데 도움이 됩니다.",
  "Non-personalized cookies": "비개인화된 쿠키",
  "we use non-tracking cookies (small data files transferred onto computers or devices by sites) for record-keeping purposes and to enhance functionality on our website. You may deactivate or restrict the transmission of these cookies by changing the settings of your web browser or by opt-out on this page in the form below. Cookies that are already stored may be deleted at any time.": "우리는 기록 보관 목적 및 웹 사이트의 기능을 향상시키기 위해 비추적 쿠키(사이트에 의해 컴퓨터나 장치로 전송되는 작은 데이터 파일)를 사용합니다. 웹 브라우저 설정을 변경하거나 아래 양식을 통해 이 페이지에서 쿠키의 전송을 비활성화하거나 제한할 수 있습니다. 이미 저장된 쿠키는 언제든지 삭제할 수 있습니다.",
  "Opt-out of website tracking": "웹 사이트 추적 비활성화",
  "You can opt out of being tracked by our Matomo Analytics instance below:": "아래의 Matomo Analytics 인스턴스 추적을 비활성화할 수 있습니다:",
  "Your Rights": "귀하의 권리",
  "You have the right to be informed of Personal Data processed by Matomo, a right to rectification/correction, erasure and restriction of processing. You also have the right to ask from us a structured, common and machine-readable format of Personal Data you provided to us.": "Matomo에서 처리된 개인 데이터에 대한 정보를 받을 권리, 정정/수정, 삭제 및 처리 제한에 대한 권리가 있습니다. 또한 귀하가 제공한 개인 데이터에 대해 우리에게 구조화된, 공통 및 기계 판독 가능한 형식을 요청할 권리가 있습니다.",
  "We can only identify you via your email address and we can only adhere to your request and provide information if we have Personal Data about you through you having made contact with us directly and/or you using our site and/or service. We cannot provide, rectify or delete any data that we store on behalf of our users or customers.": "귀하를 식별할 수 있는 것은 귀하의 이메일 주소뿐이며, 귀하가 직접 저희에게 연락하거나 저희 사이트나 서비스를 사용하여 개인 데이터를 보유하고 있는 경우에만 귀하의 요청을 준수하고 정보를 제공할 수 있습니다. 저희가 사용자나 고객을 대신하여 저장하는 데이터를 제공, 수정 는 삭제할 수 없습니다.",
  "To exercise any of the rights mentioned in this Privacy Policy and/or in the event of questions or comments relating to the use of Personal Data you may contact us.": "본 개인 정보 보호 정책에서 언급된 권리 중 어느 것을 행사하거나 개인 데이터 사용에 관한 질문이나 의견이 있는 경우에는 저희에게 연락하실 수 있습니다.",
  "In addition, you have the right to lodge a complaint with the data protection authority in your jurisdiction.": "또한, 귀하의 관할 지역의 데이터 보호 당국에 불만을 제기할 권리가 있습니다.",
  "Retention of data": "데이터 보존",
  "We will retain your information as long as necessary to provide you with the services or as otherwise set forth in this Policy. We will also retain and use this information as necessary for the purposes set out in this Policy and to the extent necessary to comply with our legal obligations, resolve disputes, enforce our agreements and protect Robonomics Academy legal rights.": "본 정책에서 명시된 바와 같이 서비스를 제공하기 위해 필요한 기간 동안 귀하의 정보를 보관할 것입니다. 또한 본 정책에서 명시된 목적으로 이 정보를 보존하고 사용하며, 법적 의무를 준수하거나 분쟁을 해결하고 계약을 시행하며 Robonomics Academy의 법적 권리를 보호하기 위해 필요한 범위 내에서 이 정보를 보존할 것입니다.",
  "We also collect and maintain aggregated, anonymized or pseudonymized information which we may retain indefinitely to protect the safety and security of our Site, improve our Services or comply with legal obligations.": "또한, 저희는 사이트의 안전과 보안을 보호하거나 서비스를 개선하거나 법적 의무를 준수하기 위해 영구히 보존할 수 있는 집계, 익명화 또는 의사 이름화된 정보를 수집 및 유지합니다.",
  "This page has moved to a": "이 페이지는 다음으로 이동되었습니다",
  "Automatic redirecting": "자동 리디렉션",
  "when you visit our website, we will store: the URL from which you visited us from, web pages of our website you visit, the date and duration of your visit, your anonymized IP address, the device specifications (device type, operating system, screen resolution, language, country you are located in, and web browser type) you used during your visit, and": "당사 웹사이트를 방문할 때 다음을 저장합니다: 방문한 URL, 방문한 웹페이지, 방문 날짜 및 기간, 익명화된 IP 주소, 방문 중 사용한 기기 사양(기기 유형, 운영 체제, 화면 해상도, 언어, 위치한 국가 및 웹 브라우저 유형)",
  "Sending your request": "요청을 보내는 중입니다",
  "You are in the list": "당신은 목록에 있습니다",
  "By submitting this form you agree to receive emails with notifications and updates from the Robonomics Network team": "이 양식을 제출함으로써 Robonomics Network 팀으로부터의 알림 및 업데이트를 수신하는 데 동의합니다",
  "Strategies for IoT Decentralization": "IoT 분산화를 위한 전략",
  "Latest Robotics Tools": "최신 로봇 공구",
  "Modern Cybernetics": "현대 사이버네틱스",
  "Economic Processes for Robots": "로봇을 위한 경제 프로세스",
  "Engineering Skills": "공학 기술",
  "Your email": "당신의 이메일",
  "Submit": "제출",
  "course": "코스",
  "guide": "가이드",
  "launch simulation": "시뮬레이션 시작",
  "real-life setup": "실제 설정",
  "Introduction to the ideas of Robonomics": "로보노믹스 아이디어 소개",
  "Broadcasting Through the Black Mirror": "블랙 미러를 통한 방송",
  "At the Intersection of Cybernetics and Economics": "사이버네틱스와 경제의 교차로",
  "Polkadot Ecosystem for Home IoT Infrastructure": "홈 IoT 인프라를 위한 폴카닷 생태계",
  "IoT Subscriptions Using Robonomics Parachain": "로보노믹스 파라체인을 이용한 IoT 구독",
  "Sovereign Smart Home with Robonomics and Home Assistant": "로보노믹스와 홈 어시스턴트를 이용한 주권 스마트 홈",
  "Raspberry Pi Setup": "라즈베리 파이 설정",
  "MQTT Broker Setup and Home Assistant Init": "MQTT 브로커 설정 및 홈 어시스턴트 초기화",
  "Gateway Setup: Zigbee2MQTT": "게이트웨이 설정: Zigbee2MQTT",
  "Gateway Setup: Robonomics SLS Gateway": "게이트웨이 설정: 로보노믹스 SLS 게이트웨이",
  "Robonomics IoT Subscription Setup": "로보노믹스 IoT 구독 설정",
  "Robonomics Integration Setup": "로보노믹스 통합 설정",
  "Sensors Connectivity & Decentralized Sensors Network": "센서 연결 및 분산 센서 네트워크",
  "Sensor Hardware": "센서 하드웨어",
  "Setting up and connecting sensors": "센서 설정 및 연결",
  "Sensors connectivity module": "센서 연결 모듈",
  "Sensors connectivity config options": "센서 연결 구성 옵션",
  "Sensor map deployment": "센서 맵 배포",
  "Robonomics sensors measure analytics and archive mode": "로보노믹스 센서 측정 분석 및 아카이브 모드",
  "Connect Mars Curiosity Rover": "화성 호기심 로버 연결",
  "Connect ROS-compatible drone": "ROS 호환 드론 연결",
  "Connect Kuka manipulator": "쿠카 조작기 연결",
  "Connect unmanned aerial vehicle": "무인 항공기 연결",
  "Control Baxter robot": "백스터 로봇 제어",
  "ROS-based projects for smart spaces": "스마트 공간을 위한 ROS 기반 프로젝트",
  "Operate Boston Dynamics Spot": "보스턴 다이내믹스 스팟 운영",
  "Quickstart Your Bachelor's Thesis with AI-powered Tools": "AI 기반 도구로 학사 논문 빠르게 시작하기",
  "Introduction": "소개",
  "Literature Review": "문헌 고찰",
  "Methods": "방법",
  "Conclusion": "결론",
  "OpenGov for managing the IoT infrastructure": "IoT 인프라 관리를 위한 OpenGov",
  "The Shadow of AdCorp's Intrusion": "AdCorp의 침입 그림자",
  "Introduction to open source solution for private smart homes": "개인 스마트 홈을 위한 오픈 소스 솔루션 소개",
  "New Home, New Habits": "새로운 집, 새로운 습관",
  "Assembling Smart Home Board": "스마트 홈 보드 조립",
  "Unleash Automation Potential": "자동화 잠재력 발휘",
  "Escape from Black Mirror": "블랙 미러로부터 탈출",
  "The story of a girl named Trinity": "트리니티라는 소녀 이야기",
  "Fake Housewife & AI research Smart Home Solution": "가짜 주부 & AI 연구 스마트 홈 솔루션",
  "Meet Fake Housewife Zoe and her story": "가짜 주부 조이와 그녀의 이야기",
  "Risks of standard Smart Home solutions and the Home Assistant": "표준 스마트 홈 솔루션과 홈 어시스턴트의 위험",
  "Blockchain-based Smart home solutions": "블록체인 기반 스마트 홈 솔루션",
  "Home Assistant + blockchain+Web3": "홈 어시스턴트 + 블록체인+Web3",
  "Studying the Sovereign smart home course at the academy and WIKI instructions": "아카데미에서 주권 스마트 홈 코스와 WIKI 지침 공부",
  "Fake Housewife & AI is researching devices to install": "가짜 주부 & AI가 설치할 장치 연구 중",
  "Fake Housewife & AI is installing a Smart Home Robonomics": "가짜 주부 & AI가 로보노믹스 스마트 홈 설치 중",
  "AI scenario of the Relax zone for the Fake Housewife": "가짜 주부를 위한 휴식 존의 AI 시나리오",
  "Software Developing for Boston Dynamics Spot": "보스턴 다이내믹스 스팟을 위한 소프트웨어 개발",
  "Emergency Stop, Initialization, Body Position Control": "비상 정지, 초기화, 몸의 위치 제어",
  "Getting Used to Feecc": "Feecc에 적응하기",
  "Architecture": "아키텍처",
  "Overview": "개요",
  "Demo of Feecc": "Feecc 데모",
  "Deployment of Engineer Workbench": "엔지니어 작업대 배포",
  "Deployment of Analytics": "분석 배포",
  "World computer in your home": "당신의 집에 있는 세계 컴퓨터",
  "Part 1: The Idea of a World Computer": "제1부: 세계 컴퓨터의 아이디어",
  "Part 2: The Heart of the World Computer": "제2부: 세계 컴퓨터의 핵심",
  "Part 3: Emergence of the World Computer": "제3부: 세계 컴퓨터의 등장",
  "Part 4: The Path of a New Block of Information in the World Computer": "제4부: 세계 컴퓨터에서 새로운 정보 블록의 경로",
  "Ivan Berman": "이반 버만",
  "Leemo": "리모",
  "Vadim Manaenko": "바딤 마나엔코",
  "Sergei Lonshakov": "세르게이 론샤코프",
  "Anna Wimmer-Savinova": "안나 빔머-사비노바",
  "Pavel Tarasov": "파벨 타라소프",
  "Alexander Smekhnov": "알렉산더 스메크노프",
  "Filter": "필터",
  "Note: you need to pass all lessons from course with one Polkadot.js account to apply for certificate": "참고: 인증서를 신청하려면 한 개의 Polkadot.js 계정으로 과정의 모든 레슨을 통과해야 합니다",
  "Robonomics School 2024 / IoT is More Dangerous Than AI": "로보노믹스 학교 2024 / IoT는 AI보다 더 위험하다",
  "Robonomics School 2024 / Privacy Insights for Smart Homes": "로보노믹스 학교 2024 / 스마트 홈을 위한 개인 정보 인사이트",
  "Robonomics School 2024 / Cyprus Relocant Manual: Smart Home": "로보노믹스 학교 2024 / 키프로스 이주자 매뉴얼: 스마트 홈"
}