{
  "404": "404",
  "Welcome to Our Online School!": "Bem-vindo(a) à nossa escola online!",
  "What is Robonomics?": "O que é a Robonomics?",
  "User Dapp": "Usuário (D)app",
  "Function Request": "Solicitação de função",
  "Report": "Relatório",
  "Digital Twin": "Gêmeos digitais",
  "Control": "Controle",
  "Log": "Registro",
  "IoT Device": "Dispositivo IoT",
  "Complexity:": "Complexidade:",
  "Tags:": "Tags:",
  "Authors:": "Autores:",
  "Apply": "Aplicar",
  "Clear all": "Limpar tudo",
  "Spring school 2023": "Spring school 2023",
  "ROS": "ROS",
  "Raspberry Pi": "Raspberry Pi",
  "ai": "ia",
  "Spot": "Spot",
  "Multi-Agent Systems": "Sistemas Multi-Agentes",
  "Industrial": "Industrial",
  "World computer": "Computador mundial",
  "Privacy Policy": "Política de Privacidade",
  "Learn": "Aprender",
  "Robonomics website": "Site da Robonomics",
  "Tell us more": "Conte-nos mais",
  "Send": "Enviar",
  "Sending your info...": "Enviando suas informações...",
  "Thanks": "Obrigado",
  "we’ll keep in touch": "vamos manter contato",
  "Results": "Resultados",
  "Previous Lesson": "Lições Anteriores",
  "Previous Page": "Página Anterior",
  "Next Lesson": "Próxima Lição",
  "Next Page": "Próxima Página",
  "You are currently opted out. Click here to opt in": "Você está atualmente optado. Clique aqui para optar por entrar",
  "You may choose not to have a unique web analytics cookie identification number assigned to your computer to avoid the aggregation and analysis of data collected on this website.": "Você pode optar por não ter um número de identificação de cookie de análise da web exclusivo atribuído ao seu computador para evitar a agregação e análise de dados coletados neste site.",
  "To make that choice, please click below to receive an opt-out cookie": "Para fazer essa escolha, clique abaixo para receber um cookie de exclusão",
  "You are currently opted out. Click here to opt in.": "Você está atualmente optado. Clique aqui para optar por entrar.",
  "Opt-out complete; your visits to this website will not be recorded by the Web Analytics tool. Note that if you clear your cookies, delete the opt-out cookie, or if you change computers or Web browsers, you will need to perform the opt-out procedure again.": "Exclusão concluída; suas visitas a este site não serão registradas pela ferramenta de Análise da Web. Observe que se você limpar seus cookies, excluir o cookie de exclusão ou se mudar de computador ou navegadores da Web, será necessário realizar o procedimento de exclusão novamente.",
  "Please click below to opt in:": "Clique abaixo para optar por entrar:",
  "You are currently opted in. Click here to opt out.": "Você está atualmente optado. Clique aqui para optar por sair.",
  "Latest update": "Última atualização",
  "on (date of commit)": "em (data do commit)",
  "by (author of commit)": "por (autor do commit)",
  "Completed the Course?": "Concluiu o Curso?",
  "You can apply for a certificate of completion, after which you will be able to:": "Você pode solicitar um certificado de conclusão, após o qual você poderá:",
  "add certificate to your LinkedIn profile": "adicionar certificado ao seu perfil do LinkedIn",
  "apply for": "solicitar",
  "Robonomics Ambassador Program": "Programa de Embaixadores da Robonomics",
  "print the certificate and hang it on the wall.": "imprimir o certificado e pendurá-lo na parede.",
  "Apply for Certificate": "Solicitar Certificado",
  "Ask question on GitHub": "Fazer pergunta no GitHub",
  "Get Notifications & Updates": "Receber Notificações e Atualizações",
  "You've come to the wrong classroom": "Você entrou na sala de aula errada",
  "Return to main campus": "Retornar ao campus principal",
  "The core developers of the Robonomics project, robotics specialists and PhD research scientists offer to pass through compendious experience based on 7 years of work with web 3.0 projects.": "Os desenvolvedores principais do projeto Robonomics, especialistas em robótica e cientistas de pesquisa de doutorado oferecem passar por uma experiência compêndio baseada em 7 anos de trabalho com projetos web 3.0.",
  "What can you discover for yourself in the academy?": "O que você pode descobrir por si mesmo na academia?",
  "Web3 Advanced Applications": "Aplicações Avançadas Web3",
  "Find out how cutting-edge web3 technologies can be integrated into personal, city, or corporate settings on examples with practical uses in real-life scenarios.": "Descubra como as tecnologias de ponta web3 podem ser integradas em configurações pessoais, urbanas ou corporativas em exemplos com usos práticos em cenários da vida real.",
  "Focus on decentralized IoT strategies that provide greater safety and flexibility compared to their centralized counterparts.": "Concentre-se em estratégias descentralizadas de IoT que oferecem maior segurança e flexibilidade em comparação com suas contrapartes centralizadas.",
  "Study new robotics frameworks and SDKs and apply them to your projects.": "Estude novos frameworks e SDKs de robótica e aplique-os em seus projetos.",
  "Peep insights how Norbert Wiener's principles of cybernetics are applied to modern autonomous systems.": "Dê uma olhada em como os princípios de cibernética de Norbert Wiener são aplicados a sistemas autônomos modernos.",
  "Discover new mechanisms of techno-economic communication between machines and humans.": "Descubra novos mecanismos de comunicação tecnoeconômica entre máquinas e humanos.",
  "Learn how to work with single board computers, sensors, smart devices and complex robots.": "Aprenda a trabalhar com computadores de placa única, sensores, dispositivos inteligentes e robôs complexos.",
  "Robonomics is a secure, serverless and futuristic IoT platform that connects users and smart devices. It enables the exchange of technical and economic information in the form of atomic transactions between user applications, IoT services, and complex robotics.": "Robonomics é uma plataforma IoT segura, sem servidor e futurista que conecta usuários e dispositivos inteligentes. Ele permite a troca de informações técnicas e econômicas na forma de transações atômicas entre aplicativos de usuário, serviços de IoT e robótica complexa.",
  "Learn more on Robonomics website": "Saiba mais no site da Robonomics",
  "Learn and practice web3": "Aprenda e pratique web3",
  "Discover our expanding selection of hands-on exercises, tutorials, and online courses for free. The core developers and researchers at Robonomics invite you to enter the world of web3 and gain practical and theoretical skills through quizzes, device simulations, and even real-life setups using Robonomics Parachain (Polkadot), IPFS, and other web3 tools.": "Descubra nossa crescente seleção de exercícios práticos, tutoriais e cursos online gratuitos. Os desenvolvedores principais e pesquisadores da Robonomics convidam você a entrar no mundo do web3 e adquirir habilidades práticas e teóricas por meio de questionários, simulações de dispositivos e até configurações da vida real usando Robonomics Parachain (Polkadot), IPFS e outras ferramentas web3.",
  "No courses were found with such filters.": "Nenhum curso foi encontrado com esses filtros.",
  "Try again": "Tente novamente",
  "This Policy describes the information we collect from you, how we use that information and our legal basis for doing so. It also covers whether and how that information may be shared and your rights and choices regarding the information you provide to us.": "Esta Política descreve as informações que coletamos de você, como usamos essas informações e nossa base legal para fazê-lo. Também aborda se e como essas informações podem ser compartilhadas e seus direitos e escolhas em relação às informações que você nos fornece.",
  "Where are those annoying cookie consent pop-ups?": "Onde estão aquelas irritantes janelas pop-up de consentimento de cookies?",
  "We don't need cookie consent is needed because:": "Não precisamos de consentimento de cookies porque:",
  "Tracking cookies are not used": "Cookies de rastreamento não são usados",
  "The data is not used for any other purpose than analytics": "Os dados não são usados para nenhum outro propósito além de análises",
  "Visitors aren’t tracked across websites": "Os visitantes não são rastreados em outros sites",
  "A user cannot be tracked across days within the same website": "Um usuário não pode ser rastreado ao longo dos dias dentro do mesmo site",
  "What We Collect and Receive": "O que Coletamos e Recebemos",
  "In order for us to provide you the best possible experience on our websites, we need to collect and process certain information. Depending on your use of the Services, that may include:": "Para que possamos fornecer a você a melhor experiência possível em nossos sites, precisamos coletar e processar determinadas informações. Dependendo do seu uso dos Serviços, isso pode incluir:",
  "Contact us via email": "Entre em contato conosco por e-mail",
  "for example, when you submit our forms, send us questions or comments, or report a problem, we will collect your name, email address, message, etc. We use this data solely in connection with answering the queries we receive.": "por exemplo, quando você envia nossos formulários, nos envia perguntas ou comentários ou relata um problema, coletaremos seu nome, endereço de e-mail, mensagem, etc. Usamos esses dados exclusivamente em conexão com a resposta às consultas que recebemos.",
  "Usage data": "Dados de uso",
  "other": "outros",
  "non-personal data. We process this usage data only on our server, not passing it to third-parties with": "dados não pessoais. Processamos esses dados de uso apenas em nosso servidor, não os passando para terceiros com",
  "Matomo": "Matomo",
  "web analytics platform that gives us 100% data ownership. This analytics helps us to improve user experience with our website and to recognize and stop any misuse.": "plataforma de análise da web que nos dá 100% de propriedade dos dados. Essa análise nos ajuda a melhorar a experiência do usuário com nosso site e a reconhecer e interromper qualquer uso indevido.",
  "Non-personalized cookies": "Cookies não personalizados",
  "we use non-tracking cookies (small data files transferred onto computers or devices by sites) for record-keeping purposes and to enhance functionality on our website. You may deactivate or restrict the transmission of these cookies by changing the settings of your web browser or by opt-out on this page in the form below. Cookies that are already stored may be deleted at any time.": "Nós usamos cookies não rastreáveis (pequenos arquivos de dados transferidos para computadores ou dispositivos por sites) para fins de registro e para melhorar a funcionalidade em nosso site. Você pode desativar ou restringir a transmissão desses cookies alterando as configurações do seu navegador da web ou optando por sair nesta página no formulário abaixo. Os cookies que já estão armazenados podem ser excluídos a qualquer momento.",
  "Opt-out of website tracking": "Opt-out de rastreamento de site",
  "You can opt out of being tracked by our Matomo Analytics instance below:": "Você pode optar por não ser rastreado por nossa instância de Matomo Analytics abaixo:",
  "Your Rights": "Seus Direitos",
  "You have the right to be informed of Personal Data processed by Matomo, a right to rectification/correction, erasure and restriction of processing. You also have the right to ask from us a structured, common and machine-readable format of Personal Data you provided to us.": "Você tem o direito de ser informado sobre os Dados Pessoais processados pelo Matomo, o direito de retificação/correção, exclusão e restrição de processamento. Você também tem o direito de nos solicitar um formato estruturado, comum e legível por máquina dos Dados Pessoais que você nos forneceu.",
  "We can only identify you via your email address and we can only adhere to your request and provide information if we have Personal Data about you through you having made contact with us directly and/or you using our site and/or service. We cannot provide, rectify or delete any data that we store on behalf of our users or customers.": "Só podemos identificá-lo através do seu endereço de e-mail e só podemos atender ao seu pedido e fornecer informações se tivermos Dados Pessoais sobre você através de você ter entrado em contato conosco diretamente e/ou você usando nosso site e/ou serviço. Não podemos fornecer, retificar ou excluir quaisquer dados que armazenamos em nome de nossos usuários ou clientes.",
  "To exercise any of the rights mentioned in this Privacy Policy and/or in the event of questions or comments relating to the use of Personal Data you may contact us.": "Para exercer qualquer um dos direitos mencionados nesta Política de Privacidade e/ou em caso de dúvidas ou comentários relacionados ao uso de Dados Pessoais, você pode entrar em contato conosco.",
  "In addition, you have the right to lodge a complaint with the data protection authority in your jurisdiction.": "Além disso, você tem o direito de apresentar uma reclamação à autoridade de proteção de dados em sua jurisdição.",
  "Retention of data": "Retenção de dados",
  "We will retain your information as long as necessary to provide you with the services or as otherwise set forth in this Policy. We will also retain and use this information as necessary for the purposes set out in this Policy and to the extent necessary to comply with our legal obligations, resolve disputes, enforce our agreements and protect Robonomics Academy legal rights.": "Manteremos suas informações pelo tempo necessário para fornecer os serviços ou conforme estabelecido nesta Política. Também manteremos e usaremos essas informações conforme necessário para os fins estabelecidos nesta Política e na medida necessária para cumprir nossas obrigações legais, resolver disputas, fazer cumprir nossos acordos e proteger os direitos legais da Robonomics Academy.",
  "We also collect and maintain aggregated, anonymized or pseudonymized information which we may retain indefinitely to protect the safety and security of our Site, improve our Services or comply with legal obligations.": "Também coletamos e mantemos informações agregadas, anonimizadas ou pseudonimizadas que podemos reter indefinidamente para proteger a segurança de nosso Site, melhorar nossos Serviços ou cumprir obrigações legais.",
  "This page has moved to a": "Esta página foi movida para um",
  "Automatic redirecting": "Redirecionamento automático",
  "when you visit our website, we will store: the URL from which you visited us from, web pages of our website you visit, the date and duration of your visit, your anonymized IP address, the device specifications (device type, operating system, screen resolution, language, country you are located in, and web browser type) you used during your visit, and": "quando você visita nosso site, nós iremos armazenar: o URL de onde você nos visitou, as páginas da web do nosso site que você visitou, a data e duração da sua visita, seu endereço IP anonimizado, as especificações do dispositivo (tipo de dispositivo, sistema operacional, resolução de tela, idioma, país em que você está localizado e tipo de navegador da web) que você usou durante sua visita, e",
  "Sending your request": "Enviando sua solicitação",
  "You are in the list": "Você está na lista",
  "By submitting this form you agree to receive emails with notifications and updates from the Robonomics Network team": "Ao enviar este formulário, você concorda em receber e-mails com notificações e atualizações da equipe da Rede Robonomics",
  "Strategies for IoT Decentralization": "Estratégias para Descentralização de IoT",
  "Latest Robotics Tools": "Últimas Ferramentas de Robótica",
  "Modern Cybernetics": "Cibernética Moderna",
  "Economic Processes for Robots": "Processos Econômicos para Robôs",
  "Engineering Skills": "Habilidades de Engenharia",
  "Your email": "Seu email",
  "Submit": "Enviar",
  "course": "curso",
  "guide": "guia",
  "launch simulation": "lançamento de simulação",
  "real-life setup": "configuração da vida real",
  "Introduction to the ideas of Robonomics": "Introdução às ideias da Robonomics",
  "Broadcasting Through the Black Mirror": "Transmissão através do Black Mirror",
  "At the Intersection of Cybernetics and Economics": "No cruzamento da cibernética e da economia",
  "Polkadot Ecosystem for Home IoT Infrastructure": "Ecossistema Polkadot para Infraestrutura IoT Doméstica",
  "IoT Subscriptions Using Robonomics Parachain": "Assinaturas IoT usando Robonomics Parachain",
  "Sovereign Smart Home with Robonomics and Home Assistant": "Casa Inteligente Soberana com Robonomics e Home Assistant",
  "Raspberry Pi Setup": "Configuração do Raspberry Pi",
  "MQTT Broker Setup and Home Assistant Init": "Configuração do Broker MQTT e Inicialização do Home Assistant",
  "Gateway Setup: Zigbee2MQTT": "Configuração do Gateway: Zigbee2MQTT",
  "Gateway Setup: Robonomics SLS Gateway": "Configuração do Gateway: Robonomics SLS Gateway",
  "Robonomics IoT Subscription Setup": "Configuração de Assinatura IoT Robonomics",
  "Robonomics Integration Setup": "Configuração de Integração Robonomics",
  "Sensors Connectivity & Decentralized Sensors Network": "Conectividade de Sensores e Rede Descentralizada de Sensores",
  "Sensor Hardware": "Hardware de Sensores",
  "Setting up and connecting sensors": "Configuração e conexão de sensores",
  "Sensors connectivity module": "Módulo de conectividade de sensores",
  "Sensors connectivity config options": "Opções de configuração de conectividade de sensores",
  "Sensor map deployment": "Implantação de mapa de sensores",
  "Robonomics sensors measure analytics and archive mode": "Modo de análise e arquivamento de medidas de sensores Robonomics",
  "Connect Mars Curiosity Rover": "Conectar o Rover Curiosity de Marte",
  "Connect ROS-compatible drone": "Conectar drone compatível com ROS",
  "Connect Kuka manipulator": "Conectar manipulador Kuka",
  "Connect unmanned aerial vehicle": "Conectar veículo aéreo não tripulado",
  "Control Baxter robot": "Controlar o robô Baxter",
  "ROS-based projects for smart spaces": "Projetos baseados em ROS para espaços inteligentes",
  "Operate Boston Dynamics Spot": "Operar o Boston Dynamics Spot",
  "Quickstart Your Bachelor's Thesis with AI-powered Tools": "Iniciar rápido sua tese de bacharel com ferramentas alimentadas por IA",
  "Introduction": "Introdução",
  "Literature Review": "Revisão da literatura",
  "Methods": "Métodos",
  "Conclusion": "Conclusão",
  "OpenGov for managing the IoT infrastructure": "OpenGov para gerenciar a infraestrutura IoT",
  "The Shadow of AdCorp's Intrusion": "A Sombra da Intrusão da AdCorp",
  "Introduction to open source solution for private smart homes": "Introdução à solução de código aberto para casas inteligentes privadas",
  "New Home, New Habits": "Nova Casa, Novos Hábitos",
  "Assembling Smart Home Board": "Montagem da Placa de Casa Inteligente",
  "Unleash Automation Potential": "Desencadear o Potencial de Automação",
  "Escape from Black Mirror": "Fugir do Black Mirror",
  "The story of a girl named Trinity": "A história de uma garota chamada Trinity",
  "Fake Housewife & AI research Smart Home Solution": "Dona de Casa Falsa e Solução de Casa Inteligente de Pesquisa de IA",
  "Meet Fake Housewife Zoe and her story": "Conheça a Dona de Casa Falsa Zoe e sua história",
  "Risks of standard Smart Home solutions and the Home Assistant": "Riscos das soluções padrão de Casa Inteligente e o Home Assistant",
  "Blockchain-based Smart home solutions": "Soluções de Casa Inteligente baseadas em Blockchain",
  "Home Assistant + blockchain+Web3": "Home Assistant + blockchain+Web3",
  "Studying the Sovereign smart home course at the academy and WIKI instructions": "Estudando o curso de casa inteligente soberana na academia e instruções da WIKI",
  "Fake Housewife & AI is researching devices to install": "Dona de Casa Falsa e IA está pesquisando dispositivos para instalar",
  "Fake Housewife & AI is installing a Smart Home Robonomics": "Dona de Casa Falsa e IA está instalando uma Casa Inteligente Robonomics",
  "AI scenario of the Relax zone for the Fake Housewife": "Cenário de IA da Zona de Relaxamento para a Dona de Casa Falsa",
  "Software Developing for Boston Dynamics Spot": "Desenvolvimento de Software para o Boston Dynamics Spot",
  "Emergency Stop, Initialization, Body Position Control": "Parada de Emergência, Inicialização, Controle de Posição do Corpo",
  "Getting Used to Feecc": "Acostumando-se ao Feecc",
  "Architecture": "Arquitetura",
  "Overview": "Visão Geral",
  "Demo of Feecc": "Demonstração do Feecc",
  "Deployment of Engineer Workbench": "Implantação da Bancada de Engenheiro",
  "Deployment of Analytics": "Implantação de Análises",
  "World computer in your home": "Computador mundial em sua casa",
  "Part 1: The Idea of a World Computer": "Parte 1: A Ideia de um Computador Mundial",
  "Part 2: The Heart of the World Computer": "Parte 2: O Coração do Computador Mundial",
  "Part 3: Emergence of the World Computer": "Parte 3: Emergência do Computador Mundial",
  "Part 4: The Path of a New Block of Information in the World Computer": "Parte 4: O Caminho de um Novo Bloco de Informações no Computador Mundial",
  "Ivan Berman": "Ivan Berman",
  "Leemo": "Leemo",
  "Vadim Manaenko": "Vadim Manaenko",
  "Sergei Lonshakov": "Sergei Lonshakov",
  "Anna Wimmer-Savinova": "Anna Wimmer-Savinova",
  "Pavel Tarasov": "Pavel Tarasov",
  "Alexander Smekhnov": "Alexander Smekhnov",
  "Filter": "Filtro"
}