{
  "404": "404",
  "Welcome to Our Online School!": "Добро пожаловать в нашу онлайн школу!",
  "What is Robonomics?": "Что такое Робономика?",
  "User Dapp": "Пользователь (D)app",
  "Function Request": "Запрос функции",
  "Report": "Отчет",
  "Digital Twin": "Цифровой двойник",
  "Control": "Контроль",
  "Log": "Лог",
  "IoT Device": "IoT-устройство",
  "Complexity:": "Сложность:",
  "Tags:": "Теги:",
  "Authors:": "Авторы:",
  "Apply": "Применить",
  "Clear all": "Очистить все",
  "Spring school 2023": "Весенняя школа 2023",
  "ROS": "ROS",
  "Raspberry Pi": "Raspberry Pi",
  "ai": "ai",
  "Spot": "Spot",
  "Multi-Agent Systems": "Мультиагентные системы",
  "Industrial": "Промышленность",
  "World computer": "Мировой компьютер",
  "Privacy Policy": "Политика конфиденциальности",
  "Learn": "Учиться",
  "Robonomics website": "Веб-сайт Robonomics",
  "Tell us more": "Расскажите нам больше",
  "Send": "Отправить",
  "Sending your info...": "Отправка ваших данных...",
  "Thanks": "Спасибо",
  "we’ll keep in touch": "мы будем на связи",
  "Results": "Результаты",
  "Previous Lesson": "Предыдущий урок",
  "Previous Page": "Предыдущая страница",
  "Next Lesson": "Следующий урок",
  "Next Page": "Следующая страница",
  "You are currently opted out. Click here to opt in": "В настоящее время вы отказались. Нажмите здесь, чтобы снова включить",
  "You may choose not to have a unique web analytics cookie identification number assigned to your computer to avoid the aggregation and analysis of data collected on this website.": "Вы можете отказаться от присвоения уникального идентификационного номера веб-аналитики вашему компьютеру, чтобы изежать агрегации и анализа данных, собранных на этом веб-сайте.",
  "To make that choice, please click below to receive an opt-out cookie": "Чтобы сделать выбор, пожалуйста, нажмите ниже, чтобы получить файл cookie для отказа",
  "You are currently opted out. Click here to opt in.": "В настоящее время вы отказались. Нажмите здесь, чтобы снова включить.",
  "Opt-out complete; your visits to this website will not be recorded by the Web Analytics tool. Note that if you clear your cookies, delete the opt-out cookie, or if you change computers or Web browsers, you will need to perform the opt-out procedure again.": "Отказ завершен; ваши посещения этого веб-сайта не будут записаны с помощью инструмента веб-аналитики. Обратите внимание, что если вы очистите файлы cookie, удалите файл cookie для отказа или измените компьютеры или веб-браузеры, вам нужно будет выполнить процедуру отказа снова.",
  "Please click below to opt in:": "Пожалуйста, нажмите ниже, чтобы включить:",
  "You are currently opted in. Click here to opt out.": "В настоящее время вы включены. Нажмите здесь, чтобы отключить.",
  "Latest update": "Последнее обновление",
  "on (date of commit)": "на (дата коммита)",
  "by (author of commit)": "от (автор коммита)",
  "Completed the Course?": "Закончили курс?",
  "You can apply for a certificate of completion, after which you will be able to:": "Вы можете подать заявку на получение сертификата о завершении, после чего сможете:",
  "add certificate to your LinkedIn profile": "добавить сертификат на свой профиль LinkedIn",
  "apply for": "подать заявку на",
  "Robonomics Ambassador Program": "Программу посла Robonomics",
  "print the certificate and hang it on the wall.": "распечатать сертификат и повесить его на стену.",
  "Apply for Certificate": "Подать заявку на сертификат",
  "Ask question on GitHub": "Задать вопрос на GitHub",
  "Get Notifications & Updates": "Получать уведомления и обновления",
  "You've come to the wrong classroom": "Вы попали не в тот класс",
  "Return to main campus": "Вернуться на главный кампус",
  "The core developers of the Robonomics project, robotics specialists and PhD research scientists offer to pass through compendious experience based on 7 years of work with web 3.0 projects.": "Основные разработчики проекта Robonomics, специалисты по робототехнике и доктора философии предлагают пройти краткий опыт на основе 7 лет работы с проектами веб 3.0.",
  "What can you discover for yourself in the academy?": "Что вы можете открыть для себя в академии?",
  "Web3 Advanced Applications": "Веб3 Продвинутые приложения",
  "Find out how cutting-edge web3 technologies can be integrated into personal, city, or corporate settings on examples with practical uses in real-life scenarios.": "Узнайте, как передовые технологии веб3 могут быть интегрированы в личные, городские или корпоративные среды на примерах с практическим использованием в реальных сценариях.",
  "Focus on decentralized IoT strategies that provide greater safety and flexibility compared to their centralized counterparts.": "Сосредоточьтесь на децнтрализованных стратегиях Интернета вещей, обеспечивающих большую безопасность и гибкость по сравнению с их централизованными аналогами.",
  "Study new robotics frameworks and SDKs and apply them to your projects.": "Изучите новые фреймворки и SDK робототехники и примените их в своих проектах.",
  "Peep insights how Norbert Wiener's principles of cybernetics are applied to modern autonomous systems.": "Посмотрите, как принципы кибернетики Норберта Винера применяются к современным автономным системам.",
  "Discover new mechanisms of techno-economic communication between machines and humans.": "Откройте новые механизмы техно-экономического взаимодействия между машинами и людьми.",
  "Learn how to work with single board computers, sensors, smart devices and complex robots.": "Узнайте, как работать с одноплатными компьютерами, датчиками, умными устройствами и сложными роботами.",
  "Robonomics is a secure, serverless and futuristic IoT platform that connects users and smart devices. It enables the exchange of technical and economic information in the form of atomic transactions between user applications, IoT services, and complex robotics.": "Robonomics - это безопасная, безсерверная и футуристическая платформа Интернета вещей, которая соединяет пользователей и умные устройства. Он позволяет обмениваться технической и экономической информацией в виде атомных транзаций между пользовательскими приложениями, службами Интернета вещей и сложными роботами.",
  "Learn more on Robonomics website": "Узнайте больше на веб-сайте Robonomics",
  "Learn and practice web3": "Учиться и практиковаться в веб3",
  "Discover our expanding selection of hands-on exercises, tutorials, and online courses for free. The core developers and researchers at Robonomics invite you to enter the world of web3 and gain practical and theoretical skills through quizzes, device simulations, and even real-life setups using Robonomics Parachain (Polkadot), IPFS, and other web3 tools.": "Откройте для себя нашу расширяющуюся подборку практических упражнений, учебных пособий и онлайн-курсов бесплатно. Основные разработчики и исследователи Robonomics приглашают вас в мир веб3 и приобрести практические и теоретические навыки через викторины, симуляции устройств и даже реальные настройки с использованием Robonomics Parachain (Polkadot), IPFS и других инструментов веб3.",
  "No courses were found with such filters.": "Курсы с такими фильтрами не найдены.",
  "Try again": "Попробуйте еще раз",
  "This Policy describes the information we collect from you, how we use that information and our legal basis for doing so. It also covers whether and how that information may be shared and your rights and choices regarding the information you provide to us.": "Эта политика описывает информацию, которую мы собираем у вас, как мы используем эту информацию и наше законное основание для этого. Она также описывает, може ли и как эта информация быть передана и ваши права и выбор в отношении предоставленной вами информации.",
  "Where are those annoying cookie consent pop-ups?": "Где те раздражающие всплывающие окна с согласием на файлы cookie?",
  "We don't need cookie consent is needed because:": "Нам не нужно согласие на файлы cookie, потому что:",
  "Tracking cookies are not used": "Отслеживающие файлы cookie не используются",
  "The data is not used for any other purpose than analytics": "Данные не используются для других целей, кроме аналитики",
  "Visitors aren’t tracked across websites": "Посетители не отслеживаются на различных веб-сайтах",
  "A user cannot be tracked across days within the same website": "Пользователь не может быть отслежен на протяжении нескольких дней на одном и том же веб-сайте",
  "What We Collect and Receive": "Что мы собираем и получаем",
  "In order for us to provide you the best possible experience on our websites, we need to collect and process certain information. Depending on your use of the Services, that may include:": "Для того чтобы обеспечить вам лучший опыт на наших веб-сайтах, нам необходимо собирать и обрабатывать определенную информацию. В зависимости от вашего использования Сервисов, это может включать в себя:",
  "Contact us via email": "Свяжитесь с нами по электронной почте",
  "for example, when you submit our forms, send us questions or comments, or report a problem, we will collect your name, email address, message, etc. We use this data solely in connection with answering the queries we receive.": "например, когда вы отправляете наши формы, отправляете нам вопросы или комментарии или сообщаете о проблеме, мы соберем ваше имя, адрес электронной почты, сообщение и т. д. Мы используем эти данные исключительно в связи с ответом на запросы, которые мы получаем.",
  "Usage data": "Данные использования",
  "other": "другие",
  "non-personal data. We process this usage data only on our server, not passing it to third-parties with": "неперсональные данные. Мы обрабатываем эти данные использования только на нашем сервере, не передавая их третьим лицам с",
  "Matomo": "Matomo",
  "web analytics platform that gives us 100% data ownership. This analytics helps us to improve user experience with our website and to recognize and stop any misuse.": "платформа веб-аналитики, которая дает нам 100% владение данными. Эта аналитика помогает нам улучшить пользовательский опыт на нашем веб-сайте и распознать и остановить любое злоупотребление.",
  "Non-personalized cookies": "Неперсонализированные файлы cookie",
  "we use non-tracking cookies (small data files transferred onto computers or devices by sites) for record-keeping purposes and to enhance functionality on our website. You may deactivate or restrict the transmission of these cookies by changing the settings of your web browser or by opt-out on this page in the form below. Cookies that are already stored may be deleted at any time.": "Мы используем неотслеживаемые файлы cookie (небольшие файлы данных, передаваемые на компьютеры или устройства сайтами) для ведения записей и улучшения функциональности нашего веб-сайта. Вы можете деактивировать или ограничить передачу этих файлов cookie, изменив настройки вашего веб-браузера или отказавшись от них на этой странице в форме ниже. Файлы cookie, которые уже хранятся, могут быть удалены в любое время.",
  "Opt-out of website tracking": "Отказ от отслеживания на веб-сайте",
  "You can opt out of being tracked by our Matomo Analytics instance below:": "Вы можете отказаться от отслеживания нашим экземпляром аналитики Matomo ниже:",
  "Your Rights": "Ваши права",
  "You have the right to be informed of Personal Data processed by Matomo, a right to rectification/correction, erasure and restriction of processing. You also have the right to ask from us a structured, common and machine-readable format of Personal Data you provided to us.": "У вас есть право быть информированным о персональных данных, обрабатываемых Matomo, право на исправление/коррекцию, удаление и ограничение обработки. У вас также есть право запросить у нас структурированный, общий и машинно-читаемый формат персональных данных, предоставленных вами.",
  "We can only identify you via your email address and we can only adhere to your request and provide information if we have Personal Data about you through you having made contact with us directly and/or you using our site and/or service. We cannot provide, rectify or delete any data that we store on behalf of our users or customers.": "Мы можем идентифицировать вас только по вашему адресу электронной почты и можем выполнить ваш запрос и предоставить информацию только в случае наличия у нас персональных данных о вас через ваш прямой контакт с нами и/или использование нашего сайта и/или услуги. Мы не можем предоставить, исправить или удалить какие-либо данные, которые мы храним от имени наших пользователей или клиентов.",
  "To exercise any of the rights mentioned in this Privacy Policy and/or in the event of questions or comments relating to the use of Personal Data you may contact us.": "Для осуществления любых из упомянутых прав в настоящей Политике конфиденциальности и/или в случае возникновения вопросов или комментариев, касающихся использования персональных данных, вы можете связаться с нами.",
  "In addition, you have the right to lodge a complaint with the data protection authority in your jurisdiction.": "Кроме того, у вас есть право подать жалобу в орган по защите данных в вашей юрисдикции.",
  "Retention of data": "Сохранение данных",
  "We will retain your information as long as necessary to provide you with the services or as otherwise set forth in this Policy. We will also retain and use this information as necessary for the purposes set out in this Policy and to the extent necessary to comply with our legal obligations, resolve disputes, enforce our agreements and protect Robonomics Academy legal rights.": "Мы будем хранить вашу информацию так долго, как это необходимо для предоставления вам услуг или как это установлено в настоящей Политике. Мы также будем хранить и использовать эту информацию по мере необходимости для целей, установленных в настоящей Политике, и в той степени, в которой это необходимо для соблюдения наших юридических обязательств, разрешения споров, обеспечения исполнения наших соглашений и защиты прав Robonomics Academy.",
  "We also collect and maintain aggregated, anonymized or pseudonymized information which we may retain indefinitely to protect the safety and security of our Site, improve our Services or comply with legal obligations.": "Мы также собираем и поддерживаем агрегированную, анонимизированную или псевдонимизированную информацию, которую мы можем хранить бессрочно для защиты безопасности и надежности нашего сайта, улучшения наших услуг или соблюдения юридических обязательств.",
  "This page has moved to a": "Эта страница была перемещена на",
  "Automatic redirecting": "Автоматическое перенаправление",
  "when you visit our website, we will store: the URL from which you visited us from, web pages of our website you visit, the date and duration of your visit, your anonymized IP address, the device specifications (device type, operating system, screen resolution, language, country you are located in, and web browser type) you used during your visit, and": "когда вы посещаете наш веб-сайт, мы будем хранить: URL, с которого вы к нам обратились, веб-страницы нашего веб-сайта, которые вы посещаете, дату и продолжительность вашего визита, ваш анонимизированный IP-адрес, характеристики устройства (тип устройства, операционная система, разрешение экрана, язык, страна, в которой вы находитесь, и тип веб-браузера), который вы использовали во время вашего визита, и",
  "Sending your request": "Отправка вашего запроса",
  "You are in the list": "Вы в списке",
  "By submitting this form you agree to receive emails with notifications and updates from the Robonomics Network team": "Отправляя эту форму, вы соглашаетесь получать электронные письма с уведомлениями и обновлениями от команды Robonomics Network",
  "Strategies for IoT Decentralization": "Стратегии децентрализации IoT",
  "Latest Robotics Tools": "Последние инструменты робототехники",
  "Modern Cybernetics": "Современная кибернетика",
  "Economic Processes for Robots": "Экономические процессы для роботов",
  "Engineering Skills": "Инженерные навыки",
  "Your email": "Ваш электронный адрес",
  "Submit": "Отправить",
  "course": "курс",
  "guide": "руководство",
  "launch simulation": "запуск симуляции",
  "real-life setup": "настройка в реальной жизни",
  "Introduction to the ideas of Robonomics": "Введение в идеи Robonomics",
  "Broadcasting Through the Black Mirror": "Трансляция через Черное Зеркало",
  "At the Intersection of Cybernetics and Economics": "На пересечении кибернетики и экономики",
  "Polkadot Ecosystem for Home IoT Infrastructure": "Экосистема Polkadot для домашней Интернета вещей",
  "IoT Subscriptions Using Robonomics Parachain": "Интернет вещей с использованием Robonomics Parachain",
  "Sovereign Smart Home with Robonomics and Home Assistant": "Суверенный умный дом с Robonomics и Home Assistant",
  "Raspberry Pi Setup": "Настройка Raspberry Pi",
  "MQTT Broker Setup and Home Assistant Init": "Настройка MQTT брокера и инициализация Home Assistant",
  "Gateway Setup: Zigbee2MQTT": "Настройка шлюза: Zigbee2MQTT",
  "Gateway Setup: Robonomics SLS Gateway": "Настройка шлюза: Robonomics SLS Gateway",
  "Robonomics IoT Subscription Setup": "Настройка подписки на Интернет вещей Robonomics",
  "Robonomics Integration Setup": "Настройка интеграции Robonomics",
  "Sensors Connectivity & Decentralized Sensors Network": "Подключение датчиков и децентрализованная сеть датчиков",
  "Sensor Hardware": "Аппаратное обеспечение датчиков",
  "Setting up and connecting sensors": "Настройка и подключение датчиков",
  "Sensors connectivity module": "Модуль подключения датчиков",
  "Sensors connectivity config options": "Параметры конфигурации подключения датчиков",
  "Sensor map deployment": "Развертывание карты датчиков",
  "Robonomics sensors measure analytics and archive mode": "Аналитика и архивный режим измерения датчиков Robonomics",
  "Connect Mars Curiosity Rover": "Подключение к роверу Mars Curiosity",
  "Connect ROS-compatible drone": "Подключение к дрону, совместимому с ROS",
  "Connect Kuka manipulator": "Подключение манипулятора Kuka",
  "Connect unmanned aerial vehicle": "Подключение беспилотного воздушного судна",
  "Control Baxter robot": "Управление роботом Baxter",
  "ROS-based projects for smart spaces": "Проекты на основе ROS для умных пространств",
  "Operate Boston Dynamics Spot": "Управление роботом Boston Dynamics Spot",
  "Quickstart Your Bachelor's Thesis with AI-powered Tools": "Быстрый старт вашего бакалаврского диплома с помощью инструментов на основе ИИ",
  "Introduction": "Введение",
  "Literature Review": "Обзор литературы",
  "Methods": "Методы",
  "Conclusion": "Заключение",
  "OpenGov for managing the IoT infrastructure": "OpenGov для управления инфраструктурой Интернета вещей",
  "The Shadow of AdCorp's Intrusion": "Тень вторжения AdCorp",
  "Introduction to open source solution for private smart homes": "Введение в открытое решение для частных умных домов",
  "New Home, New Habits": "Новый дом, новые привычки",
  "Assembling Smart Home Board": "Сборка умной домашней платы",
  "Unleash Automation Potential": "Раскрытие потенциала автоматизации",
  "Escape from Black Mirror": "Побег из Черного Зеркаа",
  "The story of a girl named Trinity": "История девушки по имени Тринити",
  "Fake Housewife & AI research Smart Home Solution": "Фальшивая домохозяйка и исследование ИИ умного дома",
  "Meet Fake Housewife Zoe and her story": "Встреча с фальшивой домохозяйкой Зои и ее история",
  "Risks of standard Smart Home solutions and the Home Assistant": "Риски стандартных решений для умного дома и Home Assistant",
  "Blockchain-based Smart home solutions": "Решения для умного дома на основе блокчейна",
  "Home Assistant + blockchain+Web3": "Home Assistant + блокчейн + Web3",
  "Studying the Sovereign smart home course at the academy and WIKI instructions": "Изучение курса Суверенного умного дома в академии и инструкции WIKI",
  "Fake Housewife & AI is researching devices to install": "Фальшивая домохозяйка и исследует устройства для установки",
  "Fake Housewife & AI is installing a Smart Home Robonomics": "Фальшивая домохозяйка и устанавливает умный дом Robonomics",
  "AI scenario of the Relax zone for the Fake Housewife": "Сценарий ИИ для зоны отдыха для фальшивой домохозяйки",
  "Software Developing for Boston Dynamics Spot": "Разработка программного обеспечения для робота Boston Dynamics Spot",
  "Emergency Stop, Initialization, Body Position Control": "Экстренная остановка, инициализация, управление положением тела",
  "Getting Used to Feecc": "Привыкание к Feecc",
  "Architecture": "Архитектура",
  "Overview": "Обзор",
  "Demo of Feecc": "Демонстрация Feecc",
  "Deployment of Engineer Workbench": "Развертывание инженерного стола",
  "Deployment of Analytics": "Равертывание аналитики",
  "World computer in your home": "Мировой компьютер у вас дома",
  "Part 1: The Idea of a World Computer": "Часть 1: Идея мирового компьютера",
  "Part 2: The Heart of the World Computer": "Часть 2: Сердце мирового компьютера",
  "Part 3: Emergence of the World Computer": "Часть 3: Возникновение мирового компьютера",
  "Part 4: The Path of a New Block of Information in the World Computer": "Часть 4: Путь нового блока информации в мировом компьютере",
  "Ivan Berman": "Иван Берман",
  "Leemo": "Лимо",
  "Vadim Manaenko": "Вадим Манаенко",
  "Sergei Lonshakov": "Сергей Лоншаков",
  "Anna Wimmer-Savinova": "Анна Виммер-Савинова",
  "Pavel Tarasov": "Павел Тарасов",
  "Alexander Smekhnov": "Александр Смехнов",
  "Filter": "Фильтр",
  "Note: you need to pass all lessons from course with one Polkadot.js account to apply for certificate": "Примечане: для получения сертификата необходимо пройти все уроки курса с одним аккаунтом Polkadot.js",
  "Robonomics School 2024 / IoT is More Dangerous Than AI": "Robonomics School 2024 / Интернет вещей опаснее искусственного интеллекта"
}