{
  "404": "404",
  "Welcome to Our Online School!": "Добро пожаловать в нашу онлайн школу!",
  "What is Robonomics?": "Что такое Робономика?",
  "User Dapp": "Пользователь (D)app",
  "Function Request": "Запрос функции",
  "Report": "Отчет",
  "Digital Twin": "Цифровой двойник",
  "Control": "Контроль",
  "Log": "Лог",
  "IoT Device": "IoT-устройство",
  "Complexity:": "Сложность:",
  "Tags:": "Теги:",
  "Authors:": "Авторы:",
  "Apply": "Применить",
  "Clear all": "Очистить все",
  "Spring school 2023": "Весенняя школа 2023",
  "ROS": "ROS",
  "Raspberry Pi": "Raspberry Pi",
  "ai": "ai",
  "Spot": "Spot",
  "Multi-Agent Systems": "Мультиагентные системы",
  "Industrial": "Промышленность",
  "World computer": "Мировой компьютер",
  "Privacy Policy": "Политика конфиденциальности",
  "Learn": "Учиться",
  "Robonomics website": "Веб-сайт Robonomics",
  "Tell us more": "Расскажите нам больше",
  "Thanks": "Спасибо",
  "we’ll keep in touch": "мы будем на связи",
  "Results": "Результаты",
  "Previous Lesson": "Предыдущий урок",
  "Previous Page": "Предыдущая страница",
  "Next Lesson": "Следующий урок",
  "Next Page": "Следующая страница",
  "You are currently opted out. Click here to opt in": "В настоящее время вы отказались. Нажмите здесь, чтобы снова включить",
  "You may choose not to have a unique web analytics cookie identification number assigned to your computer to avoid the aggregation and analysis of data collected on this website.": "Вы можете отказаться от присвоения уникального идентификационного номера веб-аналитики вашему компьютеру, чтобы изежать агрегации и анализа данных, собранных на этом веб-сайте.",
  "To make that choice, please click below to receive an opt-out cookie": "Чтобы сделать выбор, пожалуйста, нажмите ниже, чтобы получить файл cookie для отказа",
  "You are currently opted out. Click here to opt in.": "В настоящее время вы отказались. Нажмите здесь, чтобы снова включить.",
  "Opt-out complete; your visits to this website will not be recorded by the Web Analytics tool. Note that if you clear your cookies, delete the opt-out cookie, or if you change computers or Web browsers, you will need to perform the opt-out procedure again.": "Отказ завершен; ваши посещения этого веб-сайта не будут записаны с помощью инструмента веб-аналитики. Обратите внимание, что если вы очистите файлы cookie, удалите файл cookie для отказа или измените компьютеры или веб-браузеры, вам нужно будет выполнить процедуру отказа снова.",
  "Please click below to opt in:": "Пожалуйста, нажмите ниже, чтобы включить:",
  "You are currently opted in. Click here to opt out.": "В настоящее время вы включены. Нажмите здесь, чтобы отключить.",
  "Latest update": "Последнее обновление",
  "on (date of commit)": "на (дата коммита)",
  "by (author of commit)": "от (автор коммита)",
  "Completed the Course?": "Закончили курс?",
  "You can apply for a certificate of completion, after which you will be able to:": "Вы можете подать заявку на получение сертификата о завершении, после чего сможете:",
  "add certificate to your LinkedIn profile": "добавить сертификат на свой профиль LinkedIn",
  "apply for": "подать заявку на",
  "Robonomics Ambassador Program": "Программу посла Robonomics",
  "print the certificate and hang it on the wall.": "распечатать сертификат и повесить его на стену.",
  "Apply for Certificate": "Подать заявку на сертификат",
  "Ask question on GitHub": "Задать вопрос на GitHub",
  "Get Notifications & Updates": "Получать уведомления и обновления",
  "You've come to the wrong classroom": "Вы попали не в тот класс",
  "Return to main campus": "Вернуться на главный кампус",
  "The core developers of the Robonomics project, robotics specialists and PhD research scientists offer to pass through compendious experience based on 7 years of work with web 3.0 projects.": "Основные разработчики проекта Robonomics, специалисты по робототехнике и доктора философии предлагают пройти краткий опыт на основе 7 лет работы с проектами веб 3.0.",
  "What can you discover for yourself in the academy?": "Что вы можете открыть для себя в академии?",
  "Web3 Advanced Applications": "Веб3 Продвинутые приложения",
  "Find out how cutting-edge web3 technologies can be integrated into personal, city, or corporate settings on examples with practical uses in real-life scenarios.": "Узнайте, как передовые технологии веб3 могут быть интегрированы в личные, городские или корпоративные среды на примерах с практическим использованием в реальных сценариях.",
  "Focus on decentralized IoT strategies that provide greater safety and flexibility compared to their centralized counterparts.": "Сосредоточьтесь на децнтрализованных стратегиях Интернета вещей, обеспечивающих большую безопасность и гибкость по сравнению с их централизованными аналогами.",
  "Study new robotics frameworks and SDKs and apply them to your projects.": "Изучите новые фреймворки и SDK робототехники и примените их в своих проектах.",
  "Peep insights how Norbert Wiener's principles of cybernetics are applied to modern autonomous systems.": "Посмотрите, как принципы кибернетики Норберта Винера применяются к современным автономным системам.",
  "Discover new mechanisms of techno-economic communication between machines and humans.": "Откройте новые механизмы техно-экономического взаимодействия между машинами и людьми.",
  "Learn how to work with single board computers, sensors, smart devices and complex robots.": "Узнайте, как работать с одноплатными компьютерами, датчиками, умными устройствами и сложными роботами.",
  "Robonomics is a secure, serverless and futuristic IoT platform that connects users and smart devices. It enables the exchange of technical and economic information in the form of atomic transactions between user applications, IoT services, and complex robotics.": "Robonomics - это безопасная, безсерверная и футуристическая платформа Интернета вещей, которая соединяет пользователей и умные устройства. Он позволяет обмениваться технической и экономической информацией в виде атомных транзаций между пользовательскими приложениями, службами Интернета вещей и сложными роботами.",
  "Learn more on Robonomics website": "Узнайте больше на веб-сайте Robonomics",
  "Learn and practice web3": "Учиться и практиковаться в веб3",
  "Discover our expanding selection of hands-on exercises, tutorials, and online courses for free. The core developers and researchers at Robonomics invite you to enter the world of web3 and gain practical and theoretical skills through quizzes, device simulations, and even real-life setups using Robonomics Parachain (Polkadot), IPFS, and other web3 tools.": "Откройте для себя нашу расширяющуюся подборку практических упражнений, учебных пособий и онлайн-курсов бесплатно. Основные разработчики и исследователи Robonomics приглашают вас в мир веб3 и приобрести практические и теоретические навыки через викторины, симуляции устройств и даже реальные настройки с использованием Robonomics Parachain (Polkadot), IPFS и других инструментов веб3.",
  "No courses were found with such filters.": "Курсы с такими фильтрами не найдены.",
  "Try again": "Попробуйте еще раз",
  "This page has moved to a": "Эта страница была перемещена на",
  "Automatic redirecting": "Автоматическое перенаправление",
  "Strategies for IoT Decentralization": "Стратегии децентрализации IoT",
  "Latest Robotics Tools": "Последние инструменты робототехники",
  "Modern Cybernetics": "Современная кибернетика",
  "Economic Processes for Robots": "Экономические процессы для роботов",
  "Engineering Skills": "Инженерные навыки",
  "Your email": "Ваш электронный адрес",
  "course": "курс",
  "guide": "руководство",
  "launch simulation": "запуск симуляции",
  "real-life setup": "настройка в реальной жизни",
  "Introduction to the ideas of Robonomics": "Введение в идеи Robonomics",
  "Broadcasting Through the Black Mirror": "Трансляция через Черное Зеркало",
  "At the Intersection of Cybernetics and Economics": "На пересечении кибернетики и экономики",
  "Polkadot Ecosystem for Home IoT Infrastructure": "Экосистема Polkadot для домашней Интернета вещей",
  "IoT Subscriptions Using Robonomics Parachain": "Интернет вещей с использованием Robonomics Parachain",
  "Sovereign Smart Home with Robonomics and Home Assistant": "Суверенный умный дом с Robonomics и Home Assistant",
  "Raspberry Pi Setup": "Настройка Raspberry Pi",
  "MQTT Broker Setup and Home Assistant Init": "Настройка MQTT брокера и инициализация Home Assistant",
  "Gateway Setup: Zigbee2MQTT": "Настройка шлюза: Zigbee2MQTT",
  "Gateway Setup: Robonomics SLS Gateway": "Настройка шлюза: Robonomics SLS Gateway",
  "Robonomics IoT Subscription Setup": "Настройка подписки на Интернет вещей Robonomics",
  "Robonomics Integration Setup": "Настройка интеграции Robonomics",
  "Sensors Connectivity & Decentralized Sensors Network": "Подключение датчиков и децентрализованная сеть датчиков",
  "Sensor Hardware": "Аппаратное обеспечение датчиков",
  "Setting up and connecting sensors": "Настройка и подключение датчиков",
  "Sensors connectivity module": "Модуль подключения датчиков",
  "Sensors connectivity config options": "Параметры конфигурации подключения датчиков",
  "Sensor map deployment": "Развертывание карты датчиков",
  "Robonomics sensors measure analytics and archive mode": "Аналитика и архивный режим измерения датчиков Robonomics",
  "Connect Mars Curiosity Rover": "Подключение к роверу Mars Curiosity",
  "Connect ROS-compatible drone": "Подключение к дрону, совместимому с ROS",
  "Connect Kuka manipulator": "Подключение манипулятора Kuka",
  "Connect unmanned aerial vehicle": "Подключение беспилотного воздушного судна",
  "Control Baxter robot": "Управление роботом Baxter",
  "ROS-based projects for smart spaces": "Проекты на основе ROS для умных пространств",
  "Operate Boston Dynamics Spot": "Управление роботом Boston Dynamics Spot",
  "Quickstart Your Bachelor's Thesis with AI-powered Tools": "Быстрый старт вашего бакалаврского диплома с помощью инструментов на основе ИИ",
  "Introduction": "Введение",
  "Literature Review": "Обзор литературы",
  "Methods": "Методы",
  "Conclusion": "Заключение",
  "OpenGov for managing the IoT infrastructure": "OpenGov для управления инфраструктурой Интернета вещей",
  "The Shadow of AdCorp's Intrusion": "Тень вторжения AdCorp",
  "Introduction to open source solution for private smart homes": "Введение в открытое решение для частных умных домов",
  "New Home, New Habits": "Новый дом, новые привычки",
  "Assembling Smart Home Board": "Сборка умной домашней платы",
  "Unleash Automation Potential": "Раскрытие потенциала автоматизации",
  "Escape from Black Mirror": "Побег из Черного Зеркала",
  "The story of a girl named Trinity": "История девушки по имени Тринити",
  "Fake Housewife & AI research Smart Home Solution": "Фальшивая домохозяйка и исследование ИИ умного дома",
  "Meet Fake Housewife Zoe and her story": "Встреча с фальшивой домохозяйкой Зои и ее история",
  "Risks of standard Smart Home solutions and the Home Assistant": "Риски стандартных решений для умного дома и Home Assistant",
  "Blockchain-based Smart home solutions": "Решения для умного дома на основе блокчейна",
  "Home Assistant + blockchain+Web3": "Home Assistant + блокчейн + Web3",
  "Studying the Sovereign smart home course at the academy and WIKI instructions": "Изучение курса Суверенного умного дома в академии и инструкции WIKI",
  "Fake Housewife & AI is researching devices to install": "Фальшивая домохозяйка и исследует устройства для установки",
  "Fake Housewife & AI is installing a Smart Home Robonomics": "Фальшивая домохозяйка и устанавливает умный дом Robonomics",
  "AI scenario of the Relax zone for the Fake Housewife": "Сценарий ИИ для зоны отдыха для фальшивой домохозяйки",
  "Software Developing for Boston Dynamics Spot": "Разработка программного обеспечения для робота Boston Dynamics Spot",
  "Emergency Stop, Initialization, Body Position Control": "Экстренная остановка, инициализация, управление положением тела",
  "Getting Used to Feecc": "Привыкание к Feecc",
  "Architecture": "Архитектура",
  "Overview": "Обзор",
  "Demo of Feecc": "Демонстрация Feecc",
  "Deployment of Engineer Workbench": "Развертывание инженерного стола",
  "Deployment of Analytics": "Равертывание аналитики",
  "World computer in your home": "Мировой компьютер у вас дома",
  "Part 1: The Idea of a World Computer": "Часть 1: Идея мирового компьютера",
  "Part 2: The Heart of the World Computer": "Часть 2: Сердце мирового компьютера",
  "Part 3: Emergence of the World Computer": "Часть 3: Возникновение мирового компьютера",
  "Part 4: The Path of a New Block of Information in the World Computer": "Часть 4: Путь нового блока информации в мировом компьютере",
  "Ivan Berman": "Иван Берман",
  "Leemo": "Лимо",
  "Vadim Manaenko": "Вадим Манаенко",
  "Sergei Lonshakov": "Сергей Лоншаков",
  "Anna Wimmer-Savinova": "Анна Виммер-Савинова",
  "Pavel Tarasov": "Павел Тарасов",
  "Alexander Smekhnov": "Александр Смехнов",
  "Filter": "Фильтр",
  "Note: you need to pass all lessons from course with one Polkadot.js account to apply for certificate": "Примечане: для получения сертификата необходимо пройти все уроки курса с одним аккаунтом Polkadot.js",
  "Robonomics School 2024 / IoT is More Dangerous Than AI": "Robonomics School 2024 / Интернет вещей опаснее искусственного интеллекта",
  "Robonomics School 2024 / Privacy Insights for Smart Homes": "Robonomics School 2024 / Конфиденциальность в умных домах",
  "Robonomics School 2024 / Cyprus Relocant Manual: Smart Home": "Robonomics School 2024 / Руководство по переезду на Кипр: Умный дом",
  "ROS 2": "ROS 2",
  "Essentials": "Essentials",
  "Smart Home": "Smart Home",
  "Robotics": "Robotics",
  "Sensor Network": "Sensor Network",
  "School 2024": "School 2024",
  "By clicking on the button “Submit” you agree to receive regular emails from Robonomics (no more than 1 per month) and you agree with": "Нажимая кнопку «Отправить», вы соглашаетесь получать регулярные электронные письма от Robonomics (не более 1 в месяц) и соглашаетесь с",
  "Last updated: February 05, 2025": "Последнее обновление: 5 февраля 2025 года",
  "This Privacy Policy describes Our policies and procedures on the collection, use and disclosure of Your information when You use the Service and tells You about Your privacy rights and how the law protects You.": "Настоящая Политика конфиденциальности описывает наши политики и процедуры по сбору, использованию и раскрытию вашей информации при использовании Сервиса и информирует вас о ваших правах на конфиденциальность и о том, как закон защищает вас.",
  "We use Your Personal data to provide and improve the Service. By using the Service, You agree to the collection and use of information in accordance with this Privacy Policy.": "Мы используем ваши персональные данные для предоставления и улучшения Сервиса. Используя Сервис, вы соглашаетесь с сбором и использованием информации в соответствии с настоящей Политикой конфиденциальности.",
  "Interpretation and Definitions": "Толкование и Определения",
  "Interpretation": "Толкование",
  "The words of which the initial letter is capitalized have meanings defined under the following conditions. The following definitions shall have the same meaning regardless of whether they appear in singular or in plural.": "Слова, первая буква которых написана с заглавной буквы, имеют значения, определенные в следующих условиях. Нижеприведенные определения имеют одно и то же значение независимо от того, появляются ли они в единственном числе или во множественном числе.",
  "Definitions": "Определения",
  "For the purposes of this Privacy Policy:": "Для целей настоящей Политики конфиденциальности:",
  "DAO": "DAO",
  "(referred to as either \"the DAO\", \"We\", \"Us\" or \"Our\" in this Agreement) refers to decentralized autonomous organization Robonomics Network, an operator for website": "(называемое также \"DAO\", \"Мы\", \"Нас\" или \"Наша\" в настоящем Соглашении) относится к децентрализованной автономной организации Robonomics Network, оператору веб-сайта",
  "(referred to as": "(называемому",
  "Website": "Веб-сайт",
  "in this Agreement). For the purpose of the GDPR, the DAO is the Data Controller.": "в настоящем Соглашении). Для целей GDPR DAO является контролером данных.",
  "Cookies": "Cookies",
  "are small files that are placed on Your computer, mobile device or any other device by a website, containing the details of Your browsing history on that website among its many uses. More detailed information on cookies and how they work can be found at:": "являются небольшими файлами, которые размещаются на вашем компьютере, мобильном устройстве или любом другом устройстве веб-сайтом и содержат сведения о вашей истории просмотров на этом веб-сайте среди многих других целей. Более подробную информацию о файлах cookie и их работе можно найти на:",
  "Country": "Страна",
  "refers to: Cyprus.": "относится к: Кипр.",
  "Data Controller": "Контролер данных",
  "for the purposes of the GDPR (General Data Protection Regulation), refers to the DAO as the legal person which alone or jointly with others determines the purposes and means of the processing of Personal Data.": "для целей GDPR (Общего регламента по защите данных), относится к DAO как юридическому лицу, которое самостоятельно или совместно с другими определяет цели и средства обработки персональных данных.",
  "Device": "Устройство",
  "means any device that can access the Service such as a computer, a cellphone or a digital tablet.": "означает любое устройство, которое может получить доступ к Сервису, такое как компьютер, мобильный телефон или цифровой планшет.",
  "GDPR": "GDPR",
  "refers to EU General Data Protection Regulation.": "относится к Общему регламенту по защите данных ЕС.",
  "Personal Data": "Персональные данные",
  "is any information that relates to an identified or identifiable individual.": "любая информация, относящаяся к идентифицированному или идентифицируемому физическому лицу.",
  "For the purposes of GDPR, Personal Data means any information relating to You such as a name, an identification number, location data, online identifier or to one or more factors specific to the physical, physiological, genetic, mental, economic, cultural or social identity.": "Для целей GDPR персональные данные означают любую информацию, относящуюся к вам, такую как имя, идентификационный номер, данные о местоположении, онлайн-идентификатор или одному или нескольким факторам, специфическим для физической, физиологической, генетической, умственной, экономической, культурной или социальной идентичности.",
  "Service": "Сервис",
  "refers to the Website": "относится к Веб-сайту",
  "Service Provider": "Поставщик услуг",
  "means any natural or legal person who processes the data on behalf of the DAO. It refers to third-party companies or individuals employed by the DAO to facilitate the Service, to provide the Service on behalf of the DAO, to perform services related to the Service or to assist the DAO in analyzing how the Service is used. For the purpose of the GDPR, Service Providers are considered Data Processors.": "означает любое физическое или юридическое лицо, которое обрабатывает данные от имени DAO. Это относится к сторонним компаниям или лицам, нанятым DAO для облегчения предоставления Сервиса, предоставления Сервиса от имени DAO, выполнения услуг, связанных с Сервисом, или помощи DAO в анализе использования Сервиса. Для целей GDPR поставщики услуг считаются обработчиками данных.",
  "Usage Data": "Данные использования",
  "refers to data collected automatically, either generated by the use of the Service or from the Service infrastructure itself (for example, the duration of a page visit).": "относится к данным, собранным автоматически, либо созданным при использовании Сервиса, либо из самой инфраструктуры Сервиса (например, продолжительность посещения страницы).",
  "You": "Вы",
  "(referred to as either \"Your\" in this Agreement) means the individual accessing or using the Service, or the DAO, or other legal entity on behalf of which such individual is accessing or using the Service, as applicable.": "(называемый также \"Ваш\" в настоящем Соглашении) означает физическое лицо, получающее доступ к Сервису или использующее его, или DAO, или другое юридическое лицо, от имени которого такое физическое лицо получает доступ к Сервису или использует его, по мере необходимости.",
  "Under GDPR, You can be referred to as the Data Subject or as the User as you are the individual using the Service.": "В соответствии с GDPR, вы можете быть названы субъектом данных или пользователем, так как вы являетесь лицом, использующим Сервис.",
  "Collecting and Using Your Personal Data": "Сбор и использование ваших персональных данных",
  "Types of Data Collected": "Типы собираемых данных",
  "While using Our Service, We may ask You to provide Us with certain personally identifiable information that can be used to contact or identify You. Personally identifiable information may include, but is not limited to:": "При использовании нашего Сервиса мы можем попросить вас предоставить нам определенную лично идентифицируемую информацию, которая может быть использована для связи с вами или идентификации вас. Лично идентифицируемая информация может включать, но не ограничивается:",
  "Email address": "Адрес электронной почты",
  "First name and last name": "Имя и фамилия",
  "Usage Data is collected automatically when using the Service.": "Данные использования собираются автоматически при использовании Сервиса.",
  "Usage Data may include information such as Your Device's Internet Protocol address (e.g. IP address), browser type, browser version, the pages of our Service that You visit, the time and date of Your visit, the time spent on those pages, unique device identifiers and other diagnostic data.": "Данные использования могут включать информацию, такую как IP-адрес вашего устройства (например, IP-адрес), тип браузера, версия браузера, страницы нашего Сервиса, которые вы посещаете, время и дата вашего посещения, время, проведенное на этих страницах, уникальные идентификаторы устройств и другие диагностические данных.",
  "When You access the Service by or through a mobile device, We may collect certain information automatically, including, but not limited to, the type of mobile device You use, Your mobile device unique ID, the IP address of Your mobile device, Your mobile operating system, the type of mobile Internet browser You use, unique device identifiers and other diagnostic data.": "Когда вы получаете доступ к Сервису через мобильное устройство, мы можем автоматически собирать определенную информацию, включая, но не ограничиваясь, типом мобильного устройства, которым вы пользуетесь, уникальным идентификатором вашего мобильного устройства, IP-адресом вашего мобильного устройства, операционной системой вашего мобильного устройства, типом мобильного браузера, который вы используете, уникальными идентификаторами устройств и другими диагностическими данными.",
  "We may also collect information that Your browser sends whenever You visit our Service or when You access the Service by or through a mobile device.": "Мы также можем собирать информацию, которую ваш браузер отправляет при каждом посещении нашего Сервиса или когда вы получаете доступ к Сервису через мобильное устройство.",
  "Cookies & Browser Storage": "Файлы cookie и хранилище браузера",
  "The Websites may use cookies. We use cookies and browser storage only for essential settings to improve your experience—not for tracking. These help remember your preferences, such as language settings or consent choices, so you don’t have to reset them each time you visit.": "Веб-сайты могут использовать файлы cookie. Мы используем файлы cookie и хранилище браузера только для основных настроек, чтобы улучшить ваш опыт, а не для отслеживания. Они помогают запоминать ваши предпочтения, такие как языковые настройки или выбор согласия, чтобы вам не приходилось сбрасывать их каждый раз при посещении.",
  "We do not use cookies for tracking or personalized advertising. You can manage or disable cookies in your browser settings, but some features may not work properly without them.": "Мы не используем файлы cookie для отслеживания или персонализированной рекламы. Вы можете управлять или отключить файлы cookie в настройках вашего браузера, но некоторые функции могут работать неправильно без них.",
  "Matomo Analytics": "Аналитика Matomo",
  "Our website may use Matomo, an open-source analytics platform, to gather insights into website usage. This includes anonymized data such as:": "Наш веб-сайт может использовать Matomo, платформу аналитики с открытым исходным кодом, чтобы получить представление об использовании веб-сайта. Сюда входят анонимизированные данные, такие как:",
  "Pages visited and navigation paths": "Посещенные страницы и пути навигации",
  "Time spent on our website": "Время, проведенное на нашем веб-сайте",
  "Whether you’re a returning or new visitor": "Являетесь ли вы постоянным или новым посетителем",
  "Your device type (desktop, mobile, etc.)": "Тип вашего устройства (настольный компьютер, мобильный телефон и т. д.)",
  "To protect your privacy, your IP address is anonymized before being stored. The data we collect is only used to improve the website and is not used for personal identification.": "Для защиты вашей конфиденциальности ваш IP-адрес анонимизируется перед сохранением. Собранные нами данные используются исключительно для улучшения веб-сайта и не используются для личной идентификации.",
  "Under Art. 6(1)(f) GDPR": "В соответствии с Art. 6(1)(f) GDPR",
  "we process this data based on our legitimate interest in enhancing our services.": "мы обрабатываем эти данные на основе нашего законного интереса в улучшении наших услуг.",
  "Opt-Out Option": "Опция отказа",
  "You can disable Matomo tracking at any time:": "Вы можете отключить отслеживание Matomo в любое время:",
  "Use of Your Personal Data": "Использование ваших персональных данных",
  "The DAO may use Personal Data for the following purposes:": "DAO может использовать персональные данные для следующих целей:",
  "To provide and maintain our Service": "Для предоставления и поддержания нашего сервиса",
  "including to monitor the usage of our Service.": "включая мониторинг использования нашего сервиса.",
  "For the performance of a contract": "Для исполнения контракта",
  "the development, compliance and undertaking of the purchase contract for the products, items or services You have purchased or of any other contract with Us through the Service.": "разработки, соблюдения и выполнения договора купли-продажи продуктов, товаров или услуг, которые вы приобрели или любого другого договора с нами через сервис.",
  "To contact You": "Для связи с вами",
  "To contact You by email, telephone calls, SMS, or other equivalent forms of electronic communication, such as a mobile application's push notifications regarding updates or informative communications related to the functionalities, products or contracted services, including the security updates, when necessary or reasonable for their implementation.": "Для связи с вами по электронной почте, телефонными звонками, SMS или другими эквивалентными формами электронной связи, такими как push-уведомления мобильного приложения о обновлениях или информационные коммуникации, связанные с функциональностью, продуктами или заключенными услугами, включая обновления безопасности, когда это необходимо или разумно для их реализации.",
  "To provide You": "Для предоставления вам",
  "with news, special offers and general information about other goods, services and events which we offer that are similar to those that you have already purchased or enquired about unless You have opted not to receive such information.": "новостей, специальных предложений и общей информации о других товарах, услугах и мероприятиях, которые мы предлагаем и которые аналогичны тем, которые вы уже приобрели или о которых узнавали, если вы не отказались от получения такой информации.",
  "To manage Your requests": "Для обработки ваших запросов",
  "To attend and manage Your requests to Us.": "Для обработки и управления вашими запросами к нам.",
  "For other purposes": "Для других целей",
  "We may use Your information for other purposes, such as data analysis, identifying usage trends, determining the effectiveness of our promotional campaigns and to evaluate and improve our Service, products, services, marketing and your experience.": "Мы можем использовать ваши данные для других целей, таких как анализ данных, определение тенденций использования, оценка эффективности наших рекламных кампаний и оценка и улучшение нашего сервиса, продуктов, услуг, маркетинга и вашего опыта.",
  "We may share Your personal information in the following situations:": "Мы можем делиться вашей персональной информацией в следующих ситуациях:",
  "With Service Providers": "С поставщиками услуг",
  "We may share Your personal information with Service Providers to monitor and analyze the use of our Service, to contact You.": "Мы можем делиться вашей персональной информацией с поставщиками услуг для мониторинга и анализа использования нашего сервиса, для связи с вами.",
  "With Your consent": "С вашим согласием",
  "We may disclose Your personal information for any other purpose with Your consent.": "Мы можем раскрывать вашу персональную информацию для любой другой цели с вашим согласием.",
  "Retention of Your Personal Data": "Сохранение ваших персональных данных",
  "The DAO will retain Your Personal Data only for as long as is necessary for the purposes set out in this Privacy Policy. We will retain and use Your Personal Data to the extent necessary to comply with our legal obligations (for example, if we are required to retain your data to comply with applicable laws), resolve disputes, and enforce our legal agreements and policies.": "DAO будет хранить ваши персональные данные только настолько, насколько это необходимо для целей, установленных в настоящей Политике конфиденциальности. Мы будем хранить и использовать ваши персональные данные в той степени, в которой это необходимо для соблюдения наших юридических обязательств (например, если нам требуется хранить ваши данные для соблюдения применимых законов), разрешения споров и применения наших юридических соглашений и политик.",
  "The DAO will also retain Usage Data for internal analysis purposes. Usage Data is generally retained for a shorter period of time, except when this data is used to strengthen the security or to improve the functionality of Our Service, or We are legally obligated to retain this data for longer time periods.": "DAO также будет хранить данные использования для внутреннего анализа. Данные использования обычно хранятся в течение более короткого периода времени, за исключением случаев, когда эти данные используются для укрепления безопасности или улучшения функциональности нашего сервиса, или когда нам законодательно требуется хранить эти данные в течение более длительного периода времени.",
  "Security of Your Personal Data": "Безопасность ваших персональных данных",
  "The security of Your Personal Data is important to Us, but remember that no method of transmission over the Internet, or method of electronic storage is 100% secure. While We strive to use commercially acceptable means to protect Your Personal Data, We cannot guarantee its absolute security.": "Безопасность ваших персональных данных для нас важна, но помните, что ни один метод передачи данных через Интернет или метод электронного хранения не является 100% безопасным. Мы стремимся использовать коммерчески приемлемые средства для защиты ваших персональных данных, но не можем гарантировать их абсолютную безопасность.",
  "Detailed Information on the Processing of Your Personal Data": "Подробная информация о обработке ваших персональных данных",
  "Your information, including Personal Data, is processed is processed at the DAO's website service provider(s) and in any other places where the parties involved in the processing are located. It means that this information may be transferred to — and maintained on — computers located outside of Your state, province, country or other governmental jurisdiction where the data protection laws may differ than those from Your jurisdiction.": "Ваши данные, включая персональные данные, обрабатываются на веб-серверах DAO и в других местах, где находятся стороны, участвующие в обработке. Это означает, что эта информация может быть передана и хранится на компьютерах, находящихся за пределами вашего штата, провинции, страны или другой государственной юрисдикции, где законы о защите данных могут отличаться от тех, которые действуют в вашей юрисдикции.",
  "Your consent to this Privacy Policy followed by Your submission of such information represents Your agreement to that transfer.": "Ваше согласие на настоящую Политику конфиденциальности, за которым следует предоставление такой информации, означает ваше согласие на такую передачу.",
  "The DAO will take all steps reasonably necessary to ensure that Your data is treated securely and in accordance with this Privacy Policy and no transfer of Your Personal Data will take place to an organization or a country unless there are adequate controls in place including the security of Your data and other personal information.": "DAO предпримет все разумные меры, необходимые для обеспечения безопасности ваших данных и соблюдения настоящей Политики конфиденциальности, и никакой передачи ваших персональных данных не будет осуществлено в организацию или страну, если не будут приняты соответствующие меры контроля, включая обеспечение безопасности ваших данных и другой персональной информации.",
  "Please note that any data transmission on the Internet (e.g. communication by e-mail) is generally not secure and we accept no liability for data transmitted to us via the Internet. Unfortunately, absolute protection is not technically possible. This information does not apply to the Website of third parties and the corresponding links given on our Website. The DAO assumes no responsibility and liability for these.": "Обратите внимание, что любая передача данных по Интернету (например, связь по электронной почте) обычно не является безопасной, и мы не несем ответственности за данные, переданные нам через Интернет. К сожалению, абсолютная защита технически невозможна. Эта информация не распространяется на веб-сайты третьих сторон и соответствующие ссылки, предоставленные на нашем веб-сайте. DAO не несет ответственности за них.",
  "The Service Providers We use may have access to Your Personal Data. These third-party vendors collect, store, use, process and transfer information about Your activity on Our Service in accordance with their Privacy Policies.": "Используемые нами поставщики услуг могут иметь доступ к вашим персональным данным. Эти сторонние поставщики собирают, хранят, используют, обрабатывают и передают информацию о вашей деятельности на нашем сервисе в соответствии с их политиками конфиденциальности.",
  "Email Marketing": "Электронный маркетинг",
  "We may use Your Personal Data to contact You with newsletters, marketing or promotional materials and other information that may be of interest to You. You may opt-out of receiving any, or all, of these communications from Us by following the unsubscribe link or instructions provided in any email We send or by contacting Us.": "Мы можем использовать ваши персональные данные, чтобы связаться с вами с помощью рассылок, маркетинговых или рекламных материалов и другой информации, которая может быть вам интересна. Вы можете отказаться от получения любых или всех этих коммуникаций от нас, следуя ссылке для отказа или инструкциям, предоставленным в любом электронном письме, которое мы отправляем, или связавшись с нами.",
  "We may use Email Marketing Service Providers to manage and send emails to You;": "Мы можем использовать поставщиков услуг по электронному маркетингу для управления и отправки вам электронных писем;",
  "Unisender": "Unisender",
  "Their Privacy Policy can be viewed at": "Их Политика конфиденциальности можно просмотреть на",
  "Usage, Performance and Miscellaneous": "Использование, производительность и разное",
  "We may use third-party Service Providers to maintain and improve our Service.": "Мы можем использовать сторонних поставщиков услуг для поддержания и улучшения нашего сервиса.",
  "hcaptcha": "hcaptcha",
  "GDPR Privacy": "GDPR Конфиденциальность",
  "Legal Basis for Processing Personal Data under GDPR": "Правовая основа обработки персональных данных в соответствии с GDPR",
  "We may process Personal Data under the following conditions:": "Мы можем обрабатывать персональные данные в следующих случаях:",
  "Consent:": "Согласие:",
  "You have given Your consent for processing Personal Data for one or more specific purposes.": "Вы дали свое согласие на обработку персональных данных для одной или нескольких конкретных целей.",
  "Performance of a contract:": "Исполнение контракта:",
  "Provision of Personal Data is necessary for the performance of an agreement with You and/or for any pre-contractual obligations thereof.": "Предоставление персональных данных необходимо для исполнения соглашения с вами и/или для выполнения каких-либо предварительных обязательств.",
  "Legal obligations:": "Правовые обязательства:",
  "Processing Personal Data is necessary for compliance with a legal obligation to which the DAO is subject.": "Обработка персональных данных необходима для соблюдения правового обязательства, которому подлежит DAO.",
  "Vital interests:": "Жизненно важные интересы:",
  "Processing Personal Data is necessary in order to protect Your vital interests or of another natural person.": "Обработка персональных данных необходима для защиты ваших жизненно важных интересов или интересов другого естественного лица.",
  "Public interests:": "Общественные интересы:",
  "Processing Personal Data is related to a task that is carried out in the public interest or in the exercise of official authority vested in the DAO.": "Обработка персональных данных связана с задачей, которая выполняется в общественном интересе или в рамках осуществления официальной власти, предоставленной DAO.",
  "Legitimate interests:": "Законные интересы:",
  "Processing Personal Data is necessary for the purposes of the legitimate interests pursued by the DAO.": "Обработка персональных данных необходима для целей законных интересов, преследуемых DAO.",
  "In any case, the DAO will gladly help to clarify the specific legal basis that applies to the processing, and in particular whether the provision of Personal Data is a statutory or contractual requirement, or a requirement necessary to enter into a contract.": "В любом случае DAO с удовольствием поможет прояснить конкретную правовую основу, применимую к обработке, и в частности, является ли предоставление персональных данных законным или контрактным требованием, или требованием, необходимым для заключения контракта.",
  "Your Rights under the GDPR": "Ваши права в соответствии с GDPR",
  "The DAO undertakes to respect the confidentiality of Your Personal Data and to guarantee You can exercise Your rights.": "DAO обязуется уважать конфиденциальность ваших персональных данных и гарантировать, что вы можете воспользоваться своими правами.",
  "You have the right under this Privacy Policy, and by law if You are within the EU, to:": "У вас есть право в соответствии с настоящей Политикой конфиденциальности и законом, если вы находитесь в ЕС, на:",
  "Request access to Your Personal Data.": "Запрос доступа к вашим персональным данным.",
  "The right to access, update or delete the information We have on You. Whenever made possible, you can access, update or request deletion of Your Personal Data directly within Your account settings section. If you are unable to perform these actions yourself, please contact Us to assist You. This also enables You to receive a copy of the Personal Data We hold about You.": "Право на доступ, обновление или удаление информации о вас. При возможности вы можете получить доступ, обновить или запросить удаление ваших персональных данных непосредственно в разделе настроек вашей учетной записи. Если вы не можете выполнить эти действий самостоятельно, пожалуйста, свяжитесь с нами, чтобы мы могли вам помочь. Это также позволяет вам получить копию ваших персональных данных, которые мы храним о вас.",
  "Request correction of the Personal Data that We hold about You.": "Запрос на исправление персональных данных, которые мы храним о вас.",
  "You have the right to have any incomplete or inaccurate information We hold about You corrected.": "У вас есть право потребовать исправления любой неполной или неточной информации, которую мы храним о вас.",
  "Object to processing of Your Personal Data.": "Возражать против обработки ваших персональных данных.",
  "This right exists where We are relying on a legitimate interest as the legal basis for Our processing and there is something about Your particular situation, which makes You want to object to our processing of Your Personal Data on this ground. You also have the right to object where We are processing Your Personal Data for direct marketing purposes.": "Это право существует, если мы полагаемся на законный интерес в качестве правовой основы для нашей обработки и есть что-то в вашей конкретной ситуации, что заставляет вас возражать против нашей обработки ваших персональных данных на этом основании. У вас также есть право возражать, если мы обрабатываем ваши персональные данные в целях прямого маркетинга.",
  "Request erasure of Your Personal Data.": "Запрос на стирание ваших персональных данных.",
  "You have the right to ask Us to delete or remove Personal Data when there is no good reason for Us to continue processing it.": "У вас есть право попросить нас удалить или убрать персональные данные, когда нет веских причин продолжать их обработку.",
  "Request the transfer of Your Personal Data.": "Запрос на передачу ваших персональных данных.",
  "We will provide to You, or to a third-party You have chosen, Your Personal Data in a structured, commonly used, machine-readable format. Please note that this right only applies to automated information which You initially provided consent for Us to use or where We used the information to perform a contract with You.": "Мы предоставим вам, или третьему лицу, которое вы выбрали, ваши персональные данные в структурированном, общепринятом, машинно-читаемом формате. Обратите внимание, что это право применяется только к автоматизированной информации, которую вы изначально предоставили нам согласие использовать или когда мы использовали информацию для заключения контракта с вами.",
  "Withdraw Your consent.": "Отозвать ваше согласие.",
  "You have the right to withdraw Your consent on using your Personal Data. If You withdraw Your consent, We may not be able to provide You with access to certain specific functionalities of the Service.": "У вас есть право отозвать ваше согласие на использование ваших персональных данных. Если вы отзовете свое согласие, мы можем не иметь возможности предоставить вам доступ к определенным конкретным функциям сервиса.",
  "Exercising of Your GDPR Data Protection Rights": "Осуществление ваших прав по защите данных GDPR",
  "You may exercise Your rights of access, rectification, cancellation and opposition by contacting Us. Please note that we may ask You to verify Your identity before responding to such requests. If You make a request, We will try our best to respond to You as soon as possible.": "Вы можете осуществить свои права на доступ, исправление, отмену и возражение, связавшись с нами. Обратите внимание, что мы можем попросить вас подтвердить вашу личность перед ответом на такие запросы. Если вы обратитесь с запросом, мы постараемся ответить вам как можно скорее.",
  "You have the right to complain to a Data Protection Authority about Our collection and use of Your Personal Data. For more information, if You are in the European Economic Area (EEA), please contact Your local data protection authority in the EEA.": "У вас есть право пожаловаться в орган по защите данных нашего сбора и использования ваших персональных данных. Для получения дополнительной информации, если вы находитесь в Европейском экономическом пространстве (ЕЭП), пожалуйста, свяжитесь с местным органом по защите данных в ЕЭП.",
  "Children's Privacy": "Конфиденциальность детей",
  "Our Service does not address anyone under the age of 13. We do not knowingly collect personally identifiable information from anyone under the age of 13. If You are a parent or guardian and You are aware that Your child has provided Us with Personal Data, please contact Us. If We become aware that We have collected Personal Data from anyone under the age of 13 without verification of parental consent, We take steps to remove that information from Our servers.": "Наш сервис не предназначен для лиц младше 13 лет. Мы не собираем намеренно идентифицируемую информацию о любом лице младше 13 лет. Если вы являетесь родителем или опекуном и знаете, что ваш ребенок предоставил нам персональные данные, пожалуйста, свяжитесь с нами. Если мы узнаем, что мы собрали персональные данные от кого-либо младше 13 лет без подтверждения согласия родителей, мы предпримем шаги по удалению этой информации с наших серверов.",
  "If We need to rely on consent as a legal basis for processing Your information and Your country requires consent from a parent, We may require Your parent's consent before We collect and use that information.": "Если нам нужно полагаться на согласие в качестве правовой основы для обработки ваших данных и ваша страна требует согласия родителя, мы можем потребовать согласия вашего родителя перед сбором и использованием этой информации.",
  "Links to Other Websites": "Ссылки на другие веб-сайты",
  "Our Service may contain links to other websites that are not operated by Us. If You click on a third party link, You will be directed to that third party's site. We strongly advise You to review the Privacy Policy of every site You visit.": "Наш сервис может содержать ссылки на другие веб-сайты, которые не управляются нами. Если вы нажмете на ссылку стороннего лица, вы будете направлены на сайт этого стороннего лица. Мы настоятельно рекомендуем вам ознакомиться с Политикой конфиденциальности каждого сайта, который вы посещаете.",
  "We have no control over and assume no responsibility for the content, privacy policies or practices of any third party sites or services.": "Мы не контролируем и не несем ответственности за содержание, политику конфиденциальности или практики любых сайтов или услуг сторонних лиц.",
  "Changes to this Privacy Policy": "Изменения в настоящей Политике конфиденциальности",
  "We may update Our Privacy Policy from time to time. We will notify You of any changes by posting the new Privacy Policy on this page.": "Мы можем время от времени обновлять нашу Политику конфиденциальности. Мы уведомим вас обо всех изменениях, разместив новую Политику конфиденциальности на этой странице.",
  "We will let You know via email and/or a prominent notice on Our Service, prior to the change becoming effective and update the \"Last updated\" date at the top of this Privacy Policy.": "Мы уведомим Вас по электронной почте и/или выдающимся уведомлением на нашем сервисе перед вступлением изменений в силу и обновим дату \"Последнее обновление\" вверху настоящей Политики конфиденциальности.",
  "You are advised to review this Privacy Policy periodically for any changes. Changes to this Privacy Policy are effective when they are posted on this page.": "Рекомендуем вам периодически просматривать настоящую Политику конфиденциальности на предмет изменений. Изменения в настоящей Политике конфиденциальности вступают в силу с момента их публикации на данной странице.",
  "Contact Us": "Свяжитесь с нами",
  "If you have any questions about this Privacy Policy, You can contact us:": "Если у вас есть вопросы по поводу настоящей Политики конфиденциальности, вы можете связаться с нами:",
  "By visiting this page on our website:": "Посетив данную страницу на нашем веб-сайте:",
  "This Agreement is originally written in English. This AI translation is provided for your reference only.": "Настоящее Соглашение написано на английском языке. Этот перевод AI предоставлен исключительно для вашего ознакомления.",
  "Demo academic apps": "Демонстрационные академические приложения",
  "Here are some demonstrational applications for academic needs. Some of them can be active, some of them not.": "Вот несколько демонстрационных приложений для академических нужд. Некоторые из них могут быть активными, а некоторые нет.",
  "Hack Johnny's lab": "Взломайте лабораторию Джонни",
  "Johny's crypto lab is a cutting-edge hub filled with all sorts of smart gadgets, including a TurtleBot 4 robot that is known as a base for an iRobot vacuum. But imagine the thrill—and the risk—if someone managed to hack into the robot's camera. Ready to dive into the world of cybersecurity and test your hacking skills? See what you can uncover!": "Криптолаборатория Джонни - это передовой центр, наполненный всевозможными умными гаджетами, включая робота TurtleBot 4, который известен как база для пылесоса iRobot. Но представьте себе волнение - и риск - если бы кому-то удалось взломать камеру робота. Готовы погрузиться в мир кибербезопасности и проверить свои навыки хакинга? Узнайте, что вы можете обнаружить!",
  "Rules of the game": "Правила игры"
}
