{
  "404": "404",
  "Welcome to Our Online School!": "Bienvenido a nuestra escuela en línea!",
  "What is Robonomics?": "¿Qué es Robonomics?",
  "User Dapp": "Aplicación de usuario",
  "Function Request": "Solicitud de función",
  "Report": "Reporte",
  "Digital Twin": "Gemelo digital",
  "Control": "Control",
  "Log": "Registro",
  "IoT Device": "Dispositivo IoT",
  "Complexity:": "Complejidad:",
  "Tags:": "Etiquetas:",
  "Authors:": "Autores:",
  "Apply": "Aplicar",
  "Clear all": "Limpiar todo",
  "Spring school 2023": "Escuela de primavera 2023",
  "ROS": "ROS",
  "Raspberry Pi": "Raspberry Pi",
  "ai": "ai",
  "Spot": "Spot",
  "Multi-Agent Systems": "Sistemas Multi-Agentes",
  "Industrial": "Industrial",
  "World computer": "Computadora mundial",
  "Privacy Policy": "Política de privacidad",
  "Learn": "Aprender",
  "Robonomics website": "Sitio web de Robonomics",
  "Tell us more": "Cuéntanos más",
  "Send": "Enviar",
  "Sending your info...": "Enviando tu información...",
  "Thanks": "Gracias",
  "we’ll keep in touch": "mantendremos contacto",
  "Results": "Resultados",
  "Previous Lesson": "Lección anterior",
  "Previous Page": "Página anterior",
  "Next Lesson": "Siguiente lección",
  "Next Page": "Página siguiente",
  "You are currently opted out. Click here to opt in": "Actualmente has optado por no participar. Haz clic aquí para participar",
  "You may choose not to have a unique web analytics cookie identification number assigned to your computer to avoid the aggregation and analysis of data collected on this website.": "Puedes elegir no tener asignado a tu computadora un número de identificación de cookie de análisis web único para evitar la recopilación y análisis de datos recopilados en este sitio web.",
  "To make that choice, please click below to receive an opt-out cookie": "Para tomar esa decisión, haz clic a continuación para recibir una cookie de exclusión",
  "You are currently opted out. Click here to opt in.": "Actualmente has optado por no participar. Haz clic aquí para participar.",
  "Opt-out complete; your visits to this website will not be recorded by the Web Analytics tool. Note that if you clear your cookies, delete the opt-out cookie, or if you change computers or Web browsers, you will need to perform the opt-out procedure again.": "Exclusión completa; tus visitas a este sitio web no serán registradas por la herramienta de análisis web. Ten en cuenta que si borras tus cookies, eliminas la cookie de exclusión, o si cambias de computadora o navegador web, deberás realizar el procedimiento de exclusión nuevamente.",
  "Please click below to opt in:": "Haz clic a continuación para participar:",
  "You are currently opted in. Click here to opt out.": "Actualmente has optado por participar. Haz clic aquí para excluirte.",
  "Latest update": "Última actualización",
  "on (date of commit)": "en (fecha de commit)",
  "by (author of commit)": "por (autor del commit)",
  "Completed the Course?": "¿Completaste el curso?",
  "You can apply for a certificate of completion, after which you will be able to:": "Puedes solicitar un certificado de finalización, después de lo cual podrás:",
  "add certificate to your LinkedIn profile": "agregar el certificado a tu perfil de LinkedIn",
  "apply for": "solicitar",
  "Robonomics Ambassador Program": "Programa de Embajadores de Robonomics",
  "print the certificate and hang it on the wall.": "imprimir el certificado y colgarlo en la pared.",
  "Apply for Certificate": "Solicitar certificado",
  "Ask question on GitHub": "Hacer una pregunta en GitHub",
  "Get Notifications & Updates": "Recibir notificaciones y actualizaciones",
  "You've come to the wrong classroom": "Te has equivocado de aula",
  "Return to main campus": "Volver al campus principal",
  "The core developers of the Robonomics project, robotics specialists and PhD research scientists offer to pass through compendious experience based on 7 years of work with web 3.0 projects.": "Los desarrolladores principales del proyecto Robonomics, especialistas en robótica e investigadores de doctorado ofrecen pasar por una experiencia compendiosa basada en 7 años de trabajo con proyectos web 3.0.",
  "What can you discover for yourself in the academy?": "¿Qué puedes descubrir por ti mismo en la academia?",
  "Web3 Advanced Applications": "Aplicaciones Avanzadas de Web3",
  "Find out how cutting-edge web3 technologies can be integrated into personal, city, or corporate settings on examples with practical uses in real-life scenarios.": "Descubre cómo las tecnologías de vanguardia de web3 pueden integrarse en entornos personales, urbanos o corporativos en ejemplos con usos prácticos en escenarios de la vida real.",
  "Focus on decentralized IoT strategies that provide greater safety and flexibility compared to their centralized counterparts.": "Enfócate en estrategias descentralizadas de IoT que proporcionan mayor seguridad y flexibilidad en comparación con sus contrapartes centralizadas.",
  "Study new robotics frameworks and SDKs and apply them to your projects.": "Estudia nuevos marcos y SDKs de robótica y aplícalos a tus proyectos.",
  "Peep insights how Norbert Wiener's principles of cybernetics are applied to modern autonomous systems.": "Observa cómo se aplican los principios de cibernética de Norbert Wiener a los sistemas autónomos modernos.",
  "Discover new mechanisms of techno-economic communication between machines and humans.": "Descubre nuevos mecanismos de comunicación tecnoeconómica entre máquinas y humanos.",
  "Learn how to work with single board computers, sensors, smart devices and complex robots.": "Aprende a trabajar con computadoras de placa única, sensores, dispositivos inteligentes y robots complejos.",
  "Robonomics is a secure, serverless and futuristic IoT platform that connects users and smart devices. It enables the exchange of technical and economic information in the form of atomic transactions between user applications, IoT services, and complex robotics.": "Robonomics es una plataforma segura, sin servidor y futurista de IoT que conecta a los usuarios y dispositivos inteligentes. Permite el intercambio de información técnica y económica en forma de transacciones atómicas entre aplicaciones de usuario, servicios de IoT y robótica compleja.",
  "Learn more on Robonomics website": "Obtén más información en el sitio web de Robonomics",
  "Learn and practice web3": "Aprende y practica web3",
  "Discover our expanding selection of hands-on exercises, tutorials, and online courses for free. The core developers and researchers at Robonomics invite you to enter the world of web3 and gain practical and theoretical skills through quizzes, device simulations, and even real-life setups using Robonomics Parachain (Polkadot), IPFS, and other web3 tools.": "Descubre nuestra creciente selección de ejercicios prácticos, tutoriales y cursos en línea de forma gratuita. Los desarrolladores principales e investigadores de Robonomics te invitan a ingresar al mundo de web3 y adquirir habilidades prácticas y teóricas a través de cuestionarios, simulaciones de dispositivos e incluso configuraciones en la vida real utilizando Robonomics Parachain (Polkadot), IPFS y otras herramientas web3.",
  "No courses were found with such filters.": "No se encontraron cursos con esos filtros.",
  "Try again": "Inténtalo de nuevo",
  "This Policy describes the information we collect from you, how we use that information and our legal basis for doing so. It also covers whether and how that information may be shared and your rights and choices regarding the information you provide to us.": "Esta Política describe la información que recopilamos de ti, cómo usamos esa información y nuestra base legal para hacerlo. También cubre si y cómo esa información puede ser compartida y tus derechos y opciones con respecto a la información que nos proporcionas.",
  "Where are those annoying cookie consent pop-ups?": "¿Dónde están esas molestas ventanas emergentes de consentimiento de cookies?",
  "We don't need cookie consent is needed because:": "No necesitamos consentimiento de cookies porque:",
  "Tracking cookies are not used": "No se utilizan cookies de seguimiento",
  "The data is not used for any other purpose than analytics": "Los datos no se utilizan para ningún otro propósito que no sea el análisis",
  "Visitors aren’t tracked across websites": "Los visitantes no son rastreados en otros sitios web",
  "A user cannot be tracked across days within the same website": "Un usuario no puede ser rastreado a lo largo de los días dentro del mismo sitio web",
  "What We Collect and Receive": "Lo que recopilamos y recibimos",
  "In order for us to provide you the best possible experience on our websites, we need to collect and process certain information. Depending on your use of the Services, that may include:": "Para poder brindarte la mejor experiencia posible en nuestros sitios web, necesitamos recopilar y procesar cierta información. Dependiendo de tu uso de los Servicios, eso puede incluir:",
  "Contact us via email": "Contáctanos por correo electrónico",
  "for example, when you submit our forms, send us questions or comments, or report a problem, we will collect your name, email address, message, etc. We use this data solely in connection with answering the queries we receive.": "por ejemplo, cuando envías nuestros formularios, nos envías preguntas o comentarios, o informas un problema, recopilaremos tu nombre, dirección de correo electrónico, mensaje, etc. Utilizamos estos datos únicamente en relación con la respuesta a las consultas que recibimos.",
  "Usage data": "Datos de uso",
  "other": "otros",
  "non-personal data. We process this usage data only on our server, not passing it to third-parties with": "datos no personales. Procesamos estos datos de uso solo en nuestro servidor, sin pasarlo a terceros con",
  "Matomo": "Matomo",
  "web analytics platform that gives us 100% data ownership. This analytics helps us to improve user experience with our website and to recognize and stop any misuse.": "plataforma de análisis web que nos brinda propiedad del 100% de los datos. Este análisis nos ayuda a mejorar la experiencia del usuario con nuestro sitio web y a reconocer y detener cualquier mal uso.",
  "Non-personalized cookies": "Cookies no personalizadas",
  "we use non-tracking cookies (small data files transferred onto computers or devices by sites) for record-keeping purposes and to enhance functionality on our website. You may deactivate or restrict the transmission of these cookies by changing the settings of your web browser or by opt-out on this page in the form below. Cookies that are already stored may be deleted at any time.": "Utilizamos cookies no rastreables (pequeños archivos de datos transferidos a computadoras o dispositivos por sitios) con fines de registro y para mejorar la funcionalidad en nuestro sitio web. Puede desactivar o restringir la transmisión de estas cookies cambiando la configuración de su navegador web o optando por no participar en esta página en el formulario a continuación. Las cookies que ya están almacenadas pueden eliminarse en cualquier momento.",
  "Opt-out of website tracking": "Optar por no seguir el rastreo del sitio web",
  "You can opt out of being tracked by our Matomo Analytics instance below:": "Puede optar por no ser rastreado por nuestra instancia de Matomo Analytics a continuación:",
  "Your Rights": "Tus derechos",
  "You have the right to be informed of Personal Data processed by Matomo, a right to rectification/correction, erasure and restriction of processing. You also have the right to ask from us a structured, common and machine-readable format of Personal Data you provided to us.": "Tienes derecho a ser informado sobre los Datos Personales procesados por Matomo, derecho a rectificación/corrección, eliminación y restricción del procesamiento. También tienes derecho a solicitarnos un formato estructurado, común y legible por máquina de los Datos Personales que nos proporcionaste.",
  "We can only identify you via your email address and we can only adhere to your request and provide information if we have Personal Data about you through you having made contact with us directly and/or you using our site and/or service. We cannot provide, rectify or delete any data that we store on behalf of our users or customers.": "Solo podemos identificarte a través de tu dirección de correo electrónico y solo podemos cumplir con tu solicitud y proporcionar información si tenemos Datos Personales sobre ti a través de que te hayas puesto en contacto con nosotros directamente y/o hayas utilizado nuestro sitio y/o servicio. No podemos proporcionar, rectificar o eliminar ningún dato que almacenemos en nombre de nuestros usuarios o clientes.",
  "To exercise any of the rights mentioned in this Privacy Policy and/or in the event of questions or comments relating to the use of Personal Data you may contact us.": "Para ejercer cualquiera de los derechos mencionados en esta Política de Privacidad y/o en caso de preguntas o comentarios relacionados con el uso de Datos Personales, puedes contactarnos.",
  "In addition, you have the right to lodge a complaint with the data protection authority in your jurisdiction.": "Además, tienes derecho a presentar una queja ante la autoridad de protección de datos en tu jurisdicción.",
  "Retention of data": "Retención de datos",
  "We will retain your information as long as necessary to provide you with the services or as otherwise set forth in this Policy. We will also retain and use this information as necessary for the purposes set out in this Policy and to the extent necessary to comply with our legal obligations, resolve disputes, enforce our agreements and protect Robonomics Academy legal rights.": "Mantendremos tu información mientras sea necesario para proporcionarte los servicios o según se establezca en esta Política. También conservaremos y utilizaremos esta información según sea necesario para los fines establecidos en esta Política y en la medida necesaria para cumplir con nuestras obligaciones legales, resolver disputas, hacer cumplir nuestros acuerdos y proteger los derechos legales de Robonomics Academy.",
  "We also collect and maintain aggregated, anonymized or pseudonymized information which we may retain indefinitely to protect the safety and security of our Site, improve our Services or comply with legal obligations.": "También recopilamos y mantenemos información agregada, anonimizada o seudonimizada que podemos conservar indefinidamente para proteger la seguridad de nuestro sitio, mejorar nuestros servicios o cumplir con obligaciones legales.",
  "This page has moved to a": "Esta página se ha trasladado a una",
  "Automatic redirecting": "Redirección automática",
  "when you visit our website, we will store: the URL from which you visited us from, web pages of our website you visit, the date and duration of your visit, your anonymized IP address, the device specifications (device type, operating system, screen resolution, language, country you are located in, and web browser type) you used during your visit, and": "cuando visite nuestro sitio web, almacenaremos: la URL desde la que nos visitó, las páginas web de nuestro sitio que visite, la fecha y duración de su visita, su dirección IP anonimizada, las especificaciones del dispositivo (tipo de dispositivo, sistema operativo, resolución de pantalla, idioma, país en el que se encuentra y tipo de navegador web) que utilizó durante su visita, y",
  "Sending your request": "Enviando tu solicitud",
  "You are in the list": "Estás en la lista",
  "By submitting this form you agree to receive emails with notifications and updates from the Robonomics Network team": "Al enviar este formulario aceptas recibir correos electrónicos con notificaciones y actualizaciones del equipo de Robonomics Network",
  "Strategies for IoT Decentralization": "Estrategias para la descentralización de IoT",
  "Latest Robotics Tools": "Últimas herramientas de robótica",
  "Modern Cybernetics": "Cibernética moderna",
  "Economic Processes for Robots": "Procesos económicos para robots",
  "Engineering Skills": "Habilidades de ingeniería",
  "Your email": "Tu correo electrónico",
  "Submit": "Enviar",
  "course": "curso",
  "guide": "guía",
  "launch simulation": "lanzamiento de simulación",
  "real-life setup": "configuración en la vida real",
  "Introduction to the ideas of Robonomics": "Introducción a las ideas de Robonomics",
  "Broadcasting Through the Black Mirror": "Transmisión a través del Espejo Negro",
  "At the Intersection of Cybernetics and Economics": "En la intersección de la Cibernética y la Economía",
  "Polkadot Ecosystem for Home IoT Infrastructure": "Ecosistema Polkadot para la Infraestructura de IoT en el Hogar",
  "IoT Subscriptions Using Robonomics Parachain": "Suscripciones de IoT utilizando Robonomics Parachain",
  "Sovereign Smart Home with Robonomics and Home Assistant": "Hogar Inteligente Soberano con Robonomics y Home Assistant",
  "Raspberry Pi Setup": "Configuración de Raspberry Pi",
  "MQTT Broker Setup and Home Assistant Init": "Configuración del Broker MQTT e Inicio de Home Assistant",
  "Gateway Setup: Zigbee2MQTT": "Configuración de la Puerta de Enlace: Zigbee2MQTT",
  "Gateway Setup: Robonomics SLS Gateway": "Configuración de la Puerta de Enlace: Robonomics SLS Gateway",
  "Robonomics IoT Subscription Setup": "Configuración de Suscripción de IoT de Robonomics",
  "Robonomics Integration Setup": "Configuración de Integración de Robonomics",
  "Sensors Connectivity & Decentralized Sensors Network": "Conectividad de Sensores y Red de Sensores Descentralizados",
  "Sensor Hardware": "Hardware de Sensores",
  "Setting up and connecting sensors": "Configuración y conexión de sensores",
  "Sensors connectivity module": "Módulo de conectividad de sensores",
  "Sensors connectivity config options": "Opciones de configuración de conectividad de sensores",
  "Sensor map deployment": "Despliegue de mapa de sensores",
  "Robonomics sensors measure analytics and archive mode": "Modo de análisis y archivo de sensores de Robonomics",
  "Connect Mars Curiosity Rover": "Conectar el Rover Curiosity de Marte",
  "Connect ROS-compatible drone": "Conectar dron compatible con ROS",
  "Connect Kuka manipulator": "Conectar manipulador Kuka",
  "Connect unmanned aerial vehicle": "Conectar vehículo aéreo no tripulado",
  "Control Baxter robot": "Controlar robot Baxter",
  "ROS-based projects for smart spaces": "Proyectos basados en ROS para espacios inteligentes",
  "Operate Boston Dynamics Spot": "Operar Boston Dynamics Spot",
  "Quickstart Your Bachelor's Thesis with AI-powered Tools": "Inicio rápido de tu tesis de licenciatura con herramientas impulsadas por IA",
  "Introduction": "Introducción",
  "Literature Review": "Revisión de literatura",
  "Methods": "Métodos",
  "Conclusion": "Conclusión",
  "OpenGov for managing the IoT infrastructure": "OpenGov para gestionar la infraestructura de IoT",
  "The Shadow of AdCorp's Intrusion": "La Sombra de la Intrusión de AdCorp",
  "Introduction to open source solution for private smart homes": "Introducción a la solución de código abierto para hogares inteligentes privados",
  "New Home, New Habits": "Nuevo Hogar, Nuevos Hábitos",
  "Assembling Smart Home Board": "Ensamblaje de Placa de Hogar Inteligente",
  "Unleash Automation Potential": "Desatar el Potencial de Automatización",
  "Escape from Black Mirror": "Escapar del Espejo Negro",
  "The story of a girl named Trinity": "La historia de una chica llamada Trinity",
  "Fake Housewife & AI research Smart Home Solution": "Amas de Casa Falsas e Investigación de IA Solución de Hogar Inteligente",
  "Meet Fake Housewife Zoe and her story": "Conoce a la Amas de Casa Falsas Zoe y su historia",
  "Risks of standard Smart Home solutions and the Home Assistant": "Riesgos de soluciones estándar de Hogar Inteligente y el Asistente de Hogar",
  "Blockchain-based Smart home solutions": "Soluciones de Hogar Inteligente basadas en Blockchain",
  "Home Assistant + blockchain+Web3": "Asistente de Hogar + blockchain+Web3",
  "Studying the Sovereign smart home course at the academy and WIKI instructions": "Estudiando el curso de Hogar Inteligente Soberano en la academia e instrucciones de WIKI",
  "Fake Housewife & AI is researching devices to install": "Amas de Casa Falsas e IA están investigando dispositivos para instalar",
  "Fake Housewife & AI is installing a Smart Home Robonomics": "Amas de Casa Falsas e IA están instalando un Hogar Inteligente Robonomics",
  "AI scenario of the Relax zone for the Fake Housewife": "Escenario de IA de la Zona de Relax para la Amas de Casa Falsas",
  "Software Developing for Boston Dynamics Spot": "Desarrollo de Software para Boston Dynamics Spot",
  "Emergency Stop, Initialization, Body Position Control": "Parada de Emergencia, Inicialización, Control de Posición del Cuerpo",
  "Getting Used to Feecc": "Acostumbrarse a Feecc",
  "Architecture": "Arquitectura",
  "Overview": "Visión General",
  "Demo of Feecc": "Demostración de Feecc",
  "Deployment of Engineer Workbench": "Despliegue del Banco de Trabajo del Ingeniero",
  "Deployment of Analytics": "Despliegue de Analíticas",
  "World computer in your home": "Computadora mundial en tu hogar",
  "Part 1: The Idea of a World Computer": "Parte 1: La Idea de una Computadora Mundial",
  "Part 2: The Heart of the World Computer": "Parte 2: El Corazón de la Computadora Mundial",
  "Part 3: Emergence of the World Computer": "Parte 3: Emergencia de la Computadora Mundial",
  "Part 4: The Path of a New Block of Information in the World Computer": "Parte 4: El Camino de un Nuevo Bloque de Información en la Computadora Mundial",
  "Ivan Berman": "Ivan Berman",
  "Leemo": "Leemo",
  "Vadim Manaenko": "Vadim Manaenko",
  "Sergei Lonshakov": "Sergei Lonshakov",
  "Anna Wimmer-Savinova": "Anna Wimmer-Savinova",
  "Pavel Tarasov": "Pavel Tarasov",
  "Alexander Smekhnov": "Alexander Smekhnov",
  "Filter": "Filtro",
  "Note: you need to pass all lessons from course with one Polkadot.js account to apply for certificate": "Nota: necesitas aprobar todas las lecciones del curso con una cuenta de Polkadot.js para solicitar el certificado"
}