{
  "404": "404",
  "Complexity:": "Складність:",
  "Tags:": "Теги:",
  "Authors:": "Автори:",
  "Apply": "Застосувати",
  "Clear all": "Очистити все",
  "Spring school 2023": "Весняна школа 2023",
  "ROS": "ROS",
  "Raspberry Pi": "Raspberry Pi",
  "ai": "ai",
  "Spot": "Spot",
  "Multi-Agent Systems": "Багатоагентні системи",
  "Industrial": "Промисловість",
  "World computer": "Світовий комп'ютер",
  "Privacy Policy": "Політика конфіденційності",
  "Learn": "Вивчити",
  "Robonomics website": "Веб-сайт Robonomics",
  "Tell us more": "Розкажіть нам більше",
  "Thanks": "Дякуємо",
  "we’ll keep in touch": "ми будемо тримати з вами зв'язок",
  "Results": "Результати",
  "Previous Lesson": "Попередній урок",
  "Previous Page": "Попередня сторінка",
  "Next Lesson": "Наступний урок",
  "Next Page": "Наступна сторінка",
  "You are currently opted out. Click here to opt in": "Ви в даний момент відмовилися. Натисніть тут, щоб погодитися",
  "You may choose not to have a unique web analytics cookie identification number assigned to your computer to avoid the aggregation and analysis of data collected on this website.": "Ви можете відмовитися від призначення унікального номера ідентифікації веб-аналітики для ашого комп'ютера, щоб уникнути агрегації та аналізу даних, зібраних на цьому веб-сайті.",
  "To make that choice, please click below to receive an opt-out cookie": "Щоб зробити цей вибір, натисніть нижче, щоб отримати файли cookie для відмови",
  "You are currently opted out. Click here to opt in.": "Ви в даний момент відмовилися. Натисніть тут, щоб погодитися.",
  "Opt-out complete; your visits to this website will not be recorded by the Web Analytics tool. Note that if you clear your cookies, delete the opt-out cookie, or if you change computers or Web browsers, you will need to perform the opt-out procedure again.": "Відмова завершена; ваші відвідування цього веб-сайту не будуть записані інструментом веб-аналітики. Зверніть увагу, що якщо ви очистите файли cookie, видалите файли cookie для відмови або зміните комп'ютери або веб-браузери, вам доведеться знову вконати процедуру відмови.",
  "Please click below to opt in:": "Будь ласка, натисніть нижче, щоб погодитися:",
  "You are currently opted in. Click here to opt out.": "Ви в даний момент погодилися. Натисніть тут, щоб відмовитися.",
  "Latest update": "Останнє оновлення",
  "on (date of commit)": "на (дата здійснення)",
  "by (author of commit)": "від (автор здійснення)",
  "Completed the Course?": "Закінчили курс?",
  "You can apply for a certificate of completion, after which you will be able to:": "Ви можете подати заявку на отримання сертифіката про завершення, після чого ви зможете:",
  "add certificate to your LinkedIn profile": "додати сертифікат до свого профілю LinkedIn",
  "apply for": "подати заявку на",
  "Robonomics Ambassador Program": "Програму амбасадорів Robonomics",
  "print the certificate and hang it on the wall.": "надрукувати сертифікат і повісити його на стіну.",
  "Apply for Certificate": "Подати заявку на сертифікат",
  "Ask question on GitHub": "Задати питання на GitHub",
  "Get Notifications & Updates": "Отримувати сповіщення та оновлення",
  "You've come to the wrong classroom": "Ви прийшли в неправильну аудиторію",
  "Return to main campus": "Повернутися на головний кампус",
  "Welcome to Our Online School!": "Ласкаво просимо до нашої онлайн-школи!",
  "The core developers of the Robonomics project, robotics specialists and PhD research scientists offer to pass through compendious experience based on 7 years of work with web 3.0 projects.": "Основні розробники проекту Robonomics, спеціалісти з робототехніки та доктори фіософії пропонують пройти компендіозний досвід, заснований на 7 роках роботи з проектами веб 3.0.",
  "What can you discover for yourself in the academy?": "Що ви можете відкрити для себе в академії?",
  "Web3 Advanced Applications": "Веб3 Розширені застосування",
  "Find out how cutting-edge web3 technologies can be integrated into personal, city, or corporate settings on examples with practical uses in real-life scenarios.": "Дізнайтеся, як передові технології веб3 можуть бути інтегровані в особисті, міські або корпоративні налаштування на прикладах з практичними застосуваннями в реальних сценаріях життя.",
  "Focus on decentralized IoT strategies that provide greater safety and flexibility compared to their centralized counterparts.": "Сконцентруйтеся на децентралізованих стратегіях Інтернету речей, які забезпечують більшу безпеку та гнучкість порівняно з централізованими аналогами.",
  "Study new robotics frameworks and SDKs and apply them to your projects.": "Вивчайте нові фреймворки та набори розробки робототехніки та застосовуйте їх у своїх проектах.",
  "Peep insights how Norbert Wiener's principles of cybernetics are applied to modern autonomous systems.": "Загляньте в те, як принципи кібернетики Норберта Вінера застосовуються до сучасних автономних систем.",
  "Discover new mechanisms of techno-economic communication between machines and humans.": "Відкрийте нові механізми техноекономічного спілкування між машинами та людьми.",
  "Learn how to work with single board computers, sensors, smart devices and complex robots.": "Дізнайтеся, як працювати з одноплатними комп'ютерами, датчиками, розумними пристроями та складними роботами.",
  "What is Robonomics?": "Що таке Robonomics?",
  "Robonomics is a secure, serverless and futuristic IoT platform that connects users and smart devices. It enables the exchange of technical and economic information in the form of atomic transactions between user applications, IoT services, and complex robotics.": "Robonomics - це безпечна, безсерверна та майбутня платформа Інтернету речей, яка з'єднує користувачів та розумні пристрої. Вона дозволяє обмін технічною та економічною інформацією у формі атомних транзакцій між користувацькими додатками, Інтернет-послугами та складними роботами.",
  "Learn more on Robonomics website": "Дізнайтеся більше на веб-сайті Robonomics",
  "User Dapp": "Користувацький Dapp",
  "Function Request": "Функція запиту",
  "Report": "Звіт",
  "Digital Twin": "Цифровий двійник",
  "Control": "Контроль",
  "Log": "Журнал",
  "IoT Device": "Пристрій Інтернету речей",
  "Learn and practice web3": "Вивчайте та практикуйте веб3",
  "Discover our expanding selection of hands-on exercises, tutorials, and online courses for free. The core developers and researchers at Robonomics invite you to enter the world of web3 and gain practical and theoretical skills through quizzes, device simulations, and even real-life setups using Robonomics Parachain (Polkadot), IPFS, and other web3 tools.": "Дізнайтеся про наш розширюючийся вибір практичних вправ, навчальних посібників та онлайн-курсів бекоштовно. Основні розробники та дослідники в Robonomics запрошують вас у світ веб3 та набути практичні та теоретичні навички через тести, симуляції пристроїв та навіть реальні налаштування з використанням Robonomics Parachain (Polkadot), IPFS та інших інструментів веб3.",
  "No courses were found with such filters.": "Курси з такими фільтрами не знайдено.",
  "Try again": "Спробуйте ще раз",
  "This page has moved to a": "Ця сторінка була перенесена на",
  "Automatic redirecting": "Автоматичне перенаправлення",
  "Strategies for IoT Decentralization": "Стратегії для децентралізації Інтернету речей",
  "Latest Robotics Tools": "Останні інструменти робототехніки",
  "Modern Cybernetics": "Сучасна кібернетика",
  "Economic Processes for Robots": "Економічні процеси для роботів",
  "Engineering Skills": "Інженерні навички",
  "Your email": "Ваша електронна пошта",
  "course": "курс",
  "guide": "посібник",
  "launch simulation": "запуск симуляції",
  "real-life setup": "реальна настройка",
  "Introduction to the ideas of Robonomics": "Вступ до ідей Робономіки",
  "Broadcasting Through the Black Mirror": "Трансляція через Чорне дзеркало",
  "At the Intersection of Cybernetics and Economics": "На перехресті кібернетики та економіки",
  "Polkadot Ecosystem for Home IoT Infrastructure": "Екосистема Polkadot для домашньої Інтернету речей",
  "IoT Subscriptions Using Robonomics Parachain": "Підписки на Інтернет речей за допомогою парачейну Робономіки",
  "Sovereign Smart Home with Robonomics and Home Assistant": "Суверенний розумний будинок з Робономікою та допоміжником вдома",
  "Raspberry Pi Setup": "Налаштування Raspberry Pi",
  "MQTT Broker Setup and Home Assistant Init": "Налаштування MQTT брокера та ініціалізація допоміжника вдома",
  "Gateway Setup: Zigbee2MQTT": "Налаштування шлюзу: Zigbee2MQTT",
  "Gateway Setup: Robonomics SLS Gateway": "Налаштування шлюзу: Шлюз SLS Робономіки",
  "Robonomics IoT Subscription Setup": "Налаштування підписки на Інтернет речей Робономіки",
  "Robonomics Integration Setup": "Налаштування інтеграції Робономіки",
  "Sensors Connectivity & Decentralized Sensors Network": "Підключення датчиків та децентралізована мережа датчиків",
  "Sensor Hardware": "Апаратне забезпечення датчиків",
  "Setting up and connecting sensors": "Налаштуваня та підключення датчиків",
  "Sensors connectivity module": "Модуль підключення датчиків",
  "Sensors connectivity config options": "Опції конфігурації підключення датчиків",
  "Sensor map deployment": "Розгортання карти датчиків",
  "Robonomics sensors measure analytics and archive mode": "Аналітика та архівний режим вимірювання датчиків Робономіки",
  "Connect Mars Curiosity Rover": "Підключення до ровера Mars Curiosity",
  "Connect ROS-compatible drone": "Підключення до дрона, сумісного з ROS",
  "Connect Kuka manipulator": "Підключення маніпулятора Kuka",
  "Connect unmanned aerial vehicle": "Підключення безпілотного літального апарата",
  "Control Baxter robot": "Керування роботом Baxter",
  "ROS-based projects for smart spaces": "Проекти на основі ROS для розумних просторів",
  "Operate Boston Dynamics Spot": "Робота з Boston Dynamics Spot",
  "Quickstart Your Bachelor's Thesis with AI-powered Tools": "Швидкий старт вашої дипломної роботи з інструментами на основі штучного інтелекту",
  "Introduction": "Вступ",
  "Literature Review": "Огляд літератури",
  "Methods": "Методи",
  "Conclusion": "Висновок",
  "OpenGov for managing the IoT infrastructure": "OpenGov для управління Інтернетом речей",
  "The Shadow of AdCorp's Intrusion": "Тінь вторгнення AdCorp",
  "Introduction to open source solution for private smart homes": "Вступ до відкритого рішення для приватних розумних будинків",
  "New Home, New Habits": "Новий будинок, нові звички",
  "Assembling Smart Home Board": "Збирання плати для розумного будинку",
  "Unleash Automation Potential": "Розкриття потенціалу автоматизації",
  "Escape from Black Mirror": "Втеча від Чорного дзеркала",
  "The story of a girl named Trinity": "Історія дівчини на ім'я Трініті",
  "Fake Housewife & AI research Smart Home Solution": "Фальшива домогосподиня та дослідження штучного інтелекту рішення для розумного будинку",
  "Meet Fake Housewife Zoe and her story": "Зустрічайте фальшиву домогосподиню Зою та її історію",
  "Risks of standard Smart Home solutions and the Home Assistant": "Ризики стандартних рішень для розумного будинку та допоміжник вдома",
  "Blockchain-based Smart home solutions": "Рішення для розумного будинку на основі блокчейну",
  "Home Assistant + blockchain+Web3": "Допоміжник вдома + блокчейн + Web3",
  "Studying the Sovereign smart home course at the academy and WIKI instructions": "Вивчення курсу суверенного розумного будинку в академії та інструкції WIKI",
  "Fake Housewife & AI is researching devices to install": "Фальшива домогосподиня та штучний інтелект досліджують пристрої для встановлення",
  "Fake Housewife & AI is installing a Smart Home Robonomics": "Фальшива домогосподиня та штучний інтелект встановлюють Розумний будинок Робономіки",
  "AI scenario of the Relax zone for the Fake Housewife": "Сценарій штучного інтелекту для зони відпочинку для фальшивої домогосподині",
  "Software Developing for Boston Dynamics Spot": "Розробка програмного забезпечення для робота Boston Dynamics Spot",
  "Emergency Stop, Initialization, Body Position Control": "Аварійна зупинка, ініціалізація, керування позицією тіла",
  "Getting Used to Feecc": "Звикання до Feecc",
  "Architecture": "Архітектура",
  "Overview": "Огляд",
  "Demo of Feecc": "Демонстрація Feecc",
  "Deployment of Engineer Workbench": "Розгортання інженерної верстатної площадки",
  "Deployment of Analytics": "Розгортання аналітики",
  "World computer in your home": "Світовий комп'ютер у вашому домі",
  "Part 1: The Idea of a World Computer": "Частина 1: Ідея світового комп'ютера",
  "Part 2: The Heart of the World Computer": "Частина 2: Серце світового комп'ютера",
  "Part 3: Emergence of the World Computer": "Частина 3: Виникнення світового комп'ютера",
  "Part 4: The Path of a New Block of Information in the World Computer": "Частина 4: Шлях нового блоку інформації у світовому комп'ютері",
  "Ivan Berman": "Іван Берман",
  "Leemo": "Лімо",
  "Vadim Manaenko": "Вадим Манаєнко",
  "Sergei Lonshakov": "Сергій Лоншаков",
  "Anna Wimmer-Savinova": "Анна Віммер-Савінова",
  "Pavel Tarasov": "Павло Тарасов",
  "Alexander Smekhnov": "Олександр Смехнов",
  "Filter": "Фільтр",
  "Note: you need to pass all lessons from course with one Polkadot.js account to apply for certificate": "Приміта: вам потрібно пройти всі уроки з курсу за одним обліковим записом Polkadot.js, щоб отримати сертифікат",
  "Robonomics School 2024 / IoT is More Dangerous Than AI": "Робономка Школа 2024 / Інтернет речей небезпечніший, ніж штучний інтелект",
  "Robonomics School 2024 / Privacy Insights for Smart Homes": "Робоноіка Школа 2024 / Приватні відомості для розумних будинків",
  "Robonomics School 2024 / Cyprus Relocant Manual: Smart Home": "Робономіка Школа 2024 / Кіпрський посібник для переїзду: Розумний будинок",
  "ROS 2": "ROS 2",
  "Essentials": "Основи",
  "Smart Home": "Розумний дім",
  "Robotics": "Робототехніка",
  "Sensor Network": "Мережа сенсорів",
  "School 2024": "Школа 2024",
  "By clicking on the button “Submit” you agree to receive regular emails from Robonomics (no more than 1 per month) and you agree with": "Натискаючи кнопку «Надіслати», ви погоджуєтеся отримувати регулярні електронні листи від Robonomics (не більше 1 на місяць) і погоджуєтеся з",
  "Last updated: February 05, 2025": "Останнє оновлення: 5 лютого 2025 року",
  "This Privacy Policy describes Our policies and procedures on the collection, use and disclosure of Your information when You use the Service and tells You about Your privacy rights and how the law protects You.": "Ця Політика конфіденційності описує наші політики та процедури збору, використання та розкриття вашої інформації при використанні Сервісу та повідомляє вас про ваші права на конфіденційність та про те, як закон захищає вас.",
  "We use Your Personal data to provide and improve the Service. By using the Service, You agree to the collection and use of information in accordance with this Privacy Policy.": "Ми використовуємо ваші особисті дані для надання та покращення Сервісу. Використовуючи Сервіс, ви погоджуєтеся зі збором та використанням інформації відповідно до цієї Політики конфіденційності.",
  "Interpretation and Definitions": "Тлумачення та Визначення",
  "Interpretation": "Тлумачення",
  "The words of which the initial letter is capitalized have meanings defined under the following conditions. The following definitions shall have the same meaning regardless of whether they appear in singular or in plural.": "Слова, початкова літера яких написана великою буквою, мають визначення, визначені в наступних умовах. Наведені визначення матимуть той самий зміст незалежно від того, чи вони зустрічаються в однині чи множині.",
  "Definitions": "Визначення",
  "For the purposes of this Privacy Policy:": "З метою цієї Політики конфіденційності:",
  "DAO": "DAO",
  "(referred to as either \"the DAO\", \"We\", \"Us\" or \"Our\" in this Agreement) refers to decentralized autonomous organization Robonomics Network, an operator for website": "(називається як «DAO», «Ми», «Нас» або «Наші» в цій Угоді) відноситься до децентралізованої автономної організації Robonomics Network, оператора веб-сайту",
  "(referred to as": "(називається",
  "Website": "Веб-сайт",
  "in this Agreement). For the purpose of the GDPR, the DAO is the Data Controller.": "в цій Угоді). З метою Загального регламенту про захист даних (GDPR) DAO є контролером даних.",
  "Cookies": "Cookies",
  "are small files that are placed on Your computer, mobile device or any other device by a website, containing the details of Your browsing history on that website among its many uses. More detailed information on cookies and how they work can be found at:": "це невеликі файли, які розміщуються на вашому комп'ютері, мобільному пристрої або будь-якому іншому пристрої веб-сайтом, що містять деталі вашої історії перегляду на цьому веб-сайті серед багатьох інших використань. Докладнішу інформацію про файли cookie та їх роботу можна знайти за посиланням:",
  "Country": "Країна",
  "refers to: Cyprus.": "відноситься до: Кіпр.",
  "Data Controller": "Контролер даних",
  "for the purposes of the GDPR (General Data Protection Regulation), refers to the DAO as the legal person which alone or jointly with others determines the purposes and means of the processing of Personal Data.": "з метою Загального регламенту про захист даних (GDPR) відноситься до DAO як юридичної особи, яка самостійно або спільно з іншими визначає цілі та засоби обробки особистих даних.",
  "Device": "Пристрій",
  "means any device that can access the Service such as a computer, a cellphone or a digital tablet.": "означає будь-який пристрій, який може отримати доступ до Сервісу, такий як комп'ютер, мобільний телефон або цифровий планшет.",
  "GDPR": "GDPR",
  "refers to EU General Data Protection Regulation.": "відноситься до Загального регламенту про захист даних ЄС.",
  "Personal Data": "Особисті дані",
  "is any information that relates to an identified or identifiable individual.": "це будь-яка інформація, яка стосується ідентифікованої або ідентифікованої фізичної особи.",
  "For the purposes of GDPR, Personal Data means any information relating to You such as a name, an identification number, location data, online identifier or to one or more factors specific to the physical, physiological, genetic, mental, economic, cultural or social identity.": "З метою GDPR Особисті дані означають будь-яку інформацію, що стосується вас, таку як ім'я, ідентифікаційний номер, дані про місцезнаходження, онлайн-ідентифікатор або один або кілька факторів, що є специфічними для фізичної, фізіологічної, генетичної, розумової, економічної, культурної або соціальної ідентичності.",
  "Service": "Сервіс",
  "refers to the Website": "відноситься до Веб-сайту",
  "Service Provider": "Постачальник послуг",
  "means any natural or legal person who processes the data on behalf of the DAO. It refers to third-party companies or individuals employed by the DAO to facilitate the Service, to provide the Service on behalf of the DAO, to perform services related to the Service or to assist the DAO in analyzing how the Service is used. For the purpose of the GDPR, Service Providers are considered Data Processors.": "означає будь-яку фізичну або юридичну особу, яка обробляє дані від імені DAO. Це стосується сторонніх компаній або осіб, які працюють на користь DAO для полегшення надання Сервісу, для надання Сервісу від імені DAO, для виконання послуг, пов'язаних з Сервісом, або для допомоги DAO в аналізі того, як використовується Сервіс. З метою GDPR Постачальники послуг вважаються обробниками даних.",
  "Usage Data": "Дані використання",
  "refers to data collected automatically, either generated by the use of the Service or from the Service infrastructure itself (for example, the duration of a page visit).": "це дані, які збираються автоматично, які генеруються використанням Сервісу або з самої інфраструктури Сервісу (наприклад, тривалість візиту на сторінку).",
  "You": "Ви",
  "(referred to as either \"Your\" in this Agreement) means the individual accessing or using the Service, or the DAO, or other legal entity on behalf of which such individual is accessing or using the Service, as applicable.": "(називається як «Ваш» в цій Угоді) означає фізичну особу, яка отримує доступ або використовує Сервіс, або DAO, або іншу юридичну особу від імені якої така особа отримує доступ або використовує Сервіс, застосовно.",
  "Under GDPR, You can be referred to as the Data Subject or as the User as you are the individual using the Service.": "Згідно з GDPR, ви можете бути звернуті як Суб'єкт даних або як Користувач, оскільки ви є особою, яка використовує Сервіс.",
  "This Agreement is originally written in English. This AI translation is provided for your reference only.": "Ця Угода спочатку написана англійською мовою. Це переклад за допомогою штучного інтелекту надається лише для вашої інформації.",
  "Demo academic apps": "Демонстраційні академічні додатки",
  "Here are some demonstrational applications for academic needs. Some of them can be active, some of them not.": "Ось деякі демонстраційні додатки для академічних потреб. Деякі з них можуть бути активними, деякі - ні.",
  "Hack Johnny's lab": "Взламати лабораторію Джонні",
  "Johny's crypto lab is a cutting-edge hub filled with all sorts of smart gadgets, including a TurtleBot 4 robot that is known as a base for an iRobot vacuum. But imagine the thrill—and the risk—if someone managed to hack into the robot's camera. Ready to dive into the world of cybersecurity and test your hacking skills? See what you can uncover!": "Криптолабораторія Джонні - це передовий центр, наповнений різноманітними розумними пристроями, включаючи робота TurtleBot 4, який відомий як база для пилососа iRobot. Але уявіть захват та ризик, якщо хтось зміг би взламати камеру робота. Готові зануритися в світ кібербезпеки та перевірити свої навички взлому? Подивіться, що ви можете виявити!",
  "Rules of the game": "Правила гри",
  "Collecting and Using Your Personal Data": "Збір та використання Ваших особистих даних",
  "Types of Data Collected": "Типи зібраних даних",
  "While using Our Service, We may ask You to provide Us with certain personally identifiable information that can be used to contact or identify You. Personally identifiable information may include, but is not limited to:": "Під час використання нашого сервісу ми можемо попросити вас надати нам певну особисту ідентифікаційну інформацію, яка може бути використана для зв'язку або ідентифікації вас. Особиста ідентифікаційна інформація може включати, але не обмежується:",
  "Email address": "Адреса електронної пошти",
  "First name and last name": "Ім'я та прізвище",
  "Usage Data is collected automatically when using the Service.": "Дані використання збираються автоматично при використанні сервісу.",
  "Usage Data may include information such as Your Device's Internet Protocol address (e.g. IP address), browser type, browser version, the pages of our Service that You visit, the time and date of Your visit, the time spent on those pages, unique device identifiers and other diagnostic data.": "Дані використання можуть включати інформацію, таку як Інтернет-протокол вашого пристрою (наприклад, IP-адреса), тип браузера, версія браузера, сторінки нашого сервісу, які ��и відвідуєте, час та дата вашого візиту, час, проведений на цих сторінках, унікальні ідентифікатори пристрою та інші діагностичні дані.",
  "When You access the Service by or through a mobile device, We may collect certain information automatically, including, but not limited to, the type of mobile device You use, Your mobile device unique ID, the IP address of Your mobile device, Your mobile operating system, the type of mobile Internet browser You use, unique device identifiers and other diagnostic data.": "Коли ви отримуєте доступ до сервісу за допомогою мобільного пристрою, ми можемо автоматично збирати певну інформацію, включаючи, але не обмежуючись, тип мобільного пристрою, який ви використовуєте, унікальний ідентифікатор вашого мобільного пристрою, IP-адресу вашого мобільного пристрою, операційну систему вашого мобільного пристрою, тип мобільного Інтернет-браузера, який ви використовуєте, унікальні ідентифікатори пристрою та інші діагностичні дані.",
  "We may also collect information that Your browser sends whenever You visit our Service or when You access the Service by or through a mobile device.": "Ми також можемо збирати інформацію, яку ваш браузер надсилає кожного разу, коли ви відвідуєте наш сервіс або коли ви отримуєте доступ до сервісу за ��опомогою мобільного пристрою.",
  "Cookies & Browser Storage": "Cookies & Зберігання браузера",
  "The Websites may use cookies. We use cookies and browser storage only for essential settings to improve your experience—not for tracking. These help remember your preferences, such as language settings or consent choices, so you don’t have to reset them each time you visit.": "Сайти можуть використовувати файли cookie. Ми використовуємо файли cookie та зберігання браузера лише для важливих налаштувань для покращення вашого досвіду—не для відстеження. Вони допомагають запам'ятовувати ваші уподобання, такі як мовні налаштування або вибори згоди, щоб вам не довелося скидати їх кожного разу, коли ви відвідуєте.",
  "We do not use cookies for tracking or personalized advertising. You can manage or disable cookies in your browser settings, but some features may not work properly without them.": "Ми не використовуємо файли cookie для відстеження або персоналізованої реклами. Ви можете керувати або вимкнути файли cookie в налаштуваннях вашого браузера, але деякі функції можуть не працювати належним чином без них.",
  "Matomo Analytics": "Аналітика Matomo",
  "Our website may use Matomo, an open-source analytics platform, to gather insights into website usage. This includes anonymized data such as:": "Наш веб-сайт може використовувати Matomo, платформу аналітики з відкритим вихідним кодом, для отримання відомостей про використання веб-сайту. Це включає анонімнізовані дані, такі як:",
  "Pages visited and navigation paths": "Відвідані сторінки та шляхи навігації",
  "Time spent on our website": "Час, проведений на нашому веб-сайті",
  "Whether you’re a returning or new visitor": "Чи ви повертаєтесь як відвідувач чи новий",
  "Your device type (desktop, mobile, etc.)": "Тип вашого пристрою (настільний, мобільний тощо)",
  "To protect your privacy, your IP address is anonymized before being stored. The data we collect is only used to improve the website and is not used for personal identification.": "Для захисту вашої конфіденційності ваш IP-адреса анонімізується перед зберіганням. Зібрані нами дані використовуються лише для покращення веб-сайту і не використовуються для особистої ідентифікації.",
  "Under Art. 6(1)(f) GDPR": "Згідно з Art. 6(1)(f) GDPR",
  "we process this data based on our legitimate interest in enhancing our services.": "ми обробляємо ці дані на підставі нашого законного інтересу в покращенні наших послуг.",
  "Opt-Out Option": "Опція відмови",
  "You can disable Matomo tracking at any time:": "Ви можете в будь-який момент вимкнути відстеження Matomo:",
  "Use of Your Personal Data": "Використання ваших особистих даних",
  "The DAO may use Personal Data for the following purposes:": "DAO може використовувати особисті дані для наступних цілей:",
  "To provide and maintain our Service": "Надання та підтримк�� нашого сервісу",
  "including to monitor the usage of our Service.": "включаючи моніторинг використання нашого сервісу.",
  "For the performance of a contract": "Для виконання контракту",
  "the development, compliance and undertaking of the purchase contract for the products, items or services You have purchased or of any other contract with Us through the Service.": "розробка, виконання та виконання контракту на покупку продуктів, товарів або послуг, які ви придбали або будь-якого іншого контракту з нами через сервіс.",
  "To contact You": "Зв'язок з вами",
  "To contact You by email, telephone calls, SMS, or other equivalent forms of electronic communication, such as a mobile application's push notifications regarding updates or informative communications related to the functionalities, products or contracted services, including the security updates, when necessary or reasonable for their implementation.": "Зв'язок з вами по електронній пошті, телефонних дзвінках, SMS або іншими еквівалентними формами електронного зв'язку, такими як сповіщення про оновлення мобільного додатка щодо оновлень або інформаційних комунікацій, пов'язаних з функціональністю, продуктами або укладеними послугами, включаючи оновлення безпеки, коли це необхідно або розумно для їх впровадження.",
  "To provide You": "Надання вам",
  "with news, special offers and general information about other goods, services and events which we offer that are similar to those that you have already purchased or enquired about unless You have opted not to receive such information.": "новин, спеціальних пропозицій та загальної інформації про інші товари, послуги та події, які ми пропонуємо, схожі на ті, які ви вже придбали або запитували, якщо ви не відмовилися отримувати таку інформацію.",
  "To manage Your requests": "Управління вашими запитами",
  "To attend and manage Your requests to Us.": "Для відвідування та управління вашими запитами до нас.",
  "For other purposes": "Для інших цілей",
  "We may use Your information for other purposes, such as data analysis, identifying usage trends, determining the effectiveness of our promotional campaigns and to evaluate and improve our Service, products, services, marketing and your experience.": "Ми можемо використовувати вашу інформацію для інших цілей, таких як аналіз даних, визначення тенденцій використання, визначення ефективності наших рекламних кампаній та оцінка та покращення нашого сервісу, продуктів, послуг, маркетингу та вашого досвіду.",
  "We may share Your personal information in the following situations:": "Ми можемо ділитися вашою особистою інформацією в наступних ситуаціях:",
  "With Service Providers": "З постачальниками послуг",
  "We may share Your personal information with Service Providers to monitor and analyze the use of our Service, to contact You.": "Ми можемо ділитися Вашою особистою інформацією з постачальниками послуг для моніторингу та аналізу використання нашого сервісу, для зв'язку з Вами.",
  "With Your consent": "З Вашою згодою",
  "We may disclose Your personal information for any other purpose with Your consent.": "Ми можемо розкривати Вашу особисту інформацію для будь-яких інших цілей за Вашою згодою.",
  "Retention of Your Personal Data": "Зберігання Ваших особистих даних",
  "The DAO will retain Your Personal Data only for as long as is necessary for the purposes set out in this Privacy Policy. We will retain and use Your Personal Data to the extent necessary to comply with our legal obligations (for example, if we are required to retain your data to comply with applicable laws), resolve disputes, and enforce our legal agreements and policies.": "DAO буде зберігати Ваші особисті дані лише настільки, наскільки це необхідно для цілей, визначених у цій Політиці конфіденційності. Ми будемо зберігати та використовувати Ваші особисті дані в обсязі, необхідному для виконання наших правових зобов'язань (наприклад, якщо нам потрібно зберігати ваші дані для виконання вимог чинного законодавства), вирішення суперечок та забезпечення виконання наших правових угод та політик.",
  "The DAO will also retain Usage Data for internal analysis purposes. Usage Data is generally retained for a shorter period of time, except when this data is used to strengthen the security or to improve the functionality of Our Service, or We are legally obligated to retain this data for longer time periods.": "DAO також буде зберігати Дані використання для внутрішнього аналізу. Дані використання, як правило, зберігаються протягом короткого періоду часу, за винятком випадків, коли ці дані використовуються для зміцнення безпеки або покращення функціональності нашого сервісу, або ми юридично зобов'язані зберігати ці дані протягом триваліших періодів часу.",
  "Security of Your Personal Data": "Безпека Ваших особистих даних",
  "The security of Your Personal Data is important to Us, but remember that no method of transmission over the Internet, or method of electronic storage is 100% secure. While We strive to use commercially acceptable means to protect Your Personal Data, We cannot guarantee its absolute security.": "Безпека Ваших особистих даних є важливою для нас, але пам'ятайте, що жоден метод передачі через Інтернет або метод електронного зберігання не є 100% безпечним. Хоча ми намагаємося використовувати комерційно прийнятні засоби для захисту Ваших особистих даних, ми не можемо гарантувати їх абсолютну безпеку.",
  "Detailed Information on the Processing of Your Personal Data": "Детальна інформація про обробку Ваших особистих даних",
  "Your information, including Personal Data, is processed is processed at the DAO's website service provider(s) and in any other places where the parties involved in the processing are located. It means that this information may be transferred to — and maintained on — computers located outside of Your state, province, country or other governmental jurisdiction where the data protection laws may differ than those from Your jurisdiction.": "Ваша інформація, включаючи особисті дані, обробляється на веб-сайті постачальника послуг DAO та в будь-яких інших місцях, де знаходяться сторони, що беруть участь у обробці. Це означає, що ця інформація може бути передана — та зберігатися на — комп'ютерах, що знаходяться за межами Вашої держави, провінції, країни або іншої урядової юрисдикції, де закони про захист даних можуть відрізнятися від тих, що діють у Вашій юрисдикції.",
  "Your consent to this Privacy Policy followed by Your submission of such information represents Your agreement to that transfer.": "Ваша згода з цією Політикою конфіденційності, яка слідує за Вашим наданням такої інформації, означає Вашу згоду на цей перенос.",
  "The DAO will take all steps reasonably necessary to ensure that Your data is treated securely and in accordance with this Privacy Policy and no transfer of Your Personal Data will take place to an organization or a country unless there are adequate controls in place including the security of Your data and other personal information.": "DAO вживе всіх розумних заходів, щоб забезпечити безпечну обробку Ваших даних відповідно до цієї Політики конфіденційності, і ніякого перенесення Ваших особистих даних не буде здійснено до організації або країни, якщо не будуть встановлені відповідні контрольні заходи, включаючи безпеку Ваших даних та іншої особистої інформації.",
  "Please note that any data transmission on the Internet (e.g. communication by e-mail) is generally not secure and we accept no liability for data transmitted to us via the Internet. Unfortunately, absolute protection is not technically possible. This information does not apply to the Website of third parties and the corresponding links given on our Website. The DAO assumes no responsibility and liability for these.": "Зверніть увагу, що будь-яка передача даних через Інтернет (наприклад, комунікація по електронній пошті) загалом не є безпечною, і ми не несемо відповідальності за дані, передані нам через Інтернет. На жаль, абсолютний захист технічно неможливий. Ця інформація не стосується веб-сайтів третіх сторін та відповідних посилань, наданих на нашому веб-сайті. DAO не несе відповідальності за це.",
  "The Service Providers We use may have access to Your Personal Data. These third-party vendors collect, store, use, process and transfer information about Your activity on Our Service in accordance with their Privacy Policies.": "Постачальники послуг, які ми використовуємо, можуть мат�� доступ до Ваших особистих даних. Ці сторонні постачальники збирають, зберігають, використовують, обробляють та передають інформацію про Вашу діяльність на нашому сервісі відповідно до їхніх Політик конфіденційності.",
  "Email Marketing": "Email Marketing",
  "We may use Your Personal Data to contact You with newsletters, marketing or promotional materials and other information that may be of interest to You. You may opt-out of receiving any, or all, of these communications from Us by following the unsubscribe link or instructions provided in any email We send or by contacting Us.": "Ми можемо використовувати Ваші особисті дані, щоб зв'язатися з Вами за допомогою розсилок, маркетингових або промоційних матеріалів та іншої інформації, яка може бути цікавою для Вас. Ви можете відмовитися від отримання будь-яких або всіх цих комунікацій від нас, слідуючи посиланню на відписку або інструкціям, наданим в будь-якому електронному листі, який ми відправляємо, або зв'язавшись з нами.",
  "We may use Email Marketing Service Providers to manage and send emails to You;": "Ми можемо використовувати постачальників послуг електронного маркетингу для управління та відправлення електронних листів вам;",
  "Unisender": "Unisender",
  "Their Privacy Policy can be viewed at": "Їх Політику конфіденційності можна переглянути за поси��анням",
  "Usage, Performance and Miscellaneous": "Використання, продуктивність та різне",
  "We may use third-party Service Providers to maintain and improve our Service.": "Ми можемо використовувати сторонніх постачальників послуг для підтримки та покращення нашого сервісу.",
  "hcaptcha": "hcaptcha",
  "GDPR Privacy": "GDPR Конфіденційність",
  "Legal Basis for Processing Personal Data under GDPR": "Правова підстава для обробки персональних даних відповідно до GDPR",
  "We may process Personal Data under the following conditions:": "Ми можемо обробляти персональні дані за наступних умов:",
  "Consent:": "Згода:",
  "You have given Your consent for processing Personal Data for one or more specific purposes.": "Ви надали свою згоду на обробку персональних даних для одного або кількох конкретних цілей.",
  "Performance of a contract:": "Виконання контракту:",
  "Provision of Personal Data is necessary for the performance of an agreement with You and/or for any pre-contractual obligations thereof.": "Надання персональних даних є необхідним для виконання угоди з вами та/або для будь-яких попередніх зобов'язань з цієї угоди.",
  "Legal obligations:": "Правові обов'язки:",
  "Processing Personal Data is necessary for compliance with a legal obligation to which the DAO is subject.": "Обробка персональних даних є необхідною для виконання правового обов'язку, якому підпорядковується DAO.",
  "Vital interests:": "Життєві інтереси:",
  "Processing Personal Data is necessary in order to protect Your vital interests or of another natural person.": "Обробка персональних даних є необхідною для захисту ваши�� життєвих інтересів або іншої фізичної особи.",
  "Public interests:": "Громадські інтереси:",
  "Processing Personal Data is related to a task that is carried out in the public interest or in the exercise of official authority vested in the DAO.": "Обробка персональних даних пов'язана з завданням, яке виконується в громадському інтересі або в рамках виконання офіційних повноважень, наданих DAO.",
  "Legitimate interests:": "Легітимні інтереси:",
  "Processing Personal Data is necessary for the purposes of the legitimate interests pursued by the DAO.": "Обробка персональних даних є необхідною для цілей легітимних інтересів, які переслідуються DAO.",
  "In any case, the DAO will gladly help to clarify the specific legal basis that applies to the processing, and in particular whether the provision of Personal Data is a statutory or contractual requirement, or a requirement necessary to enter into a contract.": "У будь-якому випадку DAO буде радо допомогти уточнити конкретну правову підставу, яка застосовується до обробки, зокрема, чи є надання персональних даних законним або контрактним вимогою, або вимогою, необхідною для укладення угоди.",
  "Your Rights under the GDPR": "Ваші права за GDPR",
  "The DAO undertakes to respect the confidentiality of Your Personal Data and to guarantee You can exercise Your rights.": "DAO зобов'язується поважати конфіденційність ваших персональних даних та гарантувати, що ви зможете скористатися своїми правами.",
  "You have the right under this Privacy Policy, and by law if You are within the EU, to:": "Ви маєте право за ці��ю Політикою конфіденційності та за законом, якщо ви знаходитесь в ЄС, на:",
  "Request access to Your Personal Data.": "Запит доступу до своїх персональних даних.",
  "The right to access, update or delete the information We have on You. Whenever made possible, you can access, update or request deletion of Your Personal Data directly within Your account settings section. If you are unable to perform these actions yourself, please contact Us to assist You. This also enables You to receive a copy of the Personal Data We hold about You.": "Право на доступ, оновлення або видалення інформації, яку ми маємо про вас. Коли це можливо, ви можете отримати доступ, оновити або запитати видалення своїх персональних даних безпосередньо в розділі налаштувань облікового запису. Якщо ви не можете виконати ці дії самостійно, будь ласка, зв'яжіться з нами для отримання допомоги. Це також дозволяє вам отримати копію персональних даних, які ми маємо про вас.",
  "Request correction of the Personal Data that We hold about You.": "Запит коригування персональних даних, які ми маємо про вас.",
  "You have the right to have any incomplete or inaccurate information We hold about You corrected.": "Ви маєте право вимагати виправлення будь-якої неповної або неточної інформації, яку ми маємо про вас.",
  "Object to processing of Your Personal Data.": "Висловити протест проти обробки ваших персон��льних даних.",
  "This right exists where We are relying on a legitimate interest as the legal basis for Our processing and there is something about Your particular situation, which makes You want to object to our processing of Your Personal Data on this ground. You also have the right to object where We are processing Your Personal Data for direct marketing purposes.": "Це право існує, коли ми покладаємося на легітимний інтерес як правову підставу для нашої обробки, і є щось в вашій конкретній ситуації, що змушує вас бажати заперечити проти нашої обробки ваших персональних даних на цій підставі. Ви також маєте право висловити протест, коли ми обробляємо ваші персональні дані для цілей прямого маркетингу.",
  "Request erasure of Your Personal Data.": "Запит видалення ваших персональних даних.",
  "You have the right to ask Us to delete or remove Personal Data when there is no good reason for Us to continue processing it.": "Ви маєте право попросити нас видалити або видалити персональні дані, коли немає вагомих підстав для продовження нашої обробки.",
  "Request the transfer of Your Personal Data.": "Запит передачі ваших персональних даних.",
  "We will provide to You, or to a third-party You have chosen, Your Personal Data in a structured, commonly used, machine-readable format. Please note that this right only applies to automated information which You initially provided consent for Us to use or where We used the information to perform a contract with You.": "Ми надамо вам, або третій стороні, яку ви обрали, ваші персональні дані у структурованому, загальноприйнятому, машинночитаемому форматі. Зверніть увагу, що це право зас��осовується тільки до автоматизованої інформації, яку ви спочатку надали згоду на використання нами або де ми використовували інформацію для виконання угоди з вами.",
  "Withdraw Your consent.": "Відкликати свою згоду.",
  "You have the right to withdraw Your consent on using your Personal Data. If You withdraw Your consent, We may not be able to provide You with access to certain specific functionalities of the Service.": "Ви маєте право відкликати свою згоду на використання ваших персональних даних. Якщо ви відкликаєте свою згоду, ми можемо не мати можливості надати вам доступ до певних конкретних функцій Сервісу.",
  "Exercising of Your GDPR Data Protection Rights": "Використання Ваших прав захисту даних GDPR",
  "You may exercise Your rights of access, rectification, cancellation and opposition by contacting Us. Please note that we may ask You to verify Your identity before responding to such requests. If You make a request, We will try our best to respond to You as soon as possible.": "Ви можете скористатися своїми правами доступу, виправлення, скасування та опозиції, звернувшись до нас. Зверніть увагу, що ми можемо попросити вас підтвердити свою особу перед відповіддю на такі запити. Якщо ви зробите запит, ми намагатимемося відповісти вам якнайшвидше.",
  "You have the right to complain to a Data Protection Authority about Our collection and use of Your Personal Data. For more information, if You are in the European Economic Area (EEA), please contact Your local data protection authority in the EEA.": "У вас є право скаржитися на орган з питань захисту даних щодо нашого збору та використання ваших особистих даних. Для отримання додаткової інформації, якщо ви знаходитесь в Європейському економічному просторі (ЄЕП), будь ласка, зверніться до місцевого органу з питань захисту даних в ЄЕП.",
  "Children's Privacy": "Конфіденційність дітей",
  "Our Service does not address anyone under the age of 13. We do not knowingly collect personally identifiable information from anyone under the age of 13. If You are a parent or guardian and You are aware that Your child has provided Us with Personal Data, please contact Us. If We become aware that We have collected Personal Data from anyone under the age of 13 without verification of parental consent, We take steps to remove that information from Our servers.": "Наш сервіс не адресований нікому молодше 13 років. Ми не намагаємося свідомо збирати особисту ідентифікаційну інформацію від кого-небудь молодше 13 років. Якщо ви є батьком або опікуном і ви знаєте, що ваша дитина надала нам особисті дані, будь ласка, зв'яжіться з нами. Якщо ми дізнаємося, що ми зібрали особисті дані від кого-небудь молодше 13 років без перевірки згоди батьків, ми вживаємо заходи для видалення цієї інформації з наших серверів.",
  "If We need to rely on consent as a legal basis for processing Your information and Your country requires consent from a parent, We may require Your parent's consent before We collect and use that information.": "Якщо нам потрібно покладатися на згоду як правову підставу для обробки вашої інформації, і ваша країна вимагає згоду від батьків, ми можемо вимагати згоду вашого батька перед збором та використанням цієї інформації.",
  "Links to Other Websites": "Посилання на інші веб-сайти",
  "Our Service may contain links to other websites that are not operated by Us. If You click on a third party link, You will be directed to that third party's site. We strongly advise You to review the Privacy Policy of every site You visit.": "Наш сервіс може містити посилання на інші веб-сайти, які не є нашими. Якщо ви натиснете на посилання на сторонню сторінку, вас б��де перенаправлено на сайт цієї сторонньої сторінки. Ми настійно радимо вам переглянути Політику конфіденційності кожного сайту, який ви відвідуєте.",
  "We have no control over and assume no responsibility for the content, privacy policies or practices of any third party sites or services.": "Ми не маємо контролю над і не несемо відповідальності за вміст, політику конфіденційності або практики будь-яких сторонніх сайтів або сервісів.",
  "Changes to this Privacy Policy": "Зміни в цій Політиці конфіденційності",
  "We may update Our Privacy Policy from time to time. We will notify You of any changes by posting the new Privacy Policy on this page.": "Ми можемо оновлювати нашу Політику конфіденційності з часу в час. Ми повідомимо вас про будь-які зміни, розмістивши нову Політику конфіденційності на цій сторінці.",
  "We will let You know via email and/or a prominent notice on Our Service, prior to the change becoming effective and update the \"Last updated\" date at the top of this Privacy Policy.": "Ми повідомимо вас по електронній пошті і/або видним повідомленням на нашому сервісі, перед тим як зміни набудуть чинності, і оновимо дату \"Останнє оновлення\" у верхній частині цієї Політики конфіденційності.",
  "You are advised to review this Privacy Policy periodically for any changes. Changes to this Privacy Policy are effective when they are posted on this page.": "Вам радять періодично переглядати цю Політику конфіденційності на предмет змін. Зміни в цій Політиці конфіденційності набирають чинності, коли вони розміщені на цій сторінці.",
  "Contact Us": "Зв'яжіться з нами",
  "If you have any questions about this Privacy Policy, You can contact us:": "Якщо у вас є питання щодо цієї Політики конфіденційності, ви можете зв'язатися з нами:",
  "By visiting this page on our website:": "Відвідавши цю сторінку на нашому веб-сайті:"
}